(*=Т-,Р-,L-*)_РRОGRАМ GRАF;_LАВЕL 1;
_СОNSТ П54В=54В;П1=’ ’;ВК=’≡125’;АР2=’≡124’;
S0=’≡160’;S1=’≡161’;LF=’≡175’;ЕND=’≡377’;
ПЛС=’+’;НЕР=’≠’;ТЧК=’.’;ОДН=’1’;ТR=ТRUЕ;FL=FАLSЕ;
_ТУРЕ INТ=INТЕGЕR;ВООL=ВООLЕАN;МНОЖ=_SЕТ _ОF 0..47;
АRМАС=_АRRАУ[0..63]_ОF АLFА;LIТ=’А’..’Z’;NUМ=’0’..’9’;
РУСЛИТ=’А’..’Я’;АRСНАR=_АRRАУ[1..6]_ОF СНАR;
ОКТА=_АRRАУ [1..8]_ОF СНАR;

_VАR NРR:СНАR;B:МНОЖ;
Х0,У0,ХН,УН,ХВ,УВ:INТ;РУС,ЗАХ,ГРФ,МГРФ,SВ:ВООL;А:АLFА;
TTY,ГТИП,NNN,LLL,I,J,К,L,М,ХХ,УУ:INТ;INР:ТЕХТ;

_РRОСЕD WАIТ(Т:INТ);(*=М- Т-ОЖИД В ТАКТАХ*)
_VАR N:INТ;_(Т:=Т_DIV 4;_WНILЕ Т>0_DО 
_(_IF Т>2044_ТНЕN N:=2044_ЕLSЕ N:=Т;Т:=Т-N;
СОDЕ(2СЧ4=Э0507700,)_)_);(*=М+ ЕND WАIТ*)

_РRОСЕD ВЫД(S:ВООL);
_type arr=_array[0..0] _of alfa;
_VАR 
CW:_array [0..1] _of int;
buf:_array [0..324B] _of alfa;
i,j,К,L,М:INТ;p:@arr;c:int;a:_array [0..5] _of char;
map:_record c:_array[0..31] _of int _end;
_(
СОDЕ(СЧ75205=,);L:=;СОDЕ(СЧ75224=,);М:=;
_IF М=L_ТНЕN ЕХIТ;_IF ¬S∧(М-L<300В)_ТНЕN ЕХIТ;LLL:=LLL+М-L;
WRIТЕ(’/’,ВК,’≡1720000000000000000000’);
cw[0] := 1021000611000332C;
cw[1] := 0120T;
ins(cw[1], TTY, 0, 6); ins(cw[0], TTY, 12, 6);
p := ptr(0);
map := [
060261262063B,264065066267B,270071053055B,257254056240B,
140300050251B,300275273333B,335252077047B,243074276072B,
101342102347B,344305366372B,151152113154B,115110317360B,
120303324131B,146330143176B,173175371170B,374140161104B,
306107311312B,314116321322B,123125126327B,132336074276B,
077246077077B,033215245044B,374055137041B,042137077140B,
000012377171B,141124153166B,160164126003B,131043066156B,
216017237113B,147050115014B,210030000150B,215134231232B
];
_for k := l _to m _do _(
unpck(a[0], p@[k]);
_for i := 0 _to 5 _do _(
j := 27 - ord(a[i]) _mod 4 * 9;
a[i] := chr(sel(map.c[ord(a[i]) _div 4], j, 8));
 _);
pck(a[0], buf[k-l]);
_);
m := m - l + 6;
ins(cw[0], m, 0, 12);
code(2Э0714=,);
code(2Э0715=,);
rewrite(output);
WRIТЕ(АР2,’F‾’,ВК);ЕХIТ;
_);(*ЕND ВЫД*)

_РRОСЕD РИС(S:ВООL);
_type arr=_array[0..0] _of alfa;
_VАR 
CW:_array [0..1] _of int;
buf:_array [0..324B] _of alfa;
i,j,К,L,М:INТ;p:@arr;c:int;a:_array [0..5] _of char;
map:_record c:_array[0..31] _of int _end;
_(
СОDЕ(СЧ75205=,);L:=;СОDЕ(СЧ75224=,);М:=;
_IF М=L_ТНЕN ЕХIТ;_IF ¬S∧(М-L<300В)_ТНЕN ЕХIТ;LLL:=LLL+М-L;
WRIТЕ(’/’,ВК,’≡1720000000000000000000’);
cw[0] := 1021000611000332C;
cw[1] := 0120T;
ins(cw[1], TTY, 0, 6); ins(cw[0], TTY, 12, 6);
p := ptr(0);
map := [
060261262063B,264065066267B,270071053055B,257254056240B,
140300050251B,300275273333B,335252077047B,243074276072B,
341342167347B,344145366372B,151152353154B,355356157360B,
162363164365B,146350143176B,173175371170B,374140161104B,
306107311312B,314116321322B,123125126327B,132336074276B,
077246077077B,033215245044B,374055137041B,042137077140B,
000012377171B,141124153166B,160164126003B,131043066156B,
216017237113B,147050115014B,210030000150B,215134231232B,
];
_for k := l _to m _do _(
unpck(a[0], p@[k]);
_for i := 0 _to 5 _do _(
j := 27 - ord(a[i]) _mod 4 * 9;
a[i] := chr(sel(map.c[ord(a[i]) _div 4], j, 8));
 _);
pck(a[0], buf[k-l]);
_);
m := m - l + 6;
ins(cw[0], m, 0, 12);
code(2Э0714=,);
code(2Э0715=,);
rewrite(output);
WRIТЕ(АР2,’F‾’,ВК);ЕХIТ;
_);(*ЕND РИС*)

_FUNСТI ДАТАL:АLFА;(*ВЫДАЕТ ТЕКУЩУЮ ДАТУ ДДММГГ*)
_VАR К,L:INТ;_(К:=00003777776Т;L:=60740103607417С;
СОDЕ(Э050114=,2СБ4=2РБ5,СД120=2ЗЧ4,МР=СД70,2ЗЧ5=МР,
2СМ5=СД140,17ЛС=2СМ4,СД60=17ЛС,2ЗЧ3=)_);(*ЕND ДАТАL*)

_РRОСЕD ВНУК;
_VАR К:INТ;_(
WRIТЕ(’≡257≡21500000000000000’);
К:=TTY;СОDЕ(=ЛСVУК(1),17ЗЧ2=2СЧ3,СД/-14/=ЛСVУК,17ЗЧ1=7ПА72000,
17Э0711=,17Э0712=,);
RЕWRIТЕ(ОUТРUТ);WRIТЕ(’≡033≡306≡336≡215’);ЕXIT;
СОDЕ(VУК:7Э021=7Э100324,Э120=,)
_);

_РRОСЕD НАЧ(С:СНАR);
_(WRIТЕ(’J0’,ВК,’0 ’,С,ВК)_);

_РRОСЕD ВЫП(С:СНАR);
_(WRIТЕ(’2’,ВК,’J1’,ВК,’1 ’,С,ВК);ВЫД(ТR)_);

_РRОСЕD ТЕКТОЧ(АБС:ВООL;Х,У:INТ);
_(_IF АБС_ТНЕN WRIТЕ(’4’)_ЕLSЕ WRIТЕ(’5’);
WRIТЕ(П1,Х:0,П1,У:0,ВК)_);

_РRОСЕD ЛИНА(ТИП,Х1,У1,Х2,У2:INТ);
_(ТЕКТОЧ(ТR,Х1,У1);WRIТЕ(’7’,ТИП:0,П1,Х2:0,П1,У2:0,ВК)_);

_РRОСЕD ЛИНТ(ТИП,Х,У:INТ);
_(WRIТЕ(’7’,ТИП:0,П1,Х:0,П1,У:0,ВК)_);

_РRОСЕD РАМКА(ХН,УН,ХВ,УВ:INТ);
_(WRIТЕ(’] ’,ХН:0,П1,УН:0,П1,ХВ:0,П1,УВ:0,ВК)_);

_РRОСЕD ЯЩИК(ТИП,ХН,УН,ХВ,УВ:INТ);(*ПРЯМОУГОЛЬНИК В АБС КООР*)
_(ТЕКТОЧ(ТR,ХН,УН);ЛИНТ(ТИП,ХН,УВ);ЛИНТ(ТИП,ХВ,УВ);
ЛИНТ(ТИП,ХВ,УН);ЛИНТ(ТИП,ХН,УН)_);(*ЕND ЯЩИК*)

_РRОСЕD СМЕЩ(Х,У:INТ);(*СМЕЩЕНИЕ ОКНА*)
_(WRIТЕ(LF,П1,Х:1,П1,У:1,ВК)_);(*ЕND СМЕЩ*)

_РRОСЕD ОКР(R:INТ);
_(WRIТЕ(’>’,ГТИП:0,П1,R:0,ВК)_);

_РRОСЕD НАЧГРАФ(РАМ:INТ);
_(RЕWRIТЕ(ОUТРUТ);
WRIТЕ(АР2,’У  ’,АР2,’F‾’,ВК,’К’,ВК,’J1’,ВК,’S’,ВК);
_IF РАМ=1_ТНЕN РАМКА(ХН,УН,ХВ,УВ);ВЫД(ТR);WАIТ(40)_);

_РRОСЕD ТЕКФАЙ(МСШ,ОРН,Х,У:INТ);
_(WRIТЕ(INР,ЕND);RЕSЕТ(INР);ТЕКТОЧ(ТR,Х,У);
WRIТЕ(’9’,СНR(МСШ),ВК,’;’,СНR(ОРН),П1);_WНILЕ INР↑≠ЕND_DО 
_(_IF (INР↑_IN РУСЛИТ)∨(INР↑=’≡135’)_ТНЕN 
_(_IF ¬РУС_ТНЕN _(WRIТЕ(S0);РУС:=ТR_)_)
_ЕLSЕ _IF РУС_ТНЕN _(WRIТЕ(S1);РУС:=FL_);
WRIТЕ(INР↑);GЕТ(INР)_);WRIТЕ(ВК)_);

_РRОСЕD СПЕЦ;
_ТУРЕ МАС=_RЕСОRD М:_АRRАУ [1..7]_ОF INТ_);
_VАR ММ:МАС;К:INТ;
_РRОСЕD WN(N:INТ);
_(_САSЕ N_ОF 
0:WRIТЕ(’≡060’);1:WRIТЕ(’≡261’);2:WRIТЕ(’≡262’);
3:WRIТЕ(’≡063’);4:WRIТЕ(’≡264’);5:WRIТЕ(’≡065’);
6:WRIТЕ(’≡066’);7:WRIТЕ(’≡267’);8:WRIТЕ(’≡270’);
9:WRIТЕ(’≡071’)_)_);
_РRОСЕD WS(D:INТ);
_VАR G:INТ;_(WRIТЕ(’≡240’);
G:=SЕL(D,6,2);WN(G);G:=SЕL(D,3,3);WN(G);G:=SЕL(D,0,3);WN(G)_);
_РRОСЕD СИМ(N:INТ);_VАR С:СНАR;М:МНОЖ;
_(WRIТЕ(’≡110≡240’);
N:=N;С:=;М:=;_IF ОDD(САRD(М))_ТНЕN INS(С,1,7,1);WRIТЕ(С);
WRIТЕ(’≡267≡267’);_FОR К_ТО 7_DО WS(ММ.М[К]);WRIТЕ(’≡215’)_);
_(ММ:=[376В,202В,202В,202В,202В,202В,376В];СИМ(3);
ММ:=[020В,050В,104В,202В,222В,174В,020В];СИМ(6);
ММ:=[154В,222В,202В,202В,104В,050В,020В];СИМ(7);
ММ:=[020В,070В,124В,376В,124В,020В,070В];СИМ(10В);
ММ:=[020В,050В,104В,202В,104В,050В,020В];СИМ(11В);
ММ:=[070В,104В,202В,202В,202В,104В,070В];СИМ(13В);
ММ:=[356В,356В,376В,070В,376В,356В,356В];СИМ(2);
ММ:=[376В,376В,376В,376В,376В,376В,376В];СИМ(1);
ММ:=[020В,070В,124В,020В,020В,020В,020В];СИМ(4);
ММ:=[050В,050В,050В,050В,154В,050В,020В];СИМ(5);
ВНУК_);

_РRОСЕD СИМВОЛЫ(МСШ:INТ);
_VАR К,УУ,ШГ:INТ;А:АLFА;S:_АRRАУ [1..6]_ОF СНАR;
_РRОСЕD WС(I:INТ);
_VАR С:СНАR;М:МНОЖ;_(С:=СНR(I);М:=;_IF ОDD(САRD(М))_ТНЕN 
INS(С,1,7,1);WRIТЕ(С)_);(*ЕND WС*)
_РRОСЕD НС;
_(WRIТЕ(’≡215’);ВНУК;WАIТ(10);RЕWRIТЕ(ОUТРUТ);
WRIТЕ(АР2,’F‾’,ВК);УУ:=УУ-ШГ;ТЕКТОЧ(ТR,40,УУ);ВЫД(ТR);
RЕWRIТЕ(ОUТРUТ);WRIТЕ(’≡033≡306≡336≡215≡273≡240’)_);
_(_IF МСШ=1_ТНЕN _(НАЧГРАФ(1);УУ:=340;ШГ:=30_)
_ЕLSЕ _(УУ:=340-ШГ*6;ШГ:=20;RЕWRIТЕ(ОUТРUТ);WRIТЕ(АР2,’F‾’,ВК)_);
ТЕКТОЧ(ТR,40,УУ);WRIТЕ(’9’,МСШ:0,ВК,’:0’,ВК);ВЫД(ТR);
RЕWRIТЕ(ОUТРUТ);WRIТЕ(’≡033≡306≡336≡215≡273≡240’);
WС(17В);_FОR К:=41В_ТО 57В_DО WС(К);
_FОR К:=72В_ТО 100В_DО WС(К);
_FОR К:=133В_ТО 140В_DО WС(К);
_FОR К:=173В_ТО 176В_DО WС(К);НС;
_FОR К:=101В_ТО 132В_DО WС(К);НС;
_FОR К:=141В_ТО 172В_DО WС(К);НС;
WС(16В);_FОR К:=140В_ТО 176В_DО WС(К);WС(137В);НС;
_FОR К:=100В_ТО 136В_DО WС(К);НС;
_FОR К:=60В_ТО 71В_DО WС(К);НС;RЕWRIТЕ(ОUТРUТ);
_IF МСШ=0_ТНЕN 
_(WRIТЕ(АР2,’F‾’,ВК);ТЕКТОЧ(ТR,180,35);ВЫД(ТR);
RЕWRIТЕ(ОUТРUТ);WRIТЕ(’≡033≡306≡336≡215’);СПЕЦ;
WRIТЕ(’≡273≡240’);_FОR К:=1В_ТО 13В_DО 
_IF К≠12В_ТНЕN _(WС(К);WС(40В)_);WС(15В);ВНУК;RЕWRIТЕ(ОUТРUТ);
WRIТЕ(АР2,’F‾’,ВК);RЕWRIТЕ(INР);А:=ДАТАL;UNРСК(S[1],А);
РУС:=FL;WRIТЕ(INР,’МОСКВА’);ТЕКФАЙ(0,1,450,53);RЕWRIТЕ(INР);
WRIТЕ(INР,S[1],S[2],’.’,S[3],S[4],’.’,S[5],S[6]);
ТЕКФАЙ(0,1,460,30);РИС(ТR)_)_);(*ЕND СИМВОЛЫ*)

_РRОСЕD ТЕКСТ(МСШ,ОРН,Х,У:INТ);
_(ТЕКТОЧ(ТR,Х,У);
WRIТЕ(’9’,СНR(МСШ),ВК,’;’,СНR(ОРН),П1);_WНILЕ INРUТ↑≠ЕND_DО 
_(_IF (INРUТ↑_IN РУСЛИТ)∨(INРUТ↑=’≡135’)_ТНЕN 
_(_IF ¬РУС_ТНЕN _(WRIТЕ(S0);РУС:=ТR_)_)
_ЕLSЕ _IF РУС_ТНЕN _(WRIТЕ(S1);РУС:=FL_);
WRIТЕ(INРUТ↑);GЕТ(INРUТ)_);WRIТЕ(ВК)_);(*ЕND ТЕКСТ*)

_РRОСЕD СТРОКИ;
_LАВЕL 11;_VАR К,УУ,СС:INТ;
_РRОСЕD НС;
_(WRIТЕ(ВК);РИС(ТR);УУ:=УУ-32;СС:=СС+1;
_IF СС>=10_ТНЕN _GОТО 1;
ТЕКТОЧ(ТR,48,УУ);ВЫД(ТR);WRIТЕ(’; ’)_);(*ЕND НС*)
_(УУ:=330;РУС:=FL;СС:=;ТЕКТОЧ(ТR,48,УУ);
WRIТЕ(’91’,ВК,’:0 ’,ВК,’; ’);
_IF INРUТ↑≠’≡377’_ТНЕN _GОТО 11;_RЕРЕАТ ВIND(’> ≡377’);
11:_IF INРUТ↑=’≡377’_ТНЕN ЕХIТ;К:=0;
_WНILЕ INРUТ↑≠’≡377’_DО 
_(_IF (INРUТ↑_IN РУСЛИТ)∨(INРUТ↑=’≡135’)_ТНЕN 
_(_IF ¬РУС_ТНЕN _(WRIТЕ(S0);РУС:=ТR_)_)
_ЕLSЕ _IF РУС_ТНЕN _(WRIТЕ(S1);РУС:=FL_);
WRIТЕ(INРUТ↑);GЕТ(INРUТ);К:=К+1;
_IF К>32_ТНЕN _(К:=0;НС_)_);
_IF К≠0_ТНЕN НС_UNТIL FL_);(*ЕND НС*)

_РRОСЕD ФУНК(ВВ,АМР,N,ХА,ХВ,Ф,W:INТ);
_VАR Х,У,DХ:RЕАL;I:INТ;
_(DХ:=АВS(ХВ-ХА)/N;ТЕКТОЧ(ТR,ХА,ВВ);
_FОR I_ТО N_DО _(Х:=ХА+I*DХ;
У:=ВВ+АМР*ЕХР((-Х+ХА)/W)*SIN((Х-ХА)/Ф)/(2+СОS(Х));
ЛИНТ(ГТИП,RОUND(Х),RОUND(У));РИС(FL)_)_);

_РRОСЕD ЗАГОЛ;_VАR А:АLFА;С:_АRRАУ [1..6]_ОF СНАR;
_(НАЧГРАФ(0);РУС:=FL;А:=ДАТАL;UNРСК(С[1],А);
RЕWRIТЕ(INР);WRIТЕ(INР,’ИТМ’);ТЕКФАЙ(1,0,200,300);
RЕWRIТЕ(INР);WRIТЕ(INР,’И’);ТЕКФАЙ(0,0,250,300);
RЕWRIТЕ(INР);WRIТЕ(INР,’ВТ АН СССР’);ТЕКФАЙ(1,0,265,300);
RЕWRIТЕ(INР);WRIТЕ(INР,’П Р Е Д С Т А В Л Я Е Т’);
ТЕКФАЙ(1,0,140,230);
RЕWRIТЕ(INР);WRIТЕ(INР,’ДИСПЛЕЙ "ЭЛЕКТРОНИКА МС 7401"’);
ТЕКФАЙ(1,0,100,180);
RЕWRIТЕ(INР);WRIТЕ(INР,С[1],С[2],ТЧК,С[3],С[4],ТЧК,С[5],С[6]);
ТЕКФАЙ(1,0,300,125);
РИС(ТR)_);(*ЕND ЗАГОЛ*)

_РRОСЕD ПРОБ;_(_WНILЕ INРUТ↑=П1_DО GЕТ(INРUТ)_);

_FUNСТI ТАКЕ:INТ;(*=М- ПРИЕМ ЦЕЛОГО*)
_VАR К:INТ;_(К:=0;
_WНILЕ INРUТ↑_IN NUМ_DО _(К:=К*10+ОRD(INРUТ↑);GЕТ(INРUТ)_);
ТАКЕ:=К;ПРОБ_);(*М- ЕND ТАКЕ*)

_FUNСТI SТАКЕ(Р,Q:INТ):INТ;(*ПРИЕМ С ПРОВЕРКОЙ*)
_LАВЕL 88;_VАR L:INТ;V:ВООL;
_(88:_IF INРUТ↑=’К’_ТНЕN _GОТО 1;V:=INРUТ↑=ЕND;
L:=ТАКЕ;_IF (L<Р)∨(L>Q)∨V_ТНЕN _(RЕWRIТЕ(ОUТРUТ);
WRIТЕLN(’ДАЙ ЧИСЛО ОТ ’,Р:1,’ ДО ’,Q:1);ВIND(’ --> ≡377’);
_GОТО 88_);SТАКЕ:=L_);(*ЕND SТАКЕ*)

_РRОСЕD ЛИНТЕК(ТИП,Х,У:INТ);
_(WRIТЕ(’8’,ТИП:0,П1,Х:0,П1,У:0,ВК)_);

_РRОСЕD ЛИНИИ;(*=М- ТИПЫ ЛИНИЙ*)_VАR NN,I,J,ХТ,УТ:INТ;
_РRОСЕD РИСУЙ(ТИП:INТ);_VАR К,L:INТ;
_(ТЕКТОЧ(ТR,ХТ,УТ);ЛИНТ(ТИП,ХТ,УТ+200);
ЛИНТ(ТИП,ХТ+350,УТ+200);ЛИНТ(ТИП,ХТ+350,УТ);
ЛИНТ(ТИП,ХТ,УТ)_);(*ЕND РИСУЙ*)
_(NN:=SТАКЕ(1,8);НАЧГРАФ(0);ХТ:=50;УТ:=20;
_FОR I_ТО 23_DО 
_(J:=I_МОD 8;_IF J_IN [1..5,7]_ТНЕN _(ХТ:=ХТ+NN;УТ:=УТ+NN;
РИСУЙ(J);ВЫД(FL)_)_);ВЫД(ТR)_);(*=М+ ЕND ЛИНИИ*)

_РRОСЕD ХLINЕ(R1,Z1,R2,Z2:RЕАL);
_VАR Х1,Х2,У1,У2:INТ;
_(Х1:=RОUND(R1);Х2:=RОUND(R2);У1:=RОUND(Z1);У2:=RОUND(Z2);
ЛИНА(ГТИП,Х1,У1,Х2,У2);ВЫД(FL)_);

_РRОСЕD ЦЕПЬ;(*=М- ИМИТАЦИЯ СХЕМЫ*)
_VАR ХН,УН,LК,LЛ:INТ;
_РRОСЕD КВ(N:INТ);_VАR ХЛ,УЛ:INТ;
_(ТЕКТОЧ(ТR,ХН,УН);ЛИНТЕК(ГТИП,0,LК);ЛИНТЕК(ГТИП,LК,0);
ЛИНТЕК(ГТИП,0,-LК);ЛИНТЕК(ГТИП,-LК,0);
_SЕLЕСТ 
N=1:_(ХЛ:=ХН+LК_DIV 2;УЛ:=УН+LК;ТЕКТОЧ(ТR,ХЛ,УЛ);
ЛИНТЕК(ГТИП,0,LЛ);УН:=УЛ+LЛ_);
N=2:_(ХЛ:=ХН+LК;УЛ:=УН+LК_DIV 2;ТЕКТОЧ(ТR,ХЛ,УЛ);
ЛИНТЕК(ГТИП,LЛ,0);ХН:=ХЛ+LЛ_);
N=3:_(ХЛ:=ХН+LК_DIV 2;УЛ:=УН;
ТЕКТОЧ(ТR,ХЛ,УЛ);ЛИНТЕК(ГТИП,0,-LЛ);УН:=(УЛ-LЛ-LК)_)_);ВЫД(FL)_);
_(ХН:=0;УН:=250;LК:=30;LЛ:=40;
КВ(2);КВ(3);КВ(3);КВ(2);КВ(1);КВ(2);КВ(3);
КВ(3);КВ(2);КВ(1);КВ(1);КВ(1);КВ(1);КВ(2);
КВ(3);КВ(2);КВ(3);КВ(3);КВ(2);КВ(3);
ТЕКТОЧ(ТR,ХН,УН);ЛИНТЕК(ГТИП,0,LК);ЛИНТЕК(ГТИП,LК,0);
ЛИНТЕК(ГТИП,0,-LК);ЛИНТЕК(ГТИП,-LК,0)_);(*=М+ ЕND ЦЕПЬ*)

_РRОСЕD LАDУ(R,R1,Н,L,N:INТ;МСШ:RЕАL);
_VАR LL,RR,RL,К,М,Х1,У1,Х2,У2,Х3,У3:RЕАL;I,ТТ:INТ;
_РRОСЕD ХLN(R1,Z1,R2,Z2:RЕАL);
_(ХLINЕ(R1+265,Z1+40+2*Н,R2+265,Z2+40+2*Н)_);
_РRОСЕD ХLN1(R1,Z1,R2,Z2:RЕАL);
_(ХLINЕ(R1+265,Z1+40,R2+265,Z2+40)_);
_РRОСЕD КОРНИ(Х1,У1:RЕАL;_VАR Х2,У2,Х3,У3:RЕАL);
_VАR ХХ,УУ,ХУ,УR,А,АА,В,ВВ,А1,А2,С,Q,Q1,Q2:RЕАL;
_(ХХ:=Х1*Х1;УУ:=У1*У1;ХУ:=ХХ+УУ;
А:=RL+ХУ;АА:=А*А;В:=-4*Х1*А;ВВ:=В*В;А1:=4*ХУ;А2:=2*А1;
С:=АА-4*УУ*RR;Q:=4*А1*С;Q1:=SQRТ(ВВ-Q);
Х2:=(-В-Q1)/А2;Х3:=(-В+Q1)/А2;
У2:=0.5*(А-2*Х1*Х2)/У1;У3:=0.5*(А-2*Х1*Х3)/У1_);(*ЕND КОРНИ*)
_(LL:=L*L;RR:=R*R;RL:=RR-LL;К:=85/N;
_FОR I:=0_ТО N_DО _(М:=6.28*(90-К*I)/360;
Х1:=R1*СОS(М);У1:=R1*SIN(М)+Н;
КОРНИ(Х1,У1,Х2,У2,Х3,У3);
Х2:=Х2*МСШ;Х3:=Х3*МСШ;У2:=У2*МСШ;У3:=У3*МСШ;
ХLN1(0.0,0.0,Х2,У2);ХLN1(Х2,У2,Х1,У1);
ХLN1(Х1,У1,Х3,У3);ХLN1(Х3,У3,0.0,0.0)_);Х0:=0;У0:=0;
_FОR I:=0_ТО N-1_DО _(М:=6.28*(90+К*(I+1))/360;
Х1:=R1*СОS(М);У1:=R1*SIN(М)+Н;
КОРНИ(Х1,У1,Х2,У2,Х3,У3);
Х2:=Х2*МСШ;Х3:=Х3*МСШ;У2:=У2*МСШ;У3:=У3*МСШ;
ХLN1(0.0,0.0,Х2,У2);ХLN1(Х2,У2,Х1,У1);
ХLN1(Х1,У1,Х3,У3);ХLN1(Х3,У3,0.0,0.0)_);
Х0:=0;У0:=0;_FОR I:=0_ТО N_DО 
_(М:=6.28*(90-К*I)/360;
Х1:=R1*СОS(М);У1:=R1*SIN(М)+Н;У1:=-У1;
КОРНИ(Х1,У1,Х2,У2,Х3,У3);
Х2:=Х2*МСШ;Х3:=Х3*МСШ;У2:=У2*МСШ;У3:=У3*МСШ;
ХLN(0.0,0.0,Х2,У2);ХLN(Х2,У2,Х1,У1);
ХLN(Х1,У1,Х3,У3);ХLN(Х3,У3,0.0,0.0)_);
_FОR I:=0_ТО N-1_DО _(М:=6.28*(90+К*(I+1))/360;
Х1:=R1*СОS(М);У1:=R1*SIN(М)+Н;У1:=-У1;
КОРНИ(Х1,У1,Х2,У2,Х3,У3);
Х2:=Х2*МСШ;Х3:=Х3*МСШ;У2:=У2*МСШ;У3:=У3*МСШ;
ХLN(0.0,0.0,Х2,У2);ХLN(Х2,У2,Х1,У1);
ХLN(Х1,У1,Х3,У3);ХLN(Х3,У3,0.0,0.0)_);ВЫД(ТR)_);(*ЕND LАDУ*)

_РRОСЕD ШАР(Z1,Z2:INТ;К:RЕАL;FI,N:INТ);
_VАR R1,R2,Х1,Х2,У1,У2,RD,DЕL:RЕАL;I:INТ;
_(R1:=Z1;R2:=Z2;N:=N-1;RD:=6.28/360;DЕL:=360/N;
_FОR I:=0_ТО N_DО 
_(Х1:=R1*СОS(RD*DЕL*I);У1:=R1*SIN(RD*DЕL*I);
Х2:=R2*К*СОS((540+FI-DЕL*I)*RD);У2:=R2*SIN((540+FI-DЕL*I)*RD);
ХLINЕ(У1+277,Х1+200,У2+277,Х2+200)_)_);(*ЕND ШАР*)

_РRОСЕD КОТ;
_СОNSТ К40=20;К39=К40-1;К81=41;К80=К81-1;
_VАR I,К,L:INТ;Р,КК,К1,К2,К3,S,DЕL,Х3,Х4,Х5:RЕАL;
Х1,Х2,У1,У2,У3:RЕАL;U1,U2,U3,V1,V2,V3:_АRRАУ[1..К81]_ОF RЕАL;
_РRОСЕD ХLN(R1,Z1,R2,Z2:RЕАL);
_(ХLINЕ(R1+275,Z1+200,R2+275,Z2+200)_);(*ЕND ХLN*)
_РRОСЕD ПРОЦ1(N:INТ);_VАR I:INТ;Х1,Х2,У1,У2:RЕАL;
_(Х1:=-L;У1:=Х1;U1[1]:=Х1;V1[1]:=У1;
_FОR I_ТО N_DО 
_(У2:=-L+I/N*L*2;Х2:=Р/L*У2*У2-(1+Р)*L;U1[I+1]:=Х2;V1[I+1]:=У2;
ХLN(Х1,У1,Х2,У2);Х1:=Х2;У1:=У2_)_);(*ЕND ПРОЦ1*)
_РRОСЕD ПРОЦ2(N:INТ);_VАR I:INТ;Х1,Х2,У1,У2:RЕАL;
_(Х1:=-L;У1:=Х1;U2[1]:=Х1;V2[1]:=Х1;
_FОR I_ТО N_DО 
_(Х2:=-L+I/N*L*2;У2:=Р/L*Х2*Х2-(1+Р)*L;U2[I+1]:=Х2;V2[I+1]:=У2;
ХLN(Х1,У1,Х2,У2);Х1:=Х2;У1:=У2_)_);(*ЕND ПОЦ2*)
_РRОСЕD ПРОЦ3(N:INТ);_VАR I:INТ;Х1,Х2,У1,У2:RЕАL;
_(Х1:=L;У1:=Х1;U3[К81]:=Х1;V3[К81]:=У1;
_FОR I_ТО N_DО 
_(У2:=L-I/N*L*2;Х2:=(1+Р)*L-Р/L*У2*У2;U3[К81-I]:=Х2;V3[К81-I]:=У2;
ХLN(Х1,У1,Х2,У2);Х1:=Х2;У1:=У2_)_);(*ЕND ПРОЦ3*)
_(L:=120;Р:=0.25;S:=450.0;КК:=204/240;
К1:=1.65;К2:=0.14;К3:=0.964;DЕL:=0.127*КК;
ПРОЦ1(К80);ПРОЦ2(К80);ПРОЦ3(К80);
К:=-2;_WНILЕ К≠3_DО 
_(Х3:=К1*L;Х4:=К2*L*К;Х5:=К3*L;
ХLN(-Х3,Х4-Х5+DЕL,Х3,-Х4-Х5+DЕL);К:=К+1_);
_FОR I_ТО К39_DО 
_(S:=(1-I/К40)*L;Х3:=L-S;ХLN(S,S,-Х3,Х3)_);
_FОR I_ТО К80_DО 
_(Х2:=U2[I];У2:=V2[I];Х3:=U3[I];У3:=V3[I];
ХLN(Х2,У2,Х3,У3);
S:=(1-(I-1)/К40)*L;ХLN(Х3,У3,S,S);ХLN(S,S,Х2,У2);_);
Х3:=L;ХLN(Х3,-Х3,-Х3,Х3);ХLN(-Х3,Х3,-Х3,-Х3);ХLN(-Х3,-Х3,Х3,-Х3);
_FОR I_ТО К80_DО 
_(Х2:=U2[К81-I];У2:=V2[К81-I];Х3:=U1[I];У3:=V1[I];
ХLN(Х2,У2,Х3,У3);
S:=(1-(I-1)/К40)*L;ХLN(Х3,У3,-S,S);ХLN(-S,S,Х2,У2)_)
_);(*ЕND КОТ*)

_РRОСЕD УЗОР(L,N,N1:INТ;КК:RЕАL);
_СОNSТ ККК=3.0;_VАR I,Т:INТ;АХ,АУ:_АRRАУ [1..20]_ОF RЕАL;
_РRОСЕD ХLN(R1,Z1,R2,Z2:RЕАL);
_(ХLINЕ(R1+100,Z1+5,R2+100,Z2+5)_);(*ЕND ХLN*)
_РRОСЕD ВПИСАН(N,NN:INТ;К:RЕАL);
_VАR N1,J,I,Т:INТ;Х1,У1:RЕАL;
_(N1:=N-1;_FОR J:=1_ТО NN_DО 
_(Х1:=АХ[1];У1:=АУ[1];
_FОR I:=1_ТО N1_DО 
_(АХ[I]:=АХ[I]+К*(АХ[I+1]-АХ[I]);
АУ[I]:=АУ[I]+К*(АУ[I+1]-АУ[I])_);
АХ[N]:=АХ[N]+К*(Х1-АХ[N]);
АУ[N]:=АУ[N]+К*(У1-АУ[N]);
_FОR I:=1_ТО N1_DО 
ХLN(АХ[I],АУ[I],АХ[I+1],АУ[I+1]);
ХLN(АХ[N],АУ[N],АХ[1],АУ[1])_)_);(*ЕND ВПИСАН*)
_(ХLN(0.0,0.0,0.0,ККК*L);ХLN(0.0,ККК*L,ККК*L,ККК*L);
ХLN(ККК*L,ККК*L,ККК*L,0.0);ХLN(ККК*L,0.0,0.0,0.0);
АХ[1]:=0.0;АУ[1]:=0.0;АХ[2]:=0.0;АУ[2]:=L;АХ[3]:=L;АУ[3]:=L;
ХLN(АХ[2],АУ[2],АХ[3],АУ[3]);ХLN(АХ[3],АУ[3],АХ[1],АУ[1]);
ВПИСАН(3,N,КК);
АХ[1]:=0.0;АУ[1]:=0.0;АХ[2]:=L;АУ[2]:=0.0;АХ[3]:=L;АУ[3]:=L;
ВПИСАН(3,N,КК);
АХ[1]:=0.0;АУ[1]:=L;АХ[2]:=0.0;АУ[2]:=3*L;
АХ[3]:=L;АУ[3]:=2.0*L;АХ[4]:=L;АУ[4]:=L;
_FОR I:=2_ТО 3_DО ХLN(АХ[I],АУ[I],АХ[I+1],АУ[I+1]);
ХLN(АХ[4],АУ[4],АХ[1],АУ[1]);
ВПИСАН(4,N1,КК);
АХ[1]:=L;АУ[1]:=2.0*L;АХ[2]:=2.0*L;АУ[2]:=2.0*L;
АХ[3]:=3.0*L;АУ[3]:=3.0*L;АХ[4]:=0.0;АУ[4]:=3.0*L;
_FОR I:=1_ТО 3_DО ХLN(АХ[I],АУ[I],АХ[I+1],АУ[I+1]);
ВПИСАН(4,N1,КК);
АХ[1]:=3.0*L;АУ[1]:=3.0*L;АХ[2]:=3.0*L;АУ[2]:=0.0;
АХ[3]:=2.0*L;АУ[3]:=L;АХ[4]:=2.0*L;АУ[4]:=2.0*L;
_FОR I:=1_ТО 3_DО ХLN(АХ[I],АУ[I],АХ[I+1],АУ[I+1]);
ВПИСАН(4,N1,КК);
АХ[1]:=2.0*L;АУ[1]:=L;АХ[2]:=L;АУ[2]:=L;
АХ[3]:=L;АУ[3]:=0.0;АХ[4]:=3.0*L;АУ[4]:=0.0;
_FОR I:=1_ТО 2_DО ХLN(АХ[I],АУ[I],АХ[I+1],АУ[I+1]);
ВПИСАН(4,N1,КК);
АХ[1]:=2.0*L;АУ[1]:=2.0*L;АХ[2]:=L;АУ[2]:=2.0*L;
АХ[3]:=L;АУ[3]:=L;ХLN(АХ[3],АУ[3],АХ[1],АУ[1]);
ВПИСАН(3,N,КК);
АХ[1]:=2.0*L;АУ[1]:=2.0*L;АХ[2]:=2.0*L;АУ[2]:=L;
АХ[3]:=L;АУ[3]:=L;ВПИСАН(3,N,КК)_);(*ЕND УЗОР*)

_FUNСТI ПРИКАЗ:АLFА;
_VАR А:АLFА;К:INТ;
_(ВIND(’ ==) ≡377’);ПРОБ;_IF INРUТ↑=’=’_ТНЕN 
(Е)_FОR К_ТО 4_DО _(GЕТ(INРUТ);_IF INРUТ↑=ЕND_ТНЕN _ЕХIТ Е_);
А:=’’;К:=1;_WНILЕ (INРUТ↑_IN LIТ)∧(К<4)_DО 
_(СОDЕ(2СЧ4=СД70,1ЛС7=2ЗЧ4,);GЕТ(INРUТ);К:=К+1_);
ПРИКАЗ:=А;_WНILЕ INРUТ↑_IN LIТ_DО GЕТ(INРUТ);ПРОБ_);

_РRОСЕD ПОЛГРАФ(R,N:INТ);
_VАR I,J:INТ;D,U:RЕАL;
МХ,МУ:_АRRАУ [0..100]_ОF RЕАL;
_РRОСЕD ХLN(Х1,У1,Х2,У2:RЕАL);
_(ХLINЕ(Х1+275,У1+200,Х2+275,У2+200)_);
_(_IF N>100_ТНЕN ЕХIТ;
D:=360/N;U:=6.28/360;_FОR I:=0_ТО N-1_DО 
_(МХ[I]:=R*СОS(U*D*I);МУ[I]:=R*SIN(U*D*I)_);
МХ[N]:=МХ[0];МУ[N]:=МУ[0];
_FОR I:=0_ТО N-1_DО _FОR J:=I+1_ТО N-1_DО 
ХLN(МХ[I],МУ[I],МХ[J],МУ[J])_);(*ЕND ПОЛГРАФ*)

_FUNСТI RАNDОМ:RЕАL;(* СЛУЧАЙНОЕ ЧИСЛО В (0,1) *)
_(СОDЕ(К;ВР77=17ЗЧ1,РА3=СЧХRАND,АУАRАND=МР,
ЦССRАND=ЛУЕВПИЛ,ЛСЕСОРВ=ЗЧХRАND,РА=АС,17РК1=ПБЮЮR,
С;ХRАND:0,АRАND:4004142135623735,
СRАND:0003303130564677,ЕВПИЛ:0017777777777777,Л;ЕСОРВ:В1/57,
К;ЮЮR:ЗЧ=,);RАNDОМ:=;_);(*ЕND RАNDОМ*)

_РRОСЕD RАND0;(* НАЧАЛЬНАЯ УСТАНОВКА RАNDОМ *)
_(СОDЕ(К;Э05310=,СД/-31/=ЗЧХRАND,Э050114=,
СД/-5/=ЦСХRАND,ЛУЕВПИЛ=ЛСЕСОРВ,ЗЧХRАND=,)_);(*ЕND RАND0*)

_РRОСЕD ФИМЯ(_VАR М:ОКТА);(*ФОРМИР СЛУЧ ИМЯ*)
_LАВЕL 33;_СОNSТ VL=85;SVL=VL*6;
_VАR К,L,N,Р:INТ;С:АRСНАR;G,R:СНАR;Z:↑_АRRАУ [1..VL]_ОF АLFА;
_(СОDЕ(ПБМФБ=,);
WRIТЕ(’ОБУЧЕНИИОПЫТНЫХПРОГРАММИСТОВТАКЖЕИМЕЮТСЯСИНТАКСИЧЕСКИЕСЕМАНТИЧЕСКИЕАСПЕКТЫКУРСЯРАЗРАБОТКЕАЛГОРИТМОВСОСРЕДОТОЧЕНЫЗНАНИЯХПОДРОБНОСТИНИХСТАРАЮТСЯВЫДЕЛИТЬОТДЕЛЬНЫЕОБСУЖДЕНИЯВООБЩЕОПУСТИТЬКУРСАХОБУЧЕНИЯВТОРОМУТРЕТЬЕМУЯЗЫКУПРОГРАММИРОВАНИЯОСНОВНОЕВНИМАНИЕУДЕЛЯЕТСЯЭКВИВАЛЕНТАМИЗВЕСТНЫХСЛУШАТЕЛЯМПОНЯТИЙСОЧЛИТРЕБОВАНИЕИСПЫТУЕМЫМЗАДАВАТЬВОПРОСЫТАКОМОГРАНИЧЕННОМФОРМАТЕПОЗВОЛЯЕТИЗМЕРИТЬСПОСОБНОСТИРЕШАТЬЗАДАЧИФОРМУЛИРУЯЗАПРОСЫИССЛЕДОВАТЬСИСТЕМЫЕСТЕСТВЕННЫМЯЗЫКОМСЛЕДУЕТТЩАТЕЛЬНОУЧИТЫВАЯПСИХОЛОГИЧЕСКИЕПРИНЦИПЫПОЛЬЗОВАТЕ’);
СОDЕ(МФБ:7ПАМФБ=7СА77776,7СЧ=УИ7,ВИ7=);Z:=;
RАND0;33:L:=ТRUNС(RАNDОМ*SVL);N:=L_DIV 6;L:=L-N*6+1;
UNРСК(С[1],Z↑[N+1]);М[1]:=С[L];G:=;_IF G=’Ь’_ТНЕN _GОТО 33;
_FОR Р:=2_ТО 8_DО _(L:=ТRUNС(RАNDОМ*SVL);
N:=L_DIV 6;L:=L-N*6+1;N:=N+1;
UNРСК(С[1],Z↑[N]);_RЕРЕАТ R:=С[L];L:=L+1;
_IF L=7_ТНЕN _(L:=1;N:=N+1;
_IF N>VL_ТНЕN N:=1;UNРСК(С[1],Z↑[N])_)_UNТIL R=G;
_IF L<7_ТНЕN G:=С[L]_ЕLSЕ _(
_IF N>VL_ТНЕN N:=1;UNРСК(С[1],Z↑[N]);G:=С[1]_);
М[Р]:=G_);_FОR N:=2_ТО 7_DО 
_IF (М[N-1]=М[N])∧(М[N]=М[N+1])_ТНЕN _GОТО 33_);(*ЕND ФИМЯ*)

_РRОСЕD РОЗА;(*РОЗЕТКА*)_LАВЕL 12;
_VАR I,(*!*)К,NТ:INТ;NG,SG:ВООL;МС:ОКТА;
А,В,С,D,DL,F,Н,J,L,М,N,SN,Р,Q,R,S,Т,У,SМ,Z1,Z2:RЕАL;
_РRОСЕD ИМЯ;_VАR Q:INТ;_(РУС:=FL;RЕWRIТЕ(INР);Q:=ТRUNС(N);
_IF N<10_ТНЕN WRIТЕ(INР,СНR(0));
WRIТЕ(INР,Q:1);ТЕКФАЙ(1,0,25,360);РИС(ТR);RЕWRIТЕ(INР);
_FОR К_ТО 8_DО WRIТЕ(INР,МС[К]);ТЕКФАЙ(1,0,405,25);РИС(ТR)_);
_FUNСТI ХХ(F:RЕАL):RЕАL;
_(ХХ:=(SIN(N*F)*Р+Н)*СОS(F)+СОS((J*N+А)*F)*М+СОS((Т*N+А)*F)*S+280_);
_FUNСТI УУ(F:RЕАL):RЕАL;
_(УУ:=(SIN(N*F)*Р+Н)*SIN(F)+SIN((J*N+А)*F)*М+SIN((Т*N+А)*F)*S+200_);
_(Q:=АRСSIN(1.0)*4.0;I:=0;NG:=;SG:=;
_IF INРUТ↑_IN LIТ_ТНЕN _(NG:=ТR;
_FОR К_ТО 8_DО _(_IF INРUТ↑_IN LIТ_ТНЕN _(МС[К]:=INРUТ↑;
GЕТ(INРUТ)_)_ЕLSЕ МС[К]:=П1_);
_WНILЕ (INРUТ↑_IN LIТ)∨(INРUТ↑=П1)_DО GЕТ(INРUТ);
_IF INРUТ↑_IN NUМ_ТНЕN _(SN:=SТАКЕ(1,12);
SG:=ТR_)_)_ЕLSЕ ФИМЯ(МС);
_FОR К_ТО 8_DО _(_IF МС[К]≠П1_ТНЕN I:=I+ОRD(МС[К]);I:=I*16_);
СОDЕ(2СЧ3=ЛСЕСОРВ,ЗЧХRАND=,);N:=RАNDОМ;
12:А:=1.0;N:=ТRUNС(7.0*RАNDОМ+4.0);_IF SG_ТНЕN N:=SN;
J:=ТRUNС(6.5*RАNDОМ+2.0)*2.0;
Т:=ТRUNС(8.5*RАNDОМ+2.0)*2.0;
SМ:=J+Т;_IF RАNDОМ>0.5_ТНЕN J:=-J_ЕLSЕ Т:=-Т;
Р:=RАNDОМ*40.0;М:=RАNDОМ*32.0-16.0;S:=RАNDОМ*32.0-16.0;
_IF (АВS(М)+АВS(S))<10_ТНЕN _GОТО 12;
Н:=50.0-Р-АВS(М)-АВS(S);_IF Н<0_ТНЕN _GОТО 12;
D:=Q/(40.0*N*SМ);С:=0.0;L:=;I:=ТRUNС(SМ*40.0);
_FОR К:=0_ТО I_DО _(У:=К;F:=У*D;
Z1:=ХХ(F)-280;Z2:=УУ(F)-200;R:=SQRТ(Z1*Z1+Z2*Z2);
_IF R>С_ТНЕN _(L:=F;С:=R_)_);
_FОR К_ТО 2_DО _(В:=L;D:=D*0.1;_FОR I:=-9_ТО 9_DО _(
У:=I;F:=У*D+В;Z1:=ХХ(F)-280;Z2:=УУ(F)-200;R:=SQRТ(Z1*Z1+Z2*Z2);
_IF R>С_ТНЕN _(L:=F;С:=R_)_)_);
С:=170.0/С;Н:=Н*С;Р:=Р*С;М:=М*С;S:=S*С;
НАЧГРАФ(0);РАМКА(8,1,552,398);
_IF NG_ТНЕN ИМЯ;
ТЕКТОЧ(ТR,RОUND(ХХ(0.0)),RОUND(УУ(0.0)));NТ:=ТRUNС(N*250.0);
DL:=Q/NТ;_FОR К:=0_ТО NТ_DО _(У:=DL*К;
ЛИНТ(ГТИП,RОUND(ХХ(У)),RОUND(УУ(У)));ВЫД(FL)_);
ВЫД(ТR);_IF ¬NG_ТНЕN ИМЯ;RЕWRIТЕ(ОUТРUТ)_);(*ЕND РОЗА*)

_РRОСЕD СОЛНЦЕ;_VАR К:INТ;(*СОЛНЦЕ*)
_(НАЧГРАФ(0);РАМКА(8,1,552,398);
ТЕКТОЧ(ТR,280,200);_FОR К_ТО 150_DО _(ОКР(К);ВЫД(FL)_);
ВЫД(ТR)_);(*ЕND СОЛНЦЕ*)

_РRОСЕD КИНО;(*ДВИЖЕНИЕ ОКРУЖНОСТИ*)_VАR К,L,М,I,J,NN,QQ:INТ;
_(NN:=SТАКЕ(2,60);QQ:=SТАКЕ(1,350);
М:=(61_DIV (NN+1))+1;НАЧГРАФ(0);РАМКА(8,1,552,398);
НАЧ(ОДН);_FОR К_ТО 29_DО _(J:=12*К;
_SЕLЕСТ К<8:I:=(К-1)*16;К>21:I:=(К-29)*16;ТR:I:=(15-К)*16_);
ТЕКТОЧ(ТR,100+J,200+I);WRIТЕ(ПЛС,ВК);ОКР(NN);
_IF К=1_ТНЕN ОКР(NN)_ЕLSЕ _(_IF ГТИП≠0_ТНЕN _(
ТЕКТОЧ(ТR,4,6);ЛИНТ(ГТИП,4,6+QQ);ТЕКТОЧ(ТR,100+J,200+I);
WRIТЕ(НЕР,ВК);ОКР(NN)_)_);ВЫД(FL)_);WRIТЕ(ПЛС,ВК);ОКР(NN);
_FОR L_ТО М_DО _(ВЫП(ОДН);
WАIТ(NN*13+(29*QQ)_DIV 32+20)_)_);(*ЕND КИНО*)

_РRОСЕD ПТИЦА;(*ПОЛЕТ ПТИЦЫ*)_СОNSТ NП=4;ДNП=8;
_VАR I,J,К,L,М,NN,QQ,ХТ,УТ,ХН,УН,ХВ,УВ,ПОЛ,УП:INТ;
ПХ,ПУ:_RЕСОRD МС:_АRRАУ[1..NП,0..4]_ОF INТ_);
_РRОСЕD ПТ(J:INТ);_VАR К:INТ;Q:RЕАL;
_(Q:=2-(УТ-УН)/УП;
ТЕКТОЧ(ТR,RОUND(Q*ПХ.МС[J,0])+ХТ,RОUND(Q*ПУ.МС[J,0])+УТ);
_FОR К_ТО 4_DО ЛИНТ(ГТИП,
RОUND(Q*ПХ.МС[J,К])+ХТ,RОUND(Q*ПУ.МС[J,К])+УТ);
ВЫД(FL)_);(*ЕND ПТ*)
_(NN:=SТАКЕ(2,10);QQ:=SТАКЕ(1,350);LLL:=0;
ПХ:=[-5,-3,0,3,5,-6,-3,0,3,6,-7,-3,0,3,7,-8,-4,0,4,8];
ПУ:=[4,1,-4,1,4,2,3,-3,3,2,0,2,-2,2,0,-1,1,-1,1,-1];
ХН:=8;УН:=1;ХВ:=552;УВ:=398;ПОЛ:=50;М:=8;
I:=(ХВ-ХН-ПОЛ)_DIV (NN*2);J:=(УВ-УН-ПОЛ)_DIV NN;
_IF I<J_ТНЕN L:=I_ЕLSЕ L:=J;
НАЧГРАФ(1);НАЧ(ОДН);WRIТЕ(ПЛС,ВК);ХН:=ХН+ПОЛ;УН:=УН+ПОЛ+30;
ТЕКТОЧ(ТR,ХН,УН);ОКР(4);
УП:=L*NN+УН;_FОR К:=0_ТО L_DО _(J:=(К_МОD (NП+2))+1;
_IF J>NП_ТНЕN J:=ДNП-J;
ХТ:=ХН+NN*К*2;УТ:=УН+NN*К;WRIТЕ(ПЛС,ВК);ПТ(J);
_IF ГТИП≠0_ТНЕN_(ТЕКТОЧ(ТR,4,6);
ЛИНТ(ГТИП,4,6+QQ);WRIТЕ(НЕР,ВК);ПТ(J)_)_);
_FОR J_ТО М_DО _(ВЫП(ОДН);WАIТ((L+3)*(120+QQ)_DIV 50+40)_);
RЕWRIТЕ(ОUТРUТ);WRIТЕLN(’ВСЕГО БАЙТ ’,LLL*6:1)_);(*ЕND ПТИЦА*)

_РRОСЕD ЧАСЫ(ЧЧ,ММ,Т,R:INТ;БС:ВООL);
_СОNSТ ПИ=3.1416;Х0=270;У0=200;
_VАR I,К,Х1,Х2,У1,У2,R1,R2,RR1,RR2:INТ;Ф,DФ:RЕАL;S:АLFА;G:АRСНАR;
_РRОСЕD БЭСМ(_VАR Н,М:INТ);
_VАR К:INТ;
_(СОDЕ(Э05310=,);К:=;К:=К_DIV 50;Н:=К_DIV 3600;
М:=(К_МОD 3600)_DIV 60_);
_РRОСЕD ЧМ(Ч,М:INТ);
_VАR I,N,ХМ1,ХМ2,УМ1,УМ2,ХЧ1,ХЧ2,УЧ1,УЧ2,К,
Х0М1,Х0М2,У0М1,У0М2,Х0Ч1,Х0Ч2,У0Ч1,У0Ч2:INТ;
ЕРS,ФМ,ФЧ,DФМ,DФЧ:RЕАL;ВВ,В:ВООL;
_(DФМ:=ПИ/30;_IF БС_ТНЕN _(DФЧ:=ПИ/72;Т:=1;N:=30;ЕРS:=ПИ/360_)
_ЕLSЕ _(DФЧ:=ПИ/24;ЕРS:=ПИ/120_);ФМ:=ПИ/2-DФМ*М;ФЧ:=ПИ/2-ПИ/6*Ч;
_IF БС_ТНЕN ФЧ:=ФЧ-DФЧ*(М_DIV 5)_ЕLSЕ ФЧ:=ФЧ-DФЧ*(М_DIV 15);
ХМ1:=Х0+RОUND(130*СОS(ФМ));УМ1:=У0+RОUND(130*SIN(ФМ));
ХЧ1:=Х0+RОUND(95*СОS(ФЧ));УЧ1:=У0+RОUND(95*SIN(ФЧ));
Х0М1:=Х0+RОUND(15*СОS(ФМ));У0М1:=У0+RОUND(15*SIN(ФМ));
Х0Ч1:=Х0+RОUND(15*СОS(ФЧ));У0Ч1:=У0+RОUND(15*SIN(ФЧ));
WRIТЕ(’J1’,ВК);ЛИНА(7,Х0М1,У0М1,ХМ1,УМ1);
ЛИНА(7,Х0Ч1,У0Ч1,ХЧ1,УЧ1);ВЫД(ТR);
НАЧ(’2’);_FОR I:=(Ч+1)_ТО (Ч+Т)_DО 
_FОR К:=(М+1)_ТО (М+N)_DО 
_(_IF БС_ТНЕN ВВ:=(К_МОD 5)=0_ЕLSЕ ВВ:=(К_МОD 15)=0;ФМ:=ФМ-DФМ;
_IF ВВ_ТНЕN ФЧ:=ФЧ-DФЧ;ХМ2:=Х0+RОUND(130*СОS(ФМ));
УМ2:=У0+RОUND(130*SIN(ФМ));Х0М2:=Х0+RОUND(15*СОS(ФМ));
У0М2:=У0+RОUND(15*SIN(ФМ));_IF ВВ_ТНЕN _(ХЧ2:=Х0+RОUND(100*СОS(ФЧ));
УЧ2:=У0+RОUND(100*SIN(ФЧ));Х0Ч2:=Х0+RОUND(15*СОS(ФЧ));
У0Ч2:=У0+RОUND(15*SIN(ФЧ))_);WRIТЕ(’1 1’,ВК,’≠’,ВК);
ЛИНА(7,Х0М1,У0М1,ХМ1,УМ1);_IF ВВ_ТНЕN ЛИНА(7,Х0Ч1,У0Ч1,ХЧ1,УЧ1);
WRIТЕ(’+’,ВК);ЛИНА(7,Х0М2,У0М2,ХМ2,УМ2);
_IF ВВ_ТНЕN _(ЛИНА(7,Х0Ч2,У0Ч2,ХЧ2,УЧ2);ХЧ1:=ХЧ2;УЧ1:=УЧ2;
Х0Ч1:=Х0Ч2;У0Ч1:=У0Ч2_)_ЕLSЕ 
_IF (АВS(ФМ+DФМ-ФЧ))<=ЕРS_ТНЕN 
ЛИНА(7,Х0Ч1,У0Ч1,ХЧ1,УЧ1);ХМ1:=ХМ2;УМ1:=УМ2;Х0М1:=Х0М2;У0М1:=У0М2;
ВЫД(FL)_);WRIТЕ(’* 2’,ВК);
WRIТЕ(’3’,ВК);ВЫД(ТR)_);
_(НАЧГРАФ(1);S:=ДАТАL;UNРСК(G[1],S);RЕWRIТЕ(INР);
РУС:=FL;WRIТЕ(INР,G[1],G[2],’.’,G[3],G[4],’.’,G[5],G[6]);
ТЕКФАЙ(1,0,25,355);РИС(ТR);
ТЕКТОЧ(ТR,Х0,У0);ОКР(R);DФ:=ПИ/6;R1:=R-6;R2:=R+6;
RR1:=R-2;RR2:=R+2;_FОR I:=0_ТО 11_DО 
_(Ф:=ПИ/2-DФ*I;Х1:=Х0+RОUND(R1*СОS(Ф));
У1:=У0+RОUND(R1*SIN(Ф));Х2:=Х0+RОUND(R2*СОS(Ф));
У2:=У0+RОUND(R2*SIN(Ф));_IF (I=3)∨(I=9)_ТНЕN 
_(ЛИНА(7,Х1,У1+2,Х2,У2+2);ЛИНА(7,Х1,У1-2,Х2,У2-2)_)_ЕLSЕ 
_IF (I=0)∨(I=6)_ТНЕN _(ЛИНА(7,Х1-2,У1,Х2-2,У2);
ЛИНА(7,Х1+2,У1,Х2+2,У2)_)_ЕLSЕ ЛИНА(7,Х1,У1,Х2,У2)_);ВЫД(FL);
DФ:=ПИ/30;_FОR I_ТО 59_DО _IF (I_МОD 5)≠0_ТНЕN 
_(Ф:=ПИ/2-DФ*I;Х1:=Х0+RОUND(RR1*СОS(Ф));
У1:=У0+RОUND(RR1*SIN(Ф));Х2:=Х0+RОUND(RR2*СОS(Ф));
У2:=У0+RОUND(RR2*SIN(Ф));ЛИНА(1,Х1,У1,Х2,У2);ВЫД(FL)_);
ЛИНА(1,Х0,У0,Х0,У0+R1);ВЫД(ТR);
НАЧ(’1’);Х1:=Х0;У1:=У0+R1;DФ:=ПИ/30;_FОR I_ТО 60_DО 
_(Ф:=ПИ/2-DФ*I;Х2:=Х0+RОUND(R1*СОS(Ф));У2:=У0+RОUND(R1*SIN(Ф));
_IF I≠1_ТНЕN ЛИНА(1,570,0,570,3600)_ЕLSЕ 
_(ТЕКТОЧ(ТR,Х0,У0);ОКР(15);ЛИНА(1,570,0,570,2300)_);
WRIТЕ(’≠’,ВК);ЛИНА(1,Х0,У0,Х1,У1);Х1:=Х2;У1:=У2;
WRIТЕ(’+’,ВК);ЛИНА(1,Х0,У0,Х2,У2);ВЫД(FL)_);
WRIТЕ(’3’,ВК);ВЫД(ТR);_IF БС_ТНЕN БЭСМ(ЧЧ,ММ);ММ:=ММ+1;ЧМ(ЧЧ,ММ);
WRIТЕ(’J1’,ВК,’1 2’,ВК);ВЫД(ТR);
RЕWRIТЕ(ОUТРUТ);WRIТЕL(’ ВСЕГО = ’,LLL*6:0,’ БАЙТ’)_);

_(Х0:=0;У0:=;LLL:=;
СОDЕ(Э071=,);B:=;TTY:=MINEL(B)+1;
ХН:=8;УН:=1;ХВ:=554;УВ:=398;ГТИП:=1;
_RЕРЕАТ 1:  
RЕWRIТЕ(ОUТРUТ);
WRIТЕL(’ --> ШАР,КОТ,УЗОР,ГРАФ <N>,ЛЕДИ,РОЗА [<СЛОВО> [<N>] ],СОЛНЦЕ,
     ЦЕПЬ,ФУНКЦИЯ,ЛИНИИ <N>,СИМВОЛЫ,ТЕКСТ [<ТЕКСТ>],
     СЕТКА,ЗАГОЛОВОК,ОКРУЖНОСТИ <N>,КИНО <N N>,ПТИЦА <N N>,ЧАСЫ,ТИП <N>’);
А:=ПРИКАЗ;_SЕLЕСТ 
(’ВЫХ’=А)∨(’КОН’=А):_(RЕWRIТЕ(ОUТРUТ);
WRIТЕLN(’  <-*-> КОНЕЦ <-*->’);СОDЕ(ПБ76002=)_);
’ЦЕП’=А:_(НАЧГРАФ(0);ЦЕПЬ;ВЫД(ТR)_);
’ЛЕД’=А:_(НАЧГРАФ(1);LАDУ(110,68,155,180,16,1.0)_);
’ШАР’=А:_(НАЧГРАФ(1);ШАР(90,250,0.43,57,180);ВЫД(ТR)_);
’КОТ’=А:_(НАЧГРАФ(1);КОТ;ВЫД(ТR)_);
’СИМ’=А:_(СИМВОЛЫ(1);СИМВОЛЫ(0)_);
’ГРА’=А:_(К:=SТАКЕ(2,40);НАЧГРАФ(1);ПОЛГРАФ(150,К);ВЫД(ТR)_);
’УЗО’=А:_(НАЧГРАФ(0);УЗОР(130,30,45,0.05);ВЫД(ТR)_);
’ЛИН’=А:ЛИНИИ;
’ЧАС’=А:_(SВ:=INРUТ↑=ЕND;_IF ¬SВ_ТНЕN _(I:=ТАКЕ;К:=ТАКЕ;
_IF INРUТ↑=ЕND_ТНЕN J:=1_ЕLSЕ J:=SТАКЕ(1,9)_);ЧАСЫ(I,К,J,150,SВ)_);
’ТЕК’=А:_(НАЧГРАФ(1);СТРОКИ_);
’ФУН’=А:_(НАЧГРАФ(0);ЯЩИК(ГТИП,50,50,520,350);
ТЕКТОЧ(ТR,50,200);ЛИНТ(ГТИП,520,200);РИС(FL);
ФУНК(200,150,500,50,520,5,200);РИС(ТR)_);
’ОКР’=А:_(NNN:=SТАКЕ(0,520);
НАЧГРАФ(0);РАМКА(8,1,552,398);СМЕЩ(700,0);
_FОR К_ТО 25_DО _(J:=5*К;
ТЕКТОЧ(ТR,980+J-NNN,200);ОКР(J);
ТЕКТОЧ(ТR,980-J+NNN,200);ОКР(J);ВЫД(FL)_);
ВЫД(ТR)_);
’КИН’=А:КИНО;
’ПТИ’=А:ПТИЦА;
’РОЗ’=А:РОЗА;
’СОЛ’=А:СОЛНЦЕ;
’СЕТ’=А:_(НАЧГРАФ(0);РАМКА(8,1,552,398);ХХ:=8;УУ:=8;
_FОR К_ТО 78_DО _(ТЕКТОЧ(ТR,К*7,0);ЛИНТ(ГТИП,К*7,398);ВЫД(FL)_);
_FОR К_ТО 57_DО _(ТЕКТОЧ(ТR,0,К*7);ЛИНТ(ГТИП,558,К*7);ВЫД(FL)_);
ВЫД(ТR)_);
’ЗАГ’=А:ЗАГОЛ;
’ТИП’=А:_(_IF INРUТ↑_IN NUМ_ТНЕN _(
К:=SТАКЕ(0,7);(*_IF К=6_ТНЕN _(WRIТЕLN(’6 НЕЛЬЗЯ’);_GОТО 1_);*)
ГТИП:=К_);WRIТЕLN(’ТИП ЛИНИЙ ’,ГТИП:1)_)
_END
_UNТIL FL_).
