*****************************************************
* архивная система марс-6:                          *
* работа с ассоциативными массивами ключ-данные     *
* во внешней памяти (дизассемблирование, анализ)    *
* исходно в. и. филиппов, 1978-80                   *
*****************************************************
БАНДИТ СТАРТ ’2000’
М4     ЕQU   4 базовый регистр кода
М13    ЕQU   11 указатель на вектор данных
М5     ЕQU   5
М6     ЕQU   6
М7     ЕQU   7
М16    ЕQU   14
       УПОТР ВDVЕСТ(М13)
       УПОТР БАНДИТ(М4)
       КОНД  В’0’
       КОНД  П’БАНДИТ’
SТАRТ  СЧИ   М16 основная точка входа, вызов по М16
       ПБ    ЕNТЕR
АВDV   ПАМ   1
АRСН   КОНД  В’0000000001550063’ dflt каталог архива НУ 53, зона 63
       СЧИ   М16  дополнительная точка входа?
       ЗП    SАVМ16
       ПБ    ЕNТЕR2
SАVМ16 ПАМ   1
D00010 КОНД  П’190280’  дата версии?
D00011 ПАМ   1
D00012 ПАМ   1
SАVМ13 ПАМ   1
GОТО   ПАМ   1
D00015 ПАМ   1
USRLОС ПАМ   1
SАVМ7  ПАМ   1
SАVМ6  ПАМ   1
SАVМ5  ПАМ   1
JМРОFF ПАМ   1
D00023 ПАМ   1
D00024 ПАМ   1
D00025 ПАМ   1
D00026 ПАМ   1
NЕGКЕУ ПАМ   1
D00030 ПАМ   1
D00031 ПАМ   1
D00032 ПАМ   1
SАVМ4  ПАМ   1
D00034 ПАМ   1
WОRК   ПАМ   1
D00036 ПАМ   1
ИСЭ70  ПАМ   1
D00040 ПАМ   1
SАVRК  ПАМ   1
SWIТСН ПБ    СМD0
К01    ЗП    NЕGКЕУ
       ПБ    СМD1
К02    СЧ    VSЕЕD
       ПБ    FIND
К03    СЧ    Е1
       ЗП
К04    УИ    М16
       ПБ    СМD4
К05    ЗП    D00011
       ПБ    СМD5
К06    ЗП    IDХ
       ПБ    СМD6
К07    СЧ    В22
       ПБ    СМD7
К10    ЗП    WНIСН
       ПБ    МКСТL
К11    СЧ    КЕУ
       ПБ    FIND
К12    СЧИ   М13
       ПБ    СМD12
К13    ЗП    LОС47
       ПБ    РR425
К14    СЧ    СURКЕУ
       ПБ    СКЕХSТ
К15    СЧ    СURКЕУ
       ПБ    СКDNЕХ
К16    ВЧ    МУLЕN
       ПБ    СМD16
К17    ВЧ    МУLЕN
       ПБ    СМD17
К20    СЧ    МУLОС
       ПБ    СМD20
К21    СЧ    МУLОС
       ПБ    FLUSН
К22    СЧ    АDЕSСR
       ПБ    СРУОUТ
К23    СЧ    АDЕSСR
       ПБ    FRЕЕ
К24    СЧ    GIVЕNР
       ПБ    СНКРSW
К25    СЧ    DВDЕSС
       ПБ    SЕТСТL
К26    СЧ    КЕУ
       ПБ    СМD26
К27    ЗП    LОС36
       ПБ    СМD27
К30    СЧ    LОС3
       ПБ    NЕХТ
К31    СЧ    Е12
       ПБ    RООТ
К32    СЧ    LОС12
       ПБ    СМD32
К33    СЧ    АDЕSСR
       ПБ    РR342
К34    СЧ    LОС41
       ПБ    СМD34
К35    СЧ    DIRТУ
       ПБ    SАVЕ
К36    СЧ    LОС12
       ПБ    СМD36
К37    СЧ    СURСМD
       СДА   64+12
К40    ПБ    NЕХТ
К41    СЧ    СМРОFF
       ПБ    К43
К42    СЧ    В4
К43    ЗП    JМРОFF
       ПБ    СМD43
К44    СЧ    LОС41
       ПБ    СМD44
К45    СЧ    ВDТАВ
       ПБ    LОСК
К46    СЧ    МУLОС
       ПБ    СМD46
К47    СЧ    LОС41
       ПБ    ОUТАDR-ВDVЕСТ(М13)
К50    СЧ    В3
       ПБ    СМD50
К51    СЧ    AMYLOC
       ПБ    СМD51
К52    СЧ    СURСМD
       ПБ    СМD52
К53    СЧ    СURСМD
       ПБ    МОVЕ
К54    СЧ    СURСМD
       ПБ    СМD54
К55    МОД   SАVМ16
       ПБ
СМD32  МОД   АIТЕМ-ВDVЕСТ(М13)
       ЗП
       СЧ    WНIСН
       ПО    А00123
       СЧ    Е2
А00123 СЛЦ   Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       ПБ    (М6)
ЕNТЕR  ЗП    SАVМ16
       СЧИ   М13
       ЗП    SАVМ13
       СЧРЖ  ’7777’
       ЗП    SАVRК
       РЖА   ’3’
       СЧ    АВDV
       УИ    М13
       СЧИ   М7
       ЗП    SАVМ7
       СЧИ   М5
       ЗП    SАVМ5
       МОД   ВDТАВ-ВDVЕСТ(М13)
       СЧ
       НТЖ   RООТFL
       ПО    А00141
       СЧ    Е70МSК
       ПО    А00141
       СЧ    ВDТАВ
       СДА   64-20
       ИЛИ   Е40
       ИЛИ   Е70МSК
       ЗП    ИСЭ70
       Э70   ИСЭ70
А00141 СЧИ   М6
       ЗП    SАVМ6
ЕNТЕR2 СЧ    LОС3
       ПБ    NЕХТ
А00143 СЧ    Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
* если GOTO не 0, переходим по содержимому и обнуляем его
RTNEXT МОД   GОТО
       УИА   0(М5)
       СЧ
       ЗП    GОТО
       МОДА  (М5)
       ПИНО  (М5)
* выборка следующей команды
СМD0   СЧ    СURСМD
       СДА   64+6
NЕХТ   ПО    А00626 команды кончились
       ЗП    СURСМD
       И     Е6П1
       УИ    М5
А00153 МОДА  СМD0
       УИА   0(М6) возврат на выборку след. команды
       СЧ
       ЗП    GОТО
       МОДА  (М5)
       ПБ    SWIТСН
* команда 11: поиск ключа в текущем массиве       
FIND   ЗП    NЕGКЕУ
       ПО    ВАDNАМ ключ не должен быть нулевым
       И     Е48
       ПЕ    ВАDNАМ в ключе не должно быть 48 р.
*      IDX := 0
СМD1   ЗП    IDХ 
       СЧ    NЕGКЕУ
       НТЖ   VSЕЕD
       ЗП    NЕGКЕУ теперь в NEGKEY инверсный ключ
СМD1А  МОДА  LОС56-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧ    LОС20
       ПО    А00212
А00164 СЧ    -1(М16)
       И     Е10П1
       УИ    М5
       ПО    А00172
А00166 МОДА  (М5)
       СЧ    -2(М16)
       СЛЦ   NЕGКЕУ
       ПЕ    А00172
       СЛИА  -2(М5)
       МОДА  А00166
       ПИНО  (М5)
А00172 СЛИА  -2(М5)
       СЧИ   М5
       ИЛИ   Е31
       МОД   IDХ-ВDVЕСТ(М13)
       ЗП    АRRАУ
       СЧ    1(М16)
       И     Е48
       ПО    А00371
       СЧ    IDХ
       СЛЦ   Е2
       ЗП    IDХ
       МОДА  (М16)
       СЧ    1(М5)
       МОДА  А00215
       УИА   0(М6)
* процедура  возвращается по М6
* установка текущей записи по дескриптору на СМ
РR202  МОДА  LОС116-ВDVЕСТ(М13)
       УИА   0(М16)
А00203 МОД   IDХ-ВDVЕСТ(М13)
       ЗП    LОС20
       И     Е19П1
       ЗП    LОС116
       СЧИ   М16
       ЗП    USRLОС
       СЛЦ   Е2
       ЗП    LОС50
       СЧ    LОС116
       НТЖ   LОС246
       ПО    (М6)
       СЧ    LОС116
       ЗП    LОС246
       ПБ    А00530
*******************************
А00212 МОДА  СМD1А
       УИА   0(М6)
А00213 СЧ    Е11
       МОДА  LОС54-ВDVЕСТ(М13)
       УИА   0(М16)
       ПБ    А00203
А00215 МОДА  LОС120-ВDVЕСТ(М13)
       УИА   0(М16)
       ПБ    А00164
* команда 54: mem[bdvec[next_insn]] := bdvec[10] ???       
СМD54  СДА   64+6
       ЗП    СURСМD
       И     Е6П1
       УИ    М16
       СЧ    LОС12
       МОДА  (М16)
       МОД   (М13)
       ЗП
       ПБ    (М6)
*******************************
МОVЕ   СДА   64+6
       ЗП    СURСМD
       И     Е6П1
       УИ    М16
       СЧ    СURСМD
       СДА   64+6
       ЗП    СURСМD
       И     Е6П1
       УИ    М5
       МОДА  (М5)
       СЧ    ВDVЕСТ
       ПБ    А00241
*******************************
СМD50  МОДА  NЕХТ
       УИА   0(М6)
СМD51  УИ    М16
       СЧ    СURСМD
       СДА   64+6
       ЗП    СURСМD
       И     Е6П1
       УИ    М5
       СЛИ   М5(М13)
       СЧ    (М5)
       СЛЦ   Е1
       ЗП    (М5)
       МОД   (М5)
       СЧ    -1
А00241 МОДА  (М16)
       ЗП    ВDVЕСТ
       ПБ    (М6)
*******************************
СМD52  СДА   64+6
       ЗП    СURСМD
       И     Е6П1
       ПБ    СМD51
*******************************
СМD46  СДА   64+18
       И     Е15П1
       ВЧ    LОС53
       ЗП    LОС42
       СЧ    МУLОС
       СДА   64+33
       И     В17777
       ПО    А00562
       ЗП    МУLЕN
       ПБ    (М6)
* команда 45: захват базы
LОСК   СДА   64-20
       ИЛИ   Е70МSК
       ЗП    WОRК
       ИЛИ   Е40
       ЗП    ИСЭ70
       Э70   ИСЭ70
       МОД   ВDТАВ-ВDVЕСТ(М13)
       СЧ    1
       НТЖ   Е32
       МОД   ВDТАВ-ВDVЕСТ(М13)
       ЗП    1
       И     Е32
       ПО    СLАSН
       МОД   ВDВUF-ВDVЕСТ(М13)
       ЗП
       Э70   WОRК
       ПБ    (М6)
СМD44  ЗП    АDЕSСR
       ПБ    (М6)
СМD36  МОД   LОС50-ВDVЕСТ(М13)
       УИА   0(М16)
       МОД   IDХ-ВDVЕСТ(М13)
       МОД   АRRАУ-ВDVЕСТ(М13)
       ЗП    1(М16)
       ПБ    А01160
А00267 МОДА  РR531
       ПВ    (М5)
А00270 СЧ    NЕGКЕУ
       УИ    М16
       ВЧ    СURРОS
       ПЕ    А00274
       ЗП    NЕGКЕУ
       МОД   СURРОS-ВDVЕСТ(М13)
       УИА   0(М16)
       УИА   0(М5)
А00274 МОД   JМРОFF
       ПБ    А00275
А00275 МОДА  А00315
       ПИО   (М16)
       МОД   АIТЕМ-ВDVЕСТ(М13)
       СЧ    -1(М16)
       МОД   USRLОС
       ЗП    -1(М16)
       СЛИА  -1(М16)
       ПБ    А00275
А00301 СЧ    WНIСН
       ПО    А00303
       СЧ    Е1
А00303 СЛЦ   Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       МОДА  А00315
       ПИО   (М16)
       МОД   USRLОС
       СЧ    -1(М16)
       МОД   АIТЕМ-ВDVЕСТ(М13)
       ЗП    -1(М16)
       СЛИА  -1(М16)
       ПБ    А00301
А00311 МОД   АIТЕМ-ВDVЕСТ(М13)
       СЧ    -1(М16)
       МОД   USRLОС
       НТЖ   -1(М16)
       ПЕ    К37
       СЛИА  -1(М16)
       МОДА  А00311
       ПИНО  (М16)
А00315 СЧ    USRLОС
       СЛЦ   СURРОS
       ЗП    USRLОС
       МОДА
       МОДА  А00325
       ПИО   (М5)
       СЧ    АIТЕМ
       СЛЦ   NЕGКЕУ
       ЗП    АIТЕМ
       СЧ    СURРОS
       ВЧ    NЕGКЕУ
       ЗП    СURРОS
       МОД   АIТЕМ-ВDVЕСТ(М13)
       СЧ
       ЗП    LОС41
       ПБ    (М6)
А00325 СЧ    LОС220
       СДА   64+20
       И     Е19П1
       ПЕ    А00267
       СЧ    JМРОFF
       НТЖ   Е5
       ПО    А00332
       СЧ    NЕGКЕУ
       ПО    (М6)
А00332 УИА   7(М16)
       ПБ    SКIР
*******************************
СМD7   ЗП    JМРОFF
       СЧ    LОС42
А00334 ЗП    NЕGКЕУ
       СЛЦ   LОС53
       ЗП    LОС53
       СЧ    МУLОС
       ЗП    USRLОС
       ПБ    А00270
*******************************
СМD43  СЧ    МУLЕN
       ПБ    А00334
А00340 МОДА  РR531
       ПВ    (М5)
       ПБ    К07
* процедура возвращается по М6       
РR342  МОДА  РR531
       ПВ    (М5)
       МОД   АIТЕМ-ВDVЕСТ(М13)
       СЧ
       ЗП    LОС41
       И     Е15П1
       ЗП    LОС47
       СЧ
       ЗП    LОС53
       ПБ    (М6)
* команда 24: "проверка пароля"
СНКРSW НТЖ   SАVЕDР
       ПО    СМD0
       УИА   17(М16) неверный пароль
       ПБ    ЕRR
* команда 15: проверка, что ключа нет       
СКDNЕХ НТЖ   КЕУ
       ПЕ    СМD0
       УИА   9(М16) ключ уже есть
       ПБ    SКIР
* команда 14: проверка, что ключ есть   
СКЕХSТ НТЖ   КЕУ
       ПО    СМD0
       УИА   8(М16) ключа нет
       ПБ    SКIР
*******************************
А00355 СЛЦ   Е2
       УИ    М5
       МОД   LОС50-ВDVЕСТ(М13)
       НТЖ   -1
       И     Е10П1
       ПЕ    А00367
       МОД   LОС50-ВDVЕСТ(М13)
       СЧ    -1
       И     Е29П11
       ПО    NОNЕХТ нет след. записи
       СДА   64+10
       МОДА  РR202
       ПВ    (М6)
       МОД   IDХ-ВDVЕСТ(М13)
       СЧ    ВDТАВ
       СЛЦ   Е16
       МОД   IDХ-ВDVЕСТ(М13)
       ЗП    ВDТАВ
       УИА   0(М5)
А00367 СЧИ   М5
       ИЛИ   Е31
       МОД   IDХ-ВDVЕСТ(М13)
       ЗП    АRRАУ
А00371 МОД   LОС50-ВDVЕСТ(М13)
       СЧ    (М5)
       ЗП    СURКЕУ
       МОД   LОС50-ВDVЕСТ(М13)
       СЧ    1(М5)
       ЗП    АDЕSСR
       ПБ    RTNEXT
* команда 5
СМD5   МОДА  FLUSН
       УИА   0(М6)
РR376  СЧ    LОС20
       ЗП    D00012
       СЧ    В41
       ЗП    МУLЕN
       СЧ    Е2
       ЗП    D00010
       МОДА  D00010
       УИА   0(М16)
       СЧИ   М16
       ЗП    USRLОС
       ПБ    (М6)
* команда 6
СМD6   СЧ    В41
       ЗП    LОС47
       МОДА  LОС54-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧ    АDЕSСR
       ПБ    А00203
* выполняем команду 4 как процедуру по М6
STEP   СЧИ   М6
       ЗП    GОТО
* команда 4: шаг вперед или назад
СМD4   МОД   IDХ-ВDVЕСТ(М13)
       СЧ    АRRАУ
       ПО    ЕМРТУ нет тек. записи
       УИ    М5
       МОДА  А00355
       ПИО   (М16) шаг вперед
       МОДА  А00415
       ПИО   (М5)
А00414 СЛИА  -2(М5)
       ПБ    А00367
А00415 МОД   LОС50-ВDVЕСТ(М13)
       СЧ    -1
       СДА   64+29
       ПО    NОРRЕD
       МОДА  РR202
       ПВ    (М6)
       МОД   IDХ-ВDVЕСТ(М13)
       СЧ    ВDТАВ
       ВЧ    Е16
       МОД   IDХ-ВDVЕСТ(М13)
       ЗП    ВDТАВ
       СЧ    LОС117
       И     Е10П1
       УИ    М5
       ПБ    А00414
* процедура возвращается по М6       
РR425  МОД   DВLЕN-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧ
       ЗП    LОС47
А00427 МОД   LОС34-ВDVЕСТ(М13)
       СЧ    -1(М16)
       ПО    А00431
       ВЧ    Е1
А00431 СЛЦ   LОС47
       ЗП    LОС47
       СЛИА  -1(М16)
       МОДА  А00427
       ПИНО  (М16)
       ПБ    (М6)
* команда 16: какая-то работа со строками символов
СМD16  УИ    М16
       СЧ    МУLОС
       СЛЦ   МУLЕN
       ЗП    D00036
       СЧ    LОС40
       СДА   64+8
       ПЕ    А00440
       СЧ    LОС40
А00440 СДА   64-40
       ЗП    LОС116
       УИА   -4(М5)
А00442 СДА   64+8
       ИЛИ   LОС116
       МОДА  А00442
       ЦИКЛ  (М5)
       ЗП    LОС116
А00445 УИА   -5(М5)
       МОД   D00036
       СЧ    (М16)
       НТЖ   LОС116
А00447 СДА   64+40
       УИ    М6
       МОДА  А00455
       ПИО   (М6)
       СЧМР
А00452 МОДА  А00447
       ЦИКЛ  (М5)
А00453 МОДА  А00445
       ЦИКЛ  (М16)
       УИА   10(М16) нет симв. конца
       ПБ    ЕRR
А00455 СЧМР
       НТЖ   LОС116
       ЗП    D00031
       СЧ    LОС40
       СДА   64+8
       ПО    А00470
       СЧ    LОС40
       СДА   64-40
       МОДА  А00465
       ПИО   (М5)
       НТЖ   D00031
       СДА   64+40
       ПО    А00470
       СЧ    D00031
       НТЖ   LОС116
       ПБ    А00452
А00465 МОД   D00036
       МОДА  1(М16)
       НТЖ
       СДА   64+40
       ПЕ    А00453
       СЛИА  1(М16)
А00470 МОД   МУLЕN-ВDVЕСТ(М13)
       СЛИА  1(М16)
       СЧИ   М16
       ЗП    МУLЕN
       ПБ    СМD0
СМD17  УИ    М16
       СЧ    МУLОС
       СЛЦ   МУLЕN
       ЗП    D00036
       МОД   D00036
       СЧ    (М16)
       НТЖ   LОС40
       ПО    А00470
       МОДА  СМD17
       ЦИКЛ  (М16)
А00500 УИА   11(М16) сист. ошибка
       ПБ    ЕRR
А00501 СЧ    ВDВUF
       ПБ    А00505
* процедура возвращается по М7
РR502  ЗП    WНIСН
       ИЛИ   RООТFL
       ЗП    D00015
       И     Е10П1
       ПЕ    А00501
       СЧ    ВDТАВ
А00505 ЗП    LОС241
       УИ    М16
       СЧ    (М16)
       НТЖ   D00015
       ПО    (М7)
       СЧ    WНIСН
       ПО    А00520
       СЧ    DIRТУ
       И     Е2
       ПО    А00520
       НТЖ   DIRТУ
       ЗП    DIRТУ
       СЧ    ВDВUF
       СДА   64-20
       ИЛИ   Е70МSК
       ЗП    ИСЭ70
       СЧ    (М16)
       И     Е10П1
       СЛЦ   ИСЭ70
       ЗП    ИСЭ70
       Э70   ИСЭ70
А00520 СЧ    LОС241
       СДА   64-20
       ИЛИ   WНIСН
       ИЛИ   Е40
       СЛЦ   Е70МSК
       ЗП    ИСЭ70
       Э70   ИСЭ70
       МОД   LОС241-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧ    (М16)
       НТЖ   D00015
       ПО    (М7)
       МОДА
       УИА   2(М16)
       ПБ    ЕRR
А00530 МОДА  А01423
       УИА   0(М5)
* процедура возвращается по М5       
РR531  ЗП    D00040
       И     Е10П1
       МОДА  РR502
       ПВ    (М7)       
А00533 СЧ    D00040
       И     Е20П11
       ПО    ZЕRКЕУ
       ЗП    WОRК
       СДА   64-29
       ЗП    D00036
       СЧ    1(М16)
       И     Е20П11
       ПО    DЕLRЕС
       ВЧ    WОRК
       ПО    А00555
       СЛ    WОRК
А00541 СДА   64+10
       ЗП    LОС116
А00542 МОД   LОС116-ВDVЕСТ(М13)
       СЧ    1(М16)
       ЗП    LОС220
       НТЖ   D00036
       И     Е48П40
       ПО    А00550
       СЧ    LОС116
       ВЧ    Е1
       ЗП    LОС116
       ИЛИ
       ПЕ    А00542
       ПБ    DЕLRЕС
А00550 СЧ    LОС220
       И     Е10П1
       СЛЦ   Е1
       СЛЦ   LОС241
       ЗП    АIТЕМ
       СЧ    LОС220
       И     Е20П11
       СДА   64+10
       ЗП    СURРОS
       ПБ    (М5)
А00555 СЧ    WОRК
       ПБ    А00541
Е20П11 КОНД  В’0000000003776000’
SКIР   СЧ    СURСМD
       СДА   64+6
       ПО    ЕRR
       И     Е6П1
       ПЕ    ЕRR
А00562 СЧ    СURСМD
       СДА   64+30
       ПБ    NЕХТ
ZЕRКЕУ УИА   1(М16)
       ПБ    ЕRR
DЕLRЕС УИА   3(М16)
       ПБ    ЕRR
ВАDNАМ УИА   4(М16)
       ПБ    ЕRR
СОRR1Р УИА   5(М16)
       ПБ    ЕRR
ОVЕRFL УИА   6(М16)
       ПБ    ЕRR
СLАSН  УИА   13(М16)
       ПБ    ЕRR
ЕМРТУ  УИА   14(М16)
       ПБ    ЕRR
NОРRЕD УИА   15(М16)
       ПБ    SКIР
NОNЕХТ УИА   16(М16)
       ПБ    SКIР
* команда 31: переключение на корневой каталог       
RООТ   ЗП    RООТFL
       СЧ    АRСН
       ЗП    DВDЕSС
       ПБ    SЕТСТL
* команда 12: копирование текущего элемента в дескриптор массива       
СМD12  СЛЦ   В30
       ЗП    МУLОС
       СЧ    В3
       ЗП    МУLЕN
       СЧ    АDЕSСR
       ПБ    СРУОUТ
* команда 25: переключение на массив, указанный в DBDESC       
SЕТСТL И     Е18П1
       ЗП    Е70МSК
       СЧ    DВDЕSС
       СДА   64+18
       ЗП    DВLЕN
       СЧ    ВDТАВ
       СДА   64-20
       СЛЦ   Е70МSК
       ИЛИ   Е40
       ЗП    ИСЭ70
       Э70   ИСЭ70
       СЧ    ВDТАВ
       ЗП    LОС241
       УИ    М16
       СЧ    (М16)
       НТЖ   RООТFL
       ПЕ    СОRR1Р
       ЗП    IDХ
       ЗП    LОС246
       ЗП    WНIСН
       СЧ    3(М16)
       И     Е10П1
       СЛЦ   ВDТАВ
       СЛЦ   Е2
       ЗП    LОС34
       ПБ    А00213
ЕRR    СЧ    ЕRНNDL
       ПО    А00622 если установлен обработчик ошибок
       ЗП    SАVМ16 потом вернемся на него
А00622 УИИ   М7(М16)
       СЛИ   М16(М16)
       МОДА  (М16)
       СЧ    МSG-2
       ЗП    D00010  первое слово текста ошибки
       МОДА  1(М16)
       СЧ    МSG-2
* сюда приходим с СМ=0, когда кончились команды
А00626 ЗП    D00011 второе слово текста ошибки
       СЧ    LОС6
       ПО    SАVЕ
       НТЖ   Е1
       ПЕ    ЕХIТ1
       МОД   ВDТАВ-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧ    1(М16)
       И     Е32
       ПО    SАVЕ не было признака занятости
       НТЖ   1(М16)
       ЗП    1(М16) сбрасываем его
       ПБ    WRТАВ нужно записать таблицу
SАVЕ   СЧ    DIRТУ
       И     Е1
       ПО    WRВUF 
WRТАВ  СЧ    ВDТАВ
       СДА   64-20
       ИЛИ   Е70МSК
       ЗП    ИСЭ70
       Э70   ИСЭ70
WRВUF  СЧ    DIRТУ
       И     Е2
       ПО    ЕХIТ
       СЧ    ВDВUF
       СДА   64-20
       ИЛИ   Е70МSК
       ЗП    ИСЭ70
       МОД   ВDВUF-ВDVЕСТ(М13)
       СЧ
       И     Е10П1
       СЛЦ   ИСЭ70
       ЗП    ИСЭ70
       Э70   ИСЭ70
ЕХIТ   СЧ , выход с очисткой признака модификации
       ЗП    DIRТУ
ЕХIТ1  РЖ    SАVRК
       СЧИ   М7
       МОДА  D00010
       УИА   0(М16)
       МОД   SАVМ6
       УИА   0(М6)
       МОД   SАVМ7
       УИА   0(М7)
       МОД   SАVМ5
       УИА   0(М5)
       МОД   LОС33-ВDVЕСТ(М13)
       УИА   (М4)
       МОД   3(М16)
       УИА   (М13)
       МОД   -1(М16)
       ПБ , возврат в вызвавшую систему
* процедура возвращается по М6       
РR662  МОД   АIТЕМ-ВDVЕСТ(М13)
       ЗП
       СЧ    WНIСН
       ПО    А00665
       СЧ    Е1
А00665 СЛЦ   Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       ПБ    (М6)
***************************       
А00667 СЧ    IDХ
       ПО    А01160
       СЧ    LОС246
       МОДА  FRЕЕ
       ПВ    (М6)
       СЧ    Е1
       ЗП    LОС42
       СЧ    LОС117
       ЗП    D00025
       И     Е48П30
       ЗП    D00032
       СДА   64+29
       ПО    А00703
       МОДА  А00340
       ПВ    (М6)
       ИЛИ   Е29П11
       НТЖ   Е29П11
       ЗП    LОС117
       СЧ    D00025
       И     Е29П11
       ИЛИ   LОС117
       МОДА  РR662
       ПВ    (М6)
А00703 МОДА  РR1232
       ПВ    (М5)
СМD27  СЧ    LОС50
       УИ    М16
       МОД   IDХ-ВDVЕСТ(М13)
       СЛЦ   АRRАУ
       УИ    М5
       НТЖ   LОС50
       ЗП    LОС116
       СЧ    -1(М16)
       И     Е10П1
       ЗП    D00036
       СЛЦ   LОС50
       ЗП    WОRК
А00712 СЧ    2(М5)
       ЗП    (М5)
       СЛИА  1(М5)
       СЧИ   М5
       НТЖ   WОRК
       ПЕ    А00712
       СЧ    D00036
       ВЧ    Е2
       НТЖ   D00036
       НТЖ   -1(М16)
       ЗП    -1(М16)
       И     Е10П1
       ПО    А00667
       СЧ    LОС116
А00721 И     Е15П1
       ПЕ    А01160
       СЧ    IDХ
       ПО    А01160
       СЧ    (М16)
       ЗП    D00011
       МОДА  А00730
       УИА   0(М5)
       СЧИ   М5
       ЗП    GОТО
       СЛЦ   Е1
       ЗП    SАVМ4
       ПБ    А01160
А00730 ПБ    А01242
А00731 СЧ    D00011
       МОД   LОС50-ВDVЕСТ(М13)
       УИА   0(М16)
       МОД   IDХ-ВDVЕСТ(М13)
       МОД   АRRАУ-ВDVЕСТ(М13)
       ЗП    (М16)
       МОД   IDХ-ВDVЕСТ(М13)
       СЧ    АRRАУ
       ПБ    А00721
FRЕЕ   МОДА  РR531
       ПВ    (М5)
А00737 СЧ    1(М16)
       СДА   64+10
       И     Е15П1
       ЗП    D00036
       СЧ    LОС116
       УИ    М5
А00742 НТЖ   D00036
       ПО    А00747
       МОДА  (М5)
       СЧ    2(М16)
       МОДА  (М5)
       ЗП    1(М16)
       СЛИА  1(М5)
       СЧИ   М5
       ПБ    А00742
А00747 СЧ    LОС220
       И     Е10П1
       ЗП    D00031
А00751 СЛИА  -1(М5)
       МОДА  А00760
       ПИО   (М5)
       МОДА  (М5)
       СЧ    1(М16)
       И     Е10П1
       ВЧ    D00031
       ПО    А00751
       МОДА  (М5)
       СЧ    1(М16)
       СЛЦ   СURРОS
       МОДА  (М5)
       ЗП    1(М16)
       ПБ    А00751
А00760 СЧ    1(М16)
       И     Е10П1
       ЗП    WОRК
       НТЖ   D00031
       ПО    А00773
       СЧ    D00031
       ВЧ    WОRК
       ПЕ    А00500
       УИ    М5
       СЧ    WОRК
       СЛЦ   LОС241
       ЗП    WОRК
       СЛЦ   СURРОS
       ЗП    D00031
А00767 МОД   WОRК
       СЧ    (М5)
       МОД   D00031
       ЗП    (М5)
       СЛИА  -1(М5)
       МОДА  А00767
       ПИНО  (М5)
А00773 СЧ    1(М16)
       ВЧ    Е11
       СЛЦ   СURРОS
       ЗП    1(М16)
       СЧ    LОС34
       УИ    М16
       МОД   WНIСН-ВDVЕСТ(М13)
       СЧ    (М16)
       СЛЦ   СURРОS
       СЛЦ   Е1
       МОД   WНIСН-ВDVЕСТ(М13)
       ЗП    (М16)
       СЧ    WНIСН
       ПО    А01003
       СЧ    Е1
А01003 СЛЦ   Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       СЧ    LОС220
А01005 СДА   64+20
       И     Е19П1
       ПЕ    FRЕЕ
       СЧ    Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       ПБ    (М6)
DАТЕ   СЧ    LОС14
       И     Е33П16
       ЗП    WОRК
       Э50   ’114’
       СБР   D01566
       ИЛИ   WОRК
       ИЛИ   МУLЕN
       ЗП    D00023
       ПБ    (М7)
FLUSН  ЗП    USRLОС
       МОДА  РR1022
       ПВ    (М6)
       СЧ    D00024
       ЗП    LОС12
       ПБ    СМD0
РR1022 МОДА  DАТЕ
       ПВ    (М7)
А01023 СЧ
       УИА   0(М5)
       ЗП    D00030
       СЧ    LОС34
       УИ    М16
       МОД   WНIСН-ВDVЕСТ(М13)
       СЧ    (М16)
       ЗП    WОRК
       СЧ    МУLЕN
       СЛЦ   Е1
       ЗП    МУLЕN
       ВЧ    WОRК
       ПО    А01301
       СЧ    WНIСН
А01032 МОДА  РR502
       ПВ    (М7)
       УИИ   М7(М16)
       СЧ    1(М7)
       СДА   64+10
       УИ    М16
А01035 СДА   64-39
       МОД   LОС241-ВDVЕСТ(М13)
       НТЖ   1(М16)
       И     Е48П40
       ПО    А01044
       МОД   LОС241-ВDVЕСТ(М13)
       СЧ    1(М16)
       МОД   LОС241-ВDVЕСТ(М13)
       ЗП    2(М16)
       СЛИА  -1(М16)
       СЧИ   М16
       МОДА  А01035
       ПИНО  (М16)
А01044 СЛИА  1(М16)
       СЧИ   М16
       ЗП    LОС116
       СДА   64-39
       ИЛИ   D00030
РR1047 ЗП    D00030
       СДА   64+39
       СДА   64-10
       ИЛИ   WНIСН
       ЗП    D00024
       СЧ    МУLЕN
       УИ    М16
       ВЧОБ  1(М7)
       СЛЦ   Е11
       ЗП    1(М7)
       И     Е10П1
       ЗП    WОRК
       СЛЦ   LОС241
       СЛЦ   Е1
       ЗП    D00036
       МОДА  А01062
       ПИНО  (М5)
       СЛИА  -1(М16)
       СЧ    D00036
       СЛЦ   Е1
       ЗП    D00036
А01062 СЧИ   М16
       ПО    А01067
А01063 МОД   USRLОС
       СЧ    -1(М16)
       МОД   D00036
       ЗП    -1(М16)
       СЛИА  -1(М16)
       МОДА  А01063
       ПИНО  (М16)
А01067 СЧ    МУLЕN
       СДА   64-10
       ИЛИ   WОRК
       ИЛИ   D00030
       МОД   LОС116-ВDVЕСТ(М13)
       ЗП    1(М7)
       МОД   LОС34-ВDVЕСТ(М13)
       УИА   0(М16)
       МОД   WНIСН-ВDVЕСТ(М13)
       СЧ    (М16)
       ВЧ    МУLЕN
       ВЧ    Е1
       МОД   WНIСН-ВDVЕСТ(М13)
       ЗП    (М16)
       МОДА  А01111
       ПИО   (М5)
       СЧ    WНIСН
       ПО    А01101
       СЧ    Е1
А01101 СЛЦ   Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       СЧ    D00024
       СДА   64-20
       ЗП    D00030
       СЧ    D00034
       ЗП    МУLЕN
А01105 СЛИА  -1(М5)
       МОДА  А01264
       ПИНО  (М5)
       МОДА  ОVЕRFL
       УИА   0(М6)
       СЧ    D00030
       ПБ    А01005
А01111 СЧ    D00023
       МОД   D00036
       ЗП    -1
       СЧ    WНIСН
       ПО    А01114
       СЧ    Е2
А01114 СЛЦ   Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       ПБ    (М6)
А01116 СЧ
       ЗП    LОС20
       СЧ    LОС12
       МОДА  ОVЕRFL
       УИА   0(М6)
       ПБ    FRЕЕ
СМD26  ЗП    D00011
       СЧ    LОС12
       ЗП    АDЕSСR
       ПБ    А01140
А01123 МОД   IDХ-ВDVЕСТ(М13)
       СЧ    АRRАУ
       СДА   64+15
А01125 ЗП    D00012
       СДА   64+15
       УИ    М16
       СЧМР
       МОД   SАVМ4
       ПО
       СЧ    D00012
       СЛИА  -1(М16)
       МОДА  А01133
       ПИО   (М16)
       СЛЦ   Е2
А01133 ВЧ    Е1
       ЗП    D00012
       МОДА  STEP
       ПВ    (М6)
       СЧ    D00012
       ПБ    А01125
А01136 СЧ    D00032
       СДА   64+29
       ИЛИ   Е48
А01140 ЗП    D00024
       СЧ    LОС50
       УИ    М16
       МОД   IDХ-ВDVЕСТ(М13)
       СЛЦ   АRRАУ
       СЛЦ   Е2
       УИ    М5
       СЧИ   М5
       ЗП    LОС36
       СЧ    -1(М16)
       И     Е10П1
       УИ    М6
       СЛИ   М6(М16)
А01147 СЧИ   М6
       НТЖ   LОС36
       ПО    А01154
       СЧ    -2(М6)
       ЗП    (М6)
       СЧ    -1(М6)
       ЗП    1(М6)
       СЛИА  -2(М6)
       ПБ    А01147
А01154 СЧ    D00011
       ЗП    (М5)
       СЧ    D00024
       ЗП    1(М5)
       СЧ    -1(М16)
       СЛЦ   Е2
       ЗП    -1(М16)
А01160 СЧИ   М16
       ВЧ    Е1
       ЗП    USRLОС
       СЧ    IDХ
       ПЕ    А01167
А01163 СЧ    В41
       ЗП    МУLЕN
       СЧ    -1(М16)
       НТЖ   Е6
       ПО    А01252
       СЧ    LОС20
       ПБ    А01311
А01167 СЧ    -1(М16)
       И     Е10П1
       НТЖ   Е7
       ПО    А01174
А01171 СЧ    -1(М16)
       И     Е10П1
       СЛЦ   Е1
       ЗП    МУLЕN
       СЧ    LОС246
       ПБ    А01311
А01174 СЧ    IDХ
       СДА   64-1
       СЛЦ   В41
       ЗП    WОRК
       СЧ    LОС55
       НТЖ   В36
       ПЕ    А01201
       СЧ    WОRК
       СЛЦ   В44
       ЗП    WОRК
А01201 МОДА  РR425
       ПВ    (М6)
       ВЧ    WОRК
       ПЕ    А01116
       СЧ    LОС157
       ЗП    D00025
       СЧ    LОС246
       СДА   64-29
       ЗП    LОС157
       СЧ    LОС117
       И     Е29П11
       ИЛИ   LОС157
       ИЛИ   Е6
       ЗП    LОС157
       СЧ    USRLОС
       СЛЦ   Е6
       ЗП    USRLОС
       СЧ    В41
       ЗП    МУLЕN
       МОДА  РR1022
       ПВ    (М6)
       СЧ    D00025
       ЗП    LОС157
       СЧ    LОС160
       ЗП    D00011
       СЧ    LОС117
       ЗП    D00025
       СДА   64+29
       СДА   64-19
       ИЛИ   D00024
       СДА   64-10
       ИЛИ   Е6
       ЗП    LОС117
       И     Е29П11
       СДА   64-19
       ЗП    D00032
       МОДА  LОС120-ВDVЕСТ(М13)
       УИА   0(М16)
       МОДА  А01231
       УИА   0(М5)
       СЧИ   М5
       ЗП    GОТО
       СЧИ   М16
       ВЧ    Е1
       ЗП    USRLОС
       ПБ    А01171
А01231 МОДА  А01136
       УИА   0(М5)
РR1232 СЧИ   М5
       ЗП    SАVМ4
       СЧ    Е1
       ЗП    LОС42
       СЧ    D00025
       СДА   64+10
       И     Е19П1
       ПО    А01242
       МОДА  А00340
       ПВ    (М6)
       СДА   64-19
       СДА   64+19
       ИЛИ   D00032
       МОДА  РR662
       ПВ    (М6)
А01242 МОДА  LОС56-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧИ   М16
       ЗП    LОС50
       СЧ    IDХ
       ПО    А00143
       ВЧ    Е2
       ЗП    IDХ
       НТЖ
       ПО    А01123
       МОДА  А01123
       УИА   0(М6)
       МОД   IDХ-ВDVЕСТ(М13)
       СЧ    LОС20
       ПБ    РR202
А01252 МОДА  РR425
       ПВ    (М6)
       ВЧ    В101
       ПЕ    А01116
       МОДА  РR1022
       ПВ    (М6)
       МОДА  LОС56-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧ    D00024
       ИЛИ   Е48
       ЗП    1(М16)
       СЧ    Е2
       ЗП    -1(М16)
       ПБ    А01163
А01261 СЧ    USRLОС
       СЛЦ   МУLЕN
       ВЧ    Е1
       ЗП    USRLОС
       МОД   DВLЕN-ВDVЕСТ(М13)
       УИА   0(М5)
А01264 МОД   LОС34-ВDVЕСТ(М13)
       СЧ    -1(М5)
       ВЧ    Е2
       ПЕ    А01105
       СЛЦ   Е1
       ЗП    WОRК
       СЛИА  -1(М5)
       ВЧ    МУLЕN
       ПЕ    А01274
       СЧ    USRLОС
       ВЧ    МУLЕN
       СЛЦ   Е1
       ЗП    USRLОС
       СЧИ   М5
       УИА   0(М5)
       ПБ    А01032
А01274 СЧ    МУLЕN
       ВЧ    WОRК
       ЗП    D00034
       СЧ    WОRК
       ЗП    МУLЕN
       ВЧОБ  USRLОС
       ЗП    USRLОС
       СЧИ   М5
       СЛИА  1(М5)
       ПБ    А01032
А01301 СЧ    МУLЕN
       ВЧ    D01574
       ПО    А01261
       УИА   -1(М7)
А01303 СЛИА  1(М7)
       СЧИ   М7
       НТЖ   DВLЕN
       ПО    А01261
       СЧ    МУLЕN
       МОД   LОС34-ВDVЕСТ(М13)
       ВЧ    (М7)
       ПО    А01303
       СЧИ   М7
       ПБ    А01032
СМD20  ЗП    USRLОС
       СЧ    АDЕSСR
А01311 ЗП    D00012
       МОДА  А00143
       УИА   0(М6)
       МОДА  РR531
       ПВ    (М5)
       ВЧ    Е1
       УИ    М5
       НТЖ   МУLЕN
       ПЕ    А01336
       МОДА  А01323
       ПИО   (М5)
А01317 МОД   USRLОС
       СЧ    -1(М5)
       МОД   АIТЕМ-ВDVЕСТ(М13)
       ЗП    (М5)
       СЛИА  -1(М5)
       МОДА  А01317
       ПИНО  (М5)
А01323 УИИ   М5(М16)
       МОДА  DАТЕ
       ПВ    (М7)
       МОД   АIТЕМ-ВDVЕСТ(М13)
       ЗП
       СЧ    WНIСН
       ПО    А01330
       СЧ    Е1
А01330 СЛЦ   Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       СЧ    LОС220
       И     Е39П21
       ПО    RTNEXT
       НТЖ   LОС220
       МОД   LОС116-ВDVЕСТ(М13)
       ЗП    1(М5)
       СЧ    LОС220
       ПБ    А01005
А01336 МОДА  DАТЕ
       ПВ    (М7)
       МОД   LОС241-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧ    1(М16)
       СДА   64+10
       УИ    М5
       СЛИА  1(М5)
       ВЧОБ  1(М16)
       И     Е10П1
       СЛЦ   СURРОS
       ВЧ    Е2
       ЗП    WОRК
       ВЧ    МУLЕN
       ПЕ    А01361
А01346 СЧИ   М6
       ЗП    D00010
       СЧ    LОС220
       ЗП    D00026
       И     Е10П1
       ЗП    LОС220
       МОДА  А00747
       ПВ    (М6)
       СЧ    МУLЕN
       СЛЦ   Е1
       ЗП    МУLЕN
       УИА   0(М5)
       МОД   LОС241-ВDVЕСТ(М13)
       УИА   0(М7)
       СЧ    D00026
       И     Е48П40
       МОДА  РR1047
       ПВ    (М6)
       СЧ    D00026
       МОД   D00010
       УИА   0(М6)
       ПБ    А01005
А01361 МОДА  РR425
       ПВ    (М6)
А01362 МОД   АIТЕМ-ВDVЕСТ(М13)
       СЧ
       И     Е15П1
       СЛЦ   LОС47
       ВЧ    МУLЕN
       ПЕ    ОVЕRFL
       МОД   LОС241-ВDVЕСТ(М13)
       УИА   0(М16)
       СЧ    WОRК
       ЗП    МУLЕN
       МОДА  А01346
       ПВ    (М6)
       СЧ    USRLОС
       СЛЦ   МУLЕN
       ЗП    USRLОС
       СЧ    D00023
       И     Е15П1
       ВЧ    МУLЕN
       ЗП    МУLЕN
       МОД   USRLОС
       СЧ    -1
       ЗП    D00023
       МОДА  А01023
       ПВ    (М6)
       СЧ    D00012
       МОДА  РR531
       ПВ    (М5)
       СЧ    D00024
       СДА   64-20
       ИЛИ   LОС220
       МОД   LОС116-ВDVЕСТ(М13)
       ЗП    1(М16)
       СЧ    WНIСН
       ПО    А01404
       СЧ    Е2
А01404 СЛЦ   Е1
       ИЛИ   DIRТУ
       ЗП    DIRТУ
       ПБ    RTNEXT
* команда 34: преобразование дескриптора массива в текстовый формат
СМD34  СДА   64-33
       РЗБ   П77777
       ИЛИ   SРАСЕ
       ЗП    LОС40
       СЧ    LОС41
       РЗБ   DАТМSК
       ИЛИ   SРАСЕ
       ЗП    LОС41
       СЧ    ЕОТ
       ЗП    LОС42
       ПБ    СМD0
***************************
СРУОUТ МОДА  РR342
       ПВ    (М6)
А01415 МОДА  СМD0
       УИА   0(М6)
       СЧ    МУLОС
       ЗП    USRLОС
       СЧ    МУLЕN если макс. длина указана
       ПЕ    СНКLЕN ее нужно проверить
А01420 СЧ    АIТЕМ
       СЛЦ   Е1
       ЗП    АIТЕМ
       СЧ    СURРОS
       ВЧ    Е1
       ЗП    СURРОS
А01423 УИ    М16
       СЧИ   М16
       ПО    А01431
СОLООР МОД   АIТЕМ-ВDVЕСТ(М13)
       СЧ    -1(М16)
       МОД   USRLОС
       ЗП    -1(М16)
       СЛИА  -1(М16)
       МОДА  СОLООР
       ПИНО  (М16)
А01431 СЧ    USRLОС
       СЛЦ   СURРОS
       ЗП    USRLОС
       СЧ    LОС220
       И     Е39П21
       ПО    (М6)
       СДА   64+20
       ПБ    А00530
СНКLЕN ВЧ    LОС47
       ПО    А01420
       УИА   12(М16) длина записи больше длины в памяти
       ПБ    ЕRR
* команда 10: создание массива
МКСТL  СЧ    DВDЕSС
       СДА   64+18
       ЗП    DВLЕN
       УИ    М5
       СЧ    DВDЕSС
       И     Е18П1
       ЗП    Е70МSК
       СЧ    ВDТАВ
       УИ    М6
       ЗП    LОС241
       СДА   64-20
       ИЛИ   Е70МSК
       ЗП    D00036
       СЧ    Е10П1
       ЗП    1(М6)
А01447 СЛИА  -1(М5)
       СЧ    D01602
       МОД   ВDВUF-ВDVЕСТ(М13)
       ЗП    (М5)
       СЧИ   М5
       ИЛИ   RООТFL
       ЗП    (М6)
       СЧИ   М5
       СЛЦ   D00036
       ЗП    ИСЭ70
       Э70   ИСЭ70
       МОДА  А01447
       ПИНО  (М5)
       СЧ    ВDВUF
       ЗП    LОС34
       ЗП    МУLОС
       СЧ    Е11
       ЗП    LОС20
       СЧ
       ЗП    D00011
       МОДА  РR376
       ПВ    (М6)
А01463 МОДА  РR1022
       ПВ    (М6)
А01464 СЧ    DВLЕN
       ЗП    МУLЕN
       ВЧОБ  D01603
       МОД   ВDВUF-ВDVЕСТ(М13)
       ЗП
       УИА   17(М5)
       ПБ    А00153
МSG    КОНД  П’НУЛ.УК’
       КОНД  П’ЛЮЧ  0’В’172’
* 2
       КОНД  П’ЗАТЕРТ’
       КОНД  П’ ЛИСТ0’В’172’
* 3
       КОНД  П’НЕТ ЗА’
       КОНД  П’ПИСИ 0’В’172’
* 4
       КОНД  П’НЕДОП.’
       КОНД  П’ ИМЯ.0’В’172’
* 5
       КОНД  П’ЗАТЕРТ’
       КОНД  П’ 1 Л.0’В’172’
* 6
       КОНД  П’ПЕРЕПО’
       КОНД  П’ЛНЕНА0’В’172’
* 7
       КОНД  П’ШАГЗ. ’
       КОНД  П’ВЕЛИК0’В’172’
* 8
       КОНД  П’НЕТ ИМ’
       КОНД  П’ЕНИ  0’В’172’
* 9
       КОНД  П’ИМ.УЖЕ’
       КОНД  П’ ЕСТЬ0’В’172’
* 10
       КОНД  П’НЕТ С.’
       КОНД  П’КОНЦА0’В’172’
* 11
       КОНД  П’СИСТ.О’
       КОНД  П’ШИБКА0’В’172’
* 12
       КОНД  П’ДЛ.ЗАП’
       КОНД  П’>ДЛИН0’В’172’
* 13
       КОНД  П’ОДНОВР’
       КОНД  П’.РАБ.0’В’172’
* 14
       КОНД  П’НЕТ ТЕ’
       КОНД  П’КУЩЕЙ0’В’172’
* 15
       КОНД  П’НЕТ ПР’
       КОНД  П’ЕД.З.0’В’172’
* 16
       КОНД  П’НЕТ СЛ’
       КОНД  П’ЕД.З.0’В’172’
* 17
       КОНД  П’НЕПР.П’
       КОНД  П’АРОЛЬ0’В’172’
VSЕЕD  КОНД  В’3777777777777777’
Е1     КОНД  П’000001’
В22    КОНД  В’0000000000000022’
Е12    КОНД  П’000080’
СМРОFF КОНД  П’00000/’
В4     КОНД  П’000004’
В3     КОНД  П’000003’
AMYLOC КОНД  B'13'
Е2     КОНД  П’000002’
Е40    КОНД  В’0010000000000000’
Е6П1   КОНД  П’00000D’
Е48    КОНД  В’4000000000000000’
Е10П1  КОНД  В’0000000000001777’
Е31    КОНД  П’00F000’
Е19П1  КОНД  В’0000000001777777’
Е11    КОНД  П’000040’
Е15П1  КОНД  В’0000000000077777’
В17777 КОНД  В’0000000000017777’
Е32    КОНД  В’0000020000000000’
Е5     КОНД  В’0000000000000020’
Е29П11 КОНД  В’0000003777776000’
Е16    КОНД  В’0000000000100000’
В41    КОНД  П’00000Б’
Е48П40 КОНД  В’7770000000000000’
В30    КОНД  В’0000000000000030’
Е18П1  КОНД  В’0000000000777777’
Е48П30 КОНД  В’7777774000000000’
Е33П16 КОНД  В’0000077777700000’
D01566 КОНД  В’0000377774000000’
Е6     КОНД  П’00000А’
Е7     КОНД  П’00000F’
В36    КОНД  В’0000000000000036’
В44    КОНД  П’00000Д’
В101   КОНД  П’00000G’
D01574 КОНД  В’0000000000001775’
Е39П21 КОНД  В’0007777774000000’
П77777 КОНД  П’077777’
SРАСЕ  КОНД  П’ 00000’
DАТМSК КОНД  П’03 1  ’
ЕОТ    КОНД  В’3641540000000000’
D01602 КОНД  В’0000000000001776’
D01603 КОНД  В’0000000000001731’
       ПАМ   124
       ПАМ   ’32000’
ВDVЕСТ ПАМ   1
ОUТАDR ПАМ   2
LОС3   ПАМ   2
СURСМD ПАМ   1
LОС6   ПАМ   1
GIVЕNР ПАМ   1
КЕУ    ПАМ   1
ЕRНNDL ПАМ   1
LОС12  ПАМ   1
МУLОС  ПАМ   1
LОС14  ПАМ   1
МУLЕN  ПАМ   1
ВDВUF  ПАМ   1
ВDТАВ  ПАМ   1
LОС20  ПАМ   1
АRRАУ  ПАМ   7
DВDЕSС ПАМ   1
RООТFL ПАМ   1
SАVЕDР ПАМ   1
LОС33  ПАМ   1
LОС34  ПАМ   1
АDЕSСR ПАМ   1
LОС36  ПАМ   1
СURКЕУ ПАМ   1
LОС40  ПАМ   1
LОС41  ПАМ   1
LОС42  ПАМ   2
Е70МSК ПАМ   1
СURРОS ПАМ   1
АIТЕМ  ПАМ   1
LОС47  ПАМ   1
LОС50  ПАМ   1
DВLЕN  ПАМ   2
LОС53  ПАМ   1
LОС54  ПАМ   1
LОС55  ПАМ   1
LОС56  ПАМ   1
       ПАМ   31
LОС116 ПАМ   1
LОС117 ПАМ   1
LОС120 ПАМ   1
       ПАМ   30
LОС157 ПАМ   1
LОС160 ПАМ   32
LОС220 ПАМ   17
LОС241 ПАМ   1
IDХ    ПАМ   2
WНIСН  ПАМ   2
LОС246 ПАМ   1
DIRТУ  ПАМ   345
       ФИНИШ
