*
*
*
*
*         Д И А Л О Г О В А Я   С Л У Ж Е Б Н А Я
*         ---------------------------------------
*
*             П Р О Г Р А М М А   " С Е Р П "
*             -------------------------------
*
*
*          О Б Щ И Е   С В Е Д Е Н И Я
*      СЛУЖЕБНАЯ СЕРВИСНАЯ ПРОГРАММА "СЕРП" РАЗРАБОТАНА КАК
* НЕПОСРЕДСТВЕННЫЙ ПРЕЕМНИК СИСТЕМЫ "ДИОП" [1]. РАЗМЕР ПРОГРАММ
* В НАСТОЯЩЕЕ ВРЕМЯ - 6 ЛИСТОВ; ОНА РАСПОЛАГАЕТСЯ В ЗОНАХ
* МД ЗАГРУЗКИ (2053). ДЛЯ РАБОТЫ СИСТЕМЫ ДОЛЖЕН БЫТЬ ЗАВЕДЕН
* СТАНДАРТНЫЙ ПАСПОРТ СF:
*
*      ВЫЗОВ СИСТЕМЫ ОСУЩЕСТВЛЯЕТСЯ НАБОРОМ КЛЮЧА  "СП" НА ТЕРМ
* НАЛЕ; В ОТВЕТ СООБЩАЕТСЯ НОМЕР ВЕРСИИ СИСТЕМЫ И ПОЯВЛЯЕТСЯ ПР
* ГЛАШЕНИЕ "ЧТО- ":
*     СП 419900
*     СЕРП: ВЕРСИЯ  2  ОТ  22.12.80
*     ЧТО-
* ПОЛЬЗОВАТЕЛЬ ДОЛЖЕН ЗАДАТЬ РАЗДЕЛ, С КОТОРЫМ ОН БУДЕТ РАБОТАТ
*
*      ПРАВИЛА, ОБЩИЕ ДЛЯ ВСЕХ РАЗДЕЛОВ:
*      1. НА ЛЮБОЕ ПРИГЛАШЕНИЕ (ЗА ИСКЛЮЧЕНИЕМ "ПАРОЛЬ- " И
* "ИДТИ- ") ВОЗМОЖНЫ ОТВЕТЫ:
* - "НАЧ" - ВОЗВРАТ СИСТЕМЫ В ИСХОДНОЕ СОСТОЯНИЕ;
* - "КНЦ" - ОКОНЧАНИЕ РАБОТЫ;
* - "А."  - ВКЛЮЧЕНИЕ/ВЫКЛЮЧЕНИЕ ПАРАЛЛЕЛЬНОЙ ВЫДАЧИ НА АЦПУ;
* - "V."  - ВЫКЛЮЧЕНИЕ/ВКЛЮЧЕНИЕ ВЫДАЧИ ТЕКСТОВ НА ТЕРМИНАЛ;
*           В ОТВЕТ НА ДВА ПОСЛЕДНИХ СООБЩЕНИЯ ВЫДАЕТСЯ ПРИ-
*           ГЛАШЕНИЕ "УСТ: " ИЛИ "ОТМ: ", ПОСЛЕ КОТОРЫХ МОЖНО
*           ПРОДОЛЖИТЬ ВВОД ОСНОВНОЙ ДИРЕКТИВЫ;
* - "С."  - ВЫДАЧА СООБЩЕНИЯ НА ОПЕРАТОРСКИЙ ТЕРМИНАЛ; ПОСЛЕ
*           ЭТОЙ ДИРЕКТИВЫ ВЫДАЕТСЯ ПРИГЛАШЕНИЕ, В ОТВЕТ НА
*          КОТОРОЕ СЛЕДУЕТ НАБРАТЬ ТЕКСТ СООБЩЕНИЯ; СООБ-
*          ЩЕНИЯ МОЖНО ВЫДАВАТЬ НЕ ЧАЩЕ, ЧЕМ 1 РАЗ В 5
*          МИНУТ. ПОСЛЕ ПЕРЕДАЧИ СООБЩЕНИЯ ПОЯВЛЯЕТСЯ
*          ПРИГЛАШЕНИЕ "ЕСТЬ:", ПОСЛЕ КОТОРОГО МОЖНО
*          ПРОДОЛЖИТЬ ВВОД ОСНОВНОЙ ДИРЕКТИВЫ.
* - "Э."  - ВКЛЮЧЕНИЕ/ВЫКЛЮЧЕНИЕ ПОВТОРЕНИЯ ВВОДИМОГО ТЕКСТА
* (ЭХО).
*      2. ПРИ ВЫПОЛНЕНИИ ПОДЗАКАЗА БОБИНЫ НА ТЕРМИНАЛ МОГУТ
* ВЫДАВАТЬСЯ СООБЩЕНИЯ: "НБОБ-" И "ЗБОБ-" - ОЗНАЧАЮЩИЕ
* ОТСУТСТВИЕ ИЛИ ЗАНЯТОСТЬ БОБИНЫ СООТВЕТСТВЕННО. ПУСТАЯ
* ПОСЫЛКА В ОТВЕТ НА ЭТИ ПРИГЛАШЕНИЯ ВЫЗЫВАЕТ ПОВТОРНЫЙ ОПРОС
* БОБИНЫ, ЛЮБОЙ ДРУГОЙ ОТВЕТ ВЫЗОВЕТ ВОЗВРАТ СИСТЕМЫ В ИСХОДНОЕ
* СОСТОЯНИЕ. ПРИМЕР:
*          ЧТО- ПРОЗ≡
*          НОМЕР БОБ- 2265≡
*          НБОБ- С.=
*          - 5ПОСТАВЬТЕ, ПОЖАЛУЙСТА, ПАКЕТ 2265≡
*          ЕСТЬ:≡
*          НБОБ- =
*          НОМЕР ЗОНЫ- 55≡
*
*      3. ПУСТАЯ ПОСЫЛКА ВЫЗЫВАЕТ ЛИБО ВОЗВРАТ К ПРЕДЫДУЩЕМУ
* ВОПРОСУ, ЛИБО ВЫПОЛНЕНИЮ НАИБОЛЕЕ ВЕРОЯТНОГО ДЕЙСТВИЯ.
*
*      4. НА ВОПРОС "ИДТИ- " ВОЗМОЖНЫ ОТВЕТЫ: ПУСТАЯ ПОСЫЛКА -
* ПРОДОЛЖИТЬ ВЫДАЧУ; ДВУЗНАЧНОЕ ВОСЬМЕРИЧНОЕ ЧИСЛО - РАЗМЕР
* ПОСЛЕДУЮЩИХ ПОРЦИЙ; ПРОЧИЕ ОТВЕТЫ - ЗАКОНЧИТЬ ВЫДАЧУ
*
*      ПРИ ФОРМИРОВАНИИ ЗАДАЧИ НА ТЕРМИНАЛ ВЫДАЕТСЯ СООБ-
* ЩЕНИЕ ВИДА: "043:ПРОГР ПЕРЕ"(043 - НОМЕР ЗАДАЧИ ПО СКВ)
* ИЛИ "ОШФО" - ОШИБКА ФОРМИРОВАНИЯ.
*
*
* 1. Р А Б О Т А  С  М А Г Н И Т Н Ы М И  Н О С И Т Е Л Я М И
*
*      1.1  "ПЕРЕ"
*      ПО ДИРЕКТИВЕ "ПЕРЕ" ФОРМИРУЕТСЯ ЗАДАЧА ПЕРЕПИСИ С
* ОДНОЙ ЛЕНТЫ (ДИСКА) НА ДРУГУЮ. ПОЛЬЗОВАТЕЛЮ ЗАДАЮТСЯ ВОП-
* РОСЫ О НОМЕРАХ БОБИН, НАЧАЛЬНЫХ ЗОНАХ И КОЛИЧЕСТВЕ ПЕРЕ-
* ПИСЫВАЕМЫХ ЗОН. ВОЗМОЖНО ЗАДАНИЕ НЕСКОЛЬКИХ ДИАПАЗОНОВ.
*  НА КАЖДЫЙ ВОПРОС РАЗДЕЛА  "ПЕРЕ"
* МОЖНО ДАВАТЬ ОТВЕТ, СОСТОЯЩИЙ ИЗ НЕСКОЛЬКИХ ЧИСЕЛ -
* ОТВЕТОВ И НА ПОСЛЕДУЮЩИЕ ВОПРОСЫ. ПРИМЕРЫ:
*         ЧТО -ПЕРЕ ≡
*         СЧИТ:НОМЕР БОБ - 2051
*         ЗАП: НОМЕР БОБ- 2244≡
*         СЧИТ: НОМЕР ЗОНЫ(8)- 543≡
*         ЗАП: НОМЕР ЗОНЫ(8)- 543≡
*         КОЛ-ВО ЗОН(8)- 2≡
*         СЧИТ: НОМЕР ЗОНЫ(8)- ≡
*          043:ПРОГР ПЕРЕ
*         ЧТО- ПЕРЕ≡
*         СЧИТ: НОМЕР БОБ- 2048≡
*         ЗАП: НОМЕР БОБ- 769 5 20≡
*         КОЛ-ВО ЗОН(8)- 300≡
*         СЧИТ: НОМЕР ЗОНЫ(8)- ≡
*          045:ПРОГР ПЕРЕ
*         ЧТО-КНЦ≡
*          КОНЕЦ СЕАНСА
*
*            1.2. "РАМЛ" ( "РАМД", "РАМБ" )
*      ПО ЭТИМ ДИРЕКТИВАМ ФОРМИРУЕТСЯ ЗАДАЧА РАСПЕЧАТКИ ЗОН
* МЛ (МД) ИЛИ ТРАКТОВ МБ. ПРИ НЕОБХОДИМОСТИ РАСПЕЧАТАТЬ СОДЕР-
* ЖИМОЕ ДИСКА, СОВПАДАЮЩЕГО ПО НОМЕРУ С СИСТЕМНЫМ, СЛЕДУЕТ ИС-
* ПОЛЬЗОВАТЬ ДИРЕКТИВУ "РАМЛ". НА ВОПРОС "ПЕЧАТЬ- " МОЖНО УКА-
* ЗАТЬ: "Л" - ПЕЧАТЬ В ВИДЕ КОНСТАНТ, "К" - КОМАНД, "Ч" - ЧИСЕЛ
* "Б" - СИМВОЛЬНОЙ ИНФОРМАЦИИ. ПУСТАЯ ПОСЫЛКА В ОТВЕТ НА ВОПРОС
* "ДИАПАЗОНЫ- " ВЫЗОВЕТ РАСПЕЧАТКУ ВСЕЙ ЗОНЫ (ТРАКТА).
* ПРИМЕРЫ:
*      ЧТО- РАМЛ≡
*      НОМЕР БОБ- 219≡
*      НОМЕР ЗОНЫ(8)- 5≡
*      ПЕЧАТЬ- Л≡
*      ДИАПАЗОНЫ- 0-377,1000-1300 1700-1777≡
*       123:ПРОГР РАМЛ
*      НОМЕР ЗОНЫ(8)- ≡
*      ЧТО- РАМБ≡
*      НОМЕР МБ- 21≡
*      НОМЕР ТРАКТА- 37≡
*      ПЕЧАТЬ- К≡
*      ДИАПАЗОНЫ- ≡
*       037:ПРОГР РАМБ
*      НОМЕР ТРАКТА- ≡
*      ЧТО-
*
*      1.3. "ВЫСЛ"
* ДИРЕКТИВА "ВЫСЛ" ВЫДАЕТ СЛУЖЕБНЫЕ СЛОВА С МД(МЛ) НА
* ЭКРАН. СТРУКТУРА ДИАЛОГА:
*     ЧТО-         ВЫСЛ
*     БОБ-        N БОБИНЫ
*   ЗОНА(8)-     100-105   (НЕОБХОДИМО ЗАДАВАТЬ ДИАПАЗОН)
*   ВЫДАТЬ-    ВОЗМОЖНЫЕ ОТВЕТЫ:  ЕТХ - ПОЛНАЯ ВЫДАЧА
*                             СЛУЖЕБНЫХ СЛОВ НА ЭКРАН;
*                                 Д - ВЫДАЧА СЛ.СЛОВ С
*                        НЕСОВПАДАЮЩЕЙ ДАТОЙ ЗАПИСИ;
*                                 В - ТО ЖЕ СО ВРЕМЕНЕМ;
*                                 Ш - ТО ЖЕ С ШИФРОМ.
*
*      1.4. "ПРОЗ"
*      ДИРЕКТИВА "ПРОЗ" ПОЗВОЛЯЕТ ПРОСМАТРИВАТЬ И ИСПРАВЛЯТЬ
* ЗОНЫ МЛ(МД). НА ВОПРОС "ВЫДАТЬ-" ВОЗМОЖНЫ ОТВЕТЫ:
* - НОМЕР СЛОВА, НАЧИНАЯ С КОТОРОГО ПОЛЬЗОВАТЕЛЬ ЖЕЛАЕТ ПРО-
*   СМАТРИВАТЬ ЗОНУ;
* - ПЕРЕЧЕНЬ ФОРМАТОВ, В КОТОРЫХ НАДО ПРОИЗВОДИТЬ ВЫДАЧУ.
*   ИМЕЮТСЯ ФОРМАТЫ: "К" - КОМАНДЫ; "С"("Л") - ВОСЬМ.КОНСТАНТЫ;
* "Б"("УПП") - КОД УПП; "ДУБНА" - КОД ISО-ДУБНА; "БЕМШ" -
*   КОД БЕМШ; "БАЙТ" - ПОБАЙТНАЯ ВЫДАЧА; "И" - КОДИРОВКА АВТО-
*   КОДА ИТМ И ВТ; "Х" - ШЕСТН. КОНСТАНТЫ; "Ч" - ЧИСЛА.
*****  ФОРМАТ "Ч" НЕ РЕАЛИЗОВАН !
* - "ЗАМ [<НОМЕР СЛОВА> [:<ЗАМЕНА>]]" - ИСПРАВЛЕНИЕ ЗОНЫ;
*   ОПУЩЕННЫЕ ПАРАМЕТРЫ ДОЗАПРАШИВАЮТСЯ. ЗАМЕНА СЧИТАЕТСЯ
*   ЗАПИСАННОЙ В ФОРМАТЕ, УКАЗАННОМ В СПИСКЕ ПЕРВЫМ.
* - "СРЗ [<НОМЕР БОБИНЫ> [<ЗОНА>]]" (С ДОЗАПРОСОМ) ПРОИЗВОДИТ
*   СРАВНЕНИЕ ТЕКУЩЕЙ ЗОНЫ С УКАЗАННОЙ И ВЫВОДИТ НЕСОВПАДАЮЩИЕ
*   СЛОВА;
* - "ЗАП" - ЗАПИСЬ ИСПРАВЛЕННОЙ ЗОНЫ НА ЛЕНТУ (ДИСК). ДИРЕК-
*   ТИВА "ЗАМ" ИСПРАВЛЯЕТ ТОЛЬКО КОПИЮ ЗОНЫ В ОЗУ!
* - "ЧИТ" - ПОВТОРНОЕ ЧТЕНИЕ ЗОНЫ (НАПРИМЕР, ПОСЛЕ НЕВЕРНЫХ
*   ИСПРАВЛЕНИЙ;
* - "ТЕКСТ" - ВЫДАЧА ЗОНЫ В ВИДЕ НЕПРЕРЫВНОГО ТЕКСТА С АВТО-
*   МАТИЧЕСКИМ ПЕРЕХОДОМ ОТ ЗОНЫ К ЗОНЕ; ТЕКСТ СЧИТАЕТСЯ
*   ЗАПИСАННЫМ В КОДЕ, УКАЗАННЫМ ПЕРВЫМ В СПИСКЕ ФОРМАТОВ;
*   ЕСЛИ ПЕРВЫМ ЗАПИСАН НЕ ТЕКСТОВОЙ ФОРМАТ (НАПРИМЕР, "С"),
*   ТО ВЫДАЧА ПРОИЗВОДИТСЯ В КОДЕ УПП.
* - "ГДЕ" - ВЫДАЕТ НОМЕР БОБИНЫ И ТЕКУЩЕЙ ЗОНЫ;
* - "ЗОН <НОМЕР ЗОНЫ>" - ЗАДАНИЕ НОВОЙ ПРОСМАТРИВАЕМОЙ ЗОНЫ;
* - "БОБ <НОМЕР БОБИНЫ> [<НОМЕР ЗОНЫ>]" - СМЕНА БОБИНЫ.
* - "НАЙ <ФОРМАТ ОБРАЗ>" - КОНТЕКСТНЫЙ ПОИСК ОБРАЗА В ЗОНЕ.
*    РЕАЛИЗОВАНЫ ФОРМАТЫ: "К"- КОМАНДА, "С"("Л")-КОНСТАНТА,
*    "У" - ТЕКСТ В КОДЕ УПП.
*    НЕСУЩЕСТВЕННЫЕ ПРИ ПОИСКЕ ПОЗИЦИИ ОТМЕЧАЮТСЯ ТОЧКАМИ.
*    ПРИ ПОИСКЕ КОМАНДЫ ОБРАЗ НЕОБХОДИМО НАБИРАТЬ С ПРОБЕЛАМИ,
*    ПОИСК КОМАНДЫ ОСУЩЕСТВЛЯЕТСЯ В ЛЕВОЙ И ПРАВОЙ ПОЛОВИНАХ
*    СЛОВА.
*    КОНСТАНТЫ ЗАДАЮТСЯ В ВОСЬМЕРИЧНОМ ВИДЕ БЕЗ ПРОБЕЛОВ.
*    ПРИМЕР:  НАЙ К 00 010 ....
*    БУДУТ НАЙДЕНЫ КОМАНДЫ СЧИТЫВАНИЯ (010) С ЛЮБЫМ АДРЕСОМ.
*             НАЙ С ....777
*   БУДУТ НАЙДЕНЫ КОНСТАНТЫ, ИМЕЮЩИЕ В МЛАДШИХ 9 РАЗРЯДАХ
*   КОД "777".
*             НАЙ У А....Б
*   ОТЫЩУТСЯ СЛОВА В КОДЕ УПП С ПЕРВОЙ БУКВОЙ А И ПОСЛЕДНЕЙ Б.
*
*      ПО УМОЛЧАНИЮ В СИСТЕМЕ УСТАНОВЛЕН ФОРМАТ "С К УПП".
*      П Р И М Е Р Ы:
* ЧТО- ПРОЗ≡
* НОМЕР БОБ- 2048≡
* НОМЕР ЗОНЫ- 0≡
* ВЫДАТЬ- 20≡
* 0020) 00000000 00000000   00 000 0000 00 000 0000   000000
* 0021) 03000737 002200000   00 30 00737 00 22 00000   Р1!Б00
* ИДТИ- Н≡
* ВЫДАТЬ- БАЙТ Б≡
* ВЫДАТЬ- 20≡
* 0020) 000 000 000 000 000 000   000000
* 0021) 060 001 337 041 000 000   Р≡      А ПРЕРВАНА
* ВЫДАТЬ- СРЗ 2056 0≡
*   ЭТО ВСЕ.                        -РАЗЛИЧИЙ НЕТ
* ВЫДАТЬ- С≡
* ВЫДАТЬ- ЗАМ 20≡
* ЗАМЕНА- 123432101≡
* 0020) 00000001 23432101
* СЛОВО- 21≡
* ЗАМЕНА- 0≡
* 0021) 00000000 00000000
* СЛОВО- ≡
* ВЫДАТЬ- ЗАП≡
* ПАРОЛЬ ЗП- 0763≡
*  ЕСТЬ
* ВЫДАТЬ- БОБ 2056≡     - СМЕНА БОБИНЫ
* НОМЕР ЗОНЫ(8)- 0≡
* ВЫДАТЬ- СРЗ≡
* НОМЕР БОБ- 2048 0≡
* 0020) 00000000 00000000
*       00000001 23432101
* 0021) 03000737 02200000
*       00000000 00000000
*  ЭТО ВСЕ.
* ВЫДАТЬ- НАЧ≡
* ЧТО- ПРОЗ 2048 0≡
* ВЫДАТЬ- КНЦ≡
*  КОНЕЦ СЕАНСА
*
*      1.5  "РОСП"
*      ПО ДИРЕКТИВЕ "РОСП" ФОРМИРУЕТСЯ ЗАДАЧА РОСПИСИ ЛЕНТ
* УКАЗАННЫМИ КОДАМИ
*                    П Р И М Е Р Ы
* ЧТО- РОСП≡
* НОМЕР БОБ- 769≡
* ДИАПАЗОНЫ- 0-30≡
* КОД- 0≡
* КОД- 7777777777777777≡
* КОД- ≡
*  030:ПРОГР РОСП
* ЧТО- РОСП 769≡
* ДИАПАЗОНЫ- Э.    -НАБИРАЕМЫЙ ТЕКСТ БУДЕТ ПОВТОРЯТЬСЯ
* УСТ: 31-31 34-37≡
* 31-31 34-37
* КОД- ≡               -ЕСЛИ НЕ ЗАДАНО НИ ОДНОГО КОДА, ТО
*                        ПРОИЗВОДИТСЯ РОСПИСЬ РАЗМЕТОЧНЫМ КОДОМ
*  031:ПРОГР РОСП
* ЧТО-
*
*      1.6. "ПАР"
*      ДИРЕКТИВА "ПАР" ПРЕДНАЗНАЧЕНА ДЛЯ УСТАНОВКИ И СМЕНЫ ПАРО
* ЛЕЙ НА БОБИНЫ. СМЕНА ПАРОЛЕЙ МОЖЕТ ПРОИЗВОДИТСЯ ТОЛЬКО ПОД ТЕ
* ШИФРОМ, ПОД КОТОРЫМ ПАРОЛЬ ЗАВОДИЛСЯ.
* ЧТО- ПАРОЛЬ≡
* НОМЕР БОБ- 769≡
* ПАРОЛЬ ЧТ- 0 730≡        -УСТАНОВИЛИ ПАРОЛЬ ЧТЕНИЯ "0730"
* ПАРОЛЬ ЗП- 7333 0343≡    -СМЕНИЛИ ПАРОЛЬ ЗАПИСИ
* ЧТО- ПАР 769≡
* ПАРОЛЬ ЧТ- ≡             -ПАРОЛЬ ЧТЕНИЯ НЕ АНАЛИЗИРУЕТСЯ
* ПАРОЛЬ ЗП- 7333 0≡       -СНЯЛИ ПАРОЛЬ ЗАПИСИ
* ЧТО- КНЦ≡
*  КОНЕЦ СЕАНСА
* ПРИ ЗАВЕДЕНИИ ИЛИ СНЯТИИ ПАРОЛЯ НА МЛ(МД)
* НАДО ВЫКЛЮЧИТЬ И ВНОВЬ ВКЛЮЧИТЬ МЛ(МД).
*
*      1.7. "ПРМЛ"
*      ПО ДИРЕКТИВЕ "ПРМЛ" ФОРМИРУЕТСЯ ТЕСТ МЛ. НЕОБХОДИМО
* УКАЗАТЬ НОМЕР БОБИНЫ; КОЛИЧЕСТВО ПОПЫТОК СЧИТЫВАНИЯ ЗОНЫ
* (ДЕСЯТИЧНОЕ ЧИСЛО) И ДИАПАЗОНЫ ПРОВЕРЯЕМЫХ ЗОН.
*
*
*      1.8.  Д И Р Е К Т И В А    " П Е Р Б "
*
*      ДИРЕКТИВА "ПЕРБ" ПОЗВОЛЯЕТ ПРОИЗВОДИТЬ ПЕРЕПИСЬ С
* МБ НА МЛ (МД). ДИАЛОГ И РАСПЕЧАТКА "ПЕРБ" ПОЛНОСТЬЮ
* ЭКВИВАЛЕНТНЫ "ПЕРЕ".
*
*
*              З А М Е Ч А Н И Е
*    ДЛЯ СИСТЕМНЫХ ПОЛЬЗОВАТЕЛЕЙ ВВОДЯТСЯ ДИРЕ-
*  КТИВЫ "ПЕРС" (ОПИСАНИЕ КАК В ДИР-ВЕ "ПЕРЕ"),
*  "РОСС" (ОПИСАНИЕ КАК В ДИР-ВЕ "РОСП"),
*  КОТОРЫЕ ИСПОЛЬЗУЮТСЯ ДЛЯ СИСТЕМНЫХ ПАКЕТОВ
*
*      2 .   Д И Р Е К Т И В А   ’ Ф И О ’
*
*      ДИРЕКТИВА ’ФИО’ ПОЗВОЛЯЕТ ПРОСМАТРИВАТЬ И ИЗМЕНЯТЬ
* КАТАЛОГ ФАМИЛИЙ И ШИФРОВ ПОЛЬЗОВАТЕЛЕЙ.  П Р И М Е Р Ы :
* ЧТО- ФИО
* ПАРОЛЬ-.....             -ДИРЕКТИВА ЗАЩИЩЕНА ПАРОЛЕМ
* =660 ПЕТРОВ К.С.         -ВНЕСЕНИЕ ИЛИ ЗАМЕНА ПОЛЬЗОВАТЕЛЯ
* 0660  ПЕТРОВ К.С.         -ВВЕДЕННАЯ ФАМИЛИЯ ДЛЯ КОНТРОЛЯ
* =4199                     ПОВТОРЯЕТСЯ
* 4199  ОС ДИСПАК           -ВЫДАЧА ПОЛЬЗОВАТЕЛЯ ПО ШИФРУ
* =ИВАНОВ                  -ВЫДАЧА ПОЛЬЗОВАТЕЛЯ ПО ФАМИЛИИ
* 0110  ИВАНОВ А.П.
* 1023  ИВАНОВА Л.Н.
* 7044  ИВАНОВ П.Р.
*  ЭТО ВСЕ.
* =41                      -ВЫДАЧА ОТДЕЛА
* 4199  ОС ДИСПАК
* 4198  МАРС
* 4155  СТАТИСТИКА
*  ЭТО ВСЕ.
* УСТ: ОБЧ 4215    -УБРАЛИ ПОЛЬЗОВАТЕЛЯ 4215
*  ЕСТЬ
* =ОБО 32          -ОБНУЛИЛИ 32-Й ОТДЕЛ
*  УБРАН 32 ОТДЕЛ
* =ОБВ             -ОБНУЛЕНИЕ ВСЕГО КАТАЛОГА, КРОМЕ 4199
*  КАТАЛОГ ОБНУЛЕН.  (ОС ДИСПАК),4155(СТАТИСТИКА),4198(МАРС)
* =ЗАП
*  ЕСТЬ             -ИСПРАВЛЕННЫЙ КАТАЛОГ ЗАПИСАН НА ДИСК
* =ФИО                        - ВЫДАЧА НА АЦПУ АЛФ.СПИСКА
* СФОРМИРОВАНА ПРОГР ФИО         ДЛЯ ВЫДАЧИ СПИСКА ПО ШИФРАМ
* ЧТО-                             ИСПОЛЬЗУЕТСЯ ПРИКАЗ "ОГЧЕ"
*                                  ВЫДАЧА ДВУХ СПИСКОВ - "ВСЕ"
*
*            3. РАЗДЕЛ  " П А С П "
*            **********************
*
*
*
* РАЗДЕЛ ПРЕДНАЗНАЧЕН ДЛЯ РАБОТЫ С СИСТЕМНЫМ АРХИВОМ
* СТАНДАРТНЫХ ПАСПОРТОВ ОС ДИСПАК.
*
*
*           3.1. ОБЩИЕ ПРИНЦИПЫ РАБОТЫ.
*           ---------------------------
*
*
*
* В ЛЮБОЙ МОМЕНТ РАБОТЫ СТАНДАРТНЫЙ ПАСПОРТ МОЖЕТ НАХОДИТЬСЯ
* НА КАЖДОМ ИЗ ТРЕХ УРОВНЕЙ:
*  - ПЕРВЫЙ УРОВЕНЬ - СИСТЕМНЫЙ АРХИВ СТАНДАРТНЫХ ПАСПОРТОВ
*  - ВТОРОЙ УРОВЕНЬ - РАБОЧАЯ КОПИЯ ПЕРВОГО УРОВНЯ В ПАМЯТИ
*    ’СЕРП’А
*  - ТРЕТИЙ УРОВЕНЬ - ПОЛЕ РАБОТЫ С ВЫБРАННЫМ ПАСПОРТОМ.
* СТРУКТУРА ПЕРВОГО И ВТОРОГО УРОВНЕЙ - ПОСЛЕДОВАТЕЛЬНОСТЬ
* СТАНДАРТНЫХ ПАСПОРТОВ, ТРЕТЬЕГО - ПОСЛЕДОВАТЕЛЬНОСТЬ ПРЕД-
* ЛОЖЕНИЙ НЕКОТОРОГО СТАНДАРТНОГО ПАСПОРТА.
* ПРЕДЛОЖЕНИЕ СТАНДАРТНОГО ПАСПОРТА - ЭТО
*  - ЛИБО РАЗДЕЛ ЗАКАЗА РЕСУРСА (НАПРИМЕР ’ТРА 32-’)
*  - ЛИБО ПРИЗНАК КОНЦА ЗАКАЗА РЕСУРСОВ ИЛИ МАССИВА ( ’Е’ )
*  - ЛИБО ВВОДНОЕ СЛОВО (НАПРИМЕР ’В 2000’)
*  - ЛИБО СПЕЦИФИКАЦИЯ ВВОДА (НАПРИМЕР ’А1БЕМШ-◇’ , ’С 376’)
*  - ЛИБО ПРИЗНАК КОНЦА ВСЕХ МАССИВОВ (’ЕКОНЕЦ’).
*   ВСЕ ДИРЕКТИВЫ РАЗДЕЛА "ПАСП" ПОДРАЗДЕЛЯЮТСЯ НА ДВЕ
* ГРУППЫ - ДИРЕКТИВЫ ПЕРЕНОСА ИНФОРМАЦИИ С УРОВНЯ НА УРОВЕНЬ
* И ДИРЕКТИВЫ РАБОТЫ С СОДЕРЖИМЫМ ОПРЕДЕЛЕННОГО УРОВНЯ.
* СИМВОЛ ’/’ В ТЕКСТЕ ИНСТРУКЦИИ ОЗНАЧАЕТ ’ИЛИ’.
*
*
*
*         3.2. ДИРЕКТИВЫ ПЕРВОЙ ГРУППЫ.
*         -----------------------------
*
*
*
*        3.2.1. ДИРЕКТИВА = Ч [ И Т ] =.
*
*  ПЕРЕНОС ИНФОРМАЦИИ С ПЕРВОГО НА ВТОРОЙ УРОВЕНЬ. ПОСЛЕ
* ВЫПОЛНЕНИЯ ДИРЕКТИВЫ СОДЕРЖИМОЕ ТРЕТЬЕГО УРОВНЯ НЕ ОПРЕ-
* ДЕЛЕНО. ПРИ ВХОДЕ В РАЗДЕЛ "ПАСП" ДИРЕКТИВА ВЫПОЛНЯЕТСЯ
* АВТОМАТИЧЕСКИ.
*
*
*        3.2.2. ДИРЕКТИВА = Д [ А Й ] <ИМЯ> =.
*
* <ИМЯ> ::= ЗNК / NК / ЗС<L> / С<L> ,
* ГДЕ 0 < N < 10 , -1 < К < 10 , <L> - СИМВОЛ УПП.
*  ПЕРЕНОС ТЕКСТА ПАСПОРТА С ИМЕНЕМ <ИМЯ> СО ВТОРОГО УРОВНЯ
* НА ТРЕТИЙ. ПАСПОРТ РАЗБИВАЕТСЯ НА СТРОКИ,КАЖДАЯ ИЗ КОТОРЫХ
* СОДЕРЖИТ ОДНО ПРЕДЛОЖЕНИЕ. ПРЕДЛОЖЕНИЕ ПРИВОДИТСЯ К УДОБ-
* НОМУ ДЛЯ РАБОТЫ ВИДУ, ПРИ ЭТОМ ПРОВОДИТСЯ ЧАСТИЧНЫЙ СИНТАК-
* СИЧЕСКИЙ КОНТРОЛЬ ВЫБРАННОГО ПАСПОРТА.
*  ВОЗМОЖНЫЕ ДИАГНОСТИКИ:
*   ’ОШИБКА В ПАСПОРТЕ’ - ОБНАРУЖЕНА СИТАКСИЧЕСКАЯ ОШИБКА.
*                         ОШИБОЧНЫЙ СИМВОЛ ОТМЕЧАЕТСЯ ЗНА -
*                         КОМ ВОПРОСА.
*   ’НЕВВЕ’             - ПАСПОРТА С ТАКИМ ИМЕНЕМ НЕТ НА
*                         ВТОРОМ УРОВНЕ. ТРЕТИЙ УРОВЕНЬ НЕ
*                         ОПРЕДЕЛЕН.
*
*
*         3.2.3. ДИРЕКТИВА = З [ А П ] [<ИМЯ>].
*
*  ПЕРЕНОС ИНФОРМАЦИИ С ТРЕТЬЕГО УРОВНЯ НА ВТОРОЙ, А ЗАТЕМ
* СО ВТОРОГО НА ПЕРВЫЙ. ЕСЛИ СОДЕРЖИМОЕ ТРЕТЬЕГО УРОВНЯ НЕ
* ОПРЕДЕЛЕНО, ТО ПРОИЗВОДИТСЯ ТОЛЬКО ПЕРЕНОС СО ВТОРОГО
* УРОВНЯ НА ПЕРВЫЙ. НА ВТОРОЙ УРОВЕНЬ ПАСПОРТ ЗАНОСИТСЯ С
* ИМЕНЕМ <ИМЯ>, ПРИ ОТСУТСТВИИ ПАРАМЕТРА - ПОД ИМЕНЕМ,
* ФИГУРИРОВАВШИМ В КАЧЕСТВЕ ПАРАМЕТРА ПОСЛЕДНЕЙ ДИРЕКТИВЫ
* = Д А Й =.
*   ВОЗМОЖНЫЕ ДИАГНОСТИКИ:
*    ’НУЖНА <ДАЙ>’           - ПРИСУТСТВУЕТ ПАРАМЕТР <ИМЯ>,
*                              А ТРЕТИЙ УРОВЕНЬ НЕ ОПРЕДЕЛЕН
*    ’НЕВВЕ’                 - ПАСПОРТА С ТАКИМ ИМЕНЕМ НЕТ
*                              НА ВТОРОМ УРОВНЕ.
*    ’ДЛИНА>СВОБ.’           - МАЛО СВОБОДНОГО МЕСТА НА ВТО-
*                              РОМ УРОВНЕ. ПЕРЕНОСИТСЯ НАЧАЛЬ-
*                              НАЯ ЧАСТЬ ПАСПОРТА,КОТОРАЯ
*                              МОЖЕТ ПОМЕСТИТЬСЯ.
*
*
*
*           3.3. ДИРЕКТИВЫ ВТОРОЙ ГРУППЫ.
*           -----------------------------
*
*
*
*          3.3.1. РАБОТА СО ВТОРЫМ УРОВНЕМ.
*          --------------------------------
*
*
*       3.3.1.1. ДИРЕКТИВА = О [ Г Л ] [<П>] =.
*
*  <П> ::= <ИМЯ> / З / ЗС / С / <N> / З<N>
*  0 < <N> < 10
*  ВЫДАЧА СТРУКТУРЫ ВТОРОГО УРОВНЯ И НЕКОТОРОЙ ДОПОЛНИТЕЛЬ-
* НОЙ ИНФОРМАЦИИ.
*  ВЫДАЧА ПРОИЗВОДИТСЯ СТРОКАМИ СЛЕДУЮЩЕГО ВИДА:
*     -<ИМЯ>- (<ДЛИНА>В)[ "<КЛЮЧ>" VТ-<NТ> [<ОГЧЕЗКЗАДАВА>]], Г
*    <ДЛИНА>       - ДЛИНА ПАСПОРТА НА ВТОРОМ УРОВНЕ В
*                    МАШИННЫХ СЛОВАХ (ВОСЬМЕРИЧНАЯ)
*    <КЛЮЧ>        - КЛЮЧ ТЕРМИНАЛЬНОЙ СИСТЕМЫ, КОТОРОЙ
*                    СООТВЕТСТВУЕТ ПАСПОРТ <ИМЯ>.
*    <NТ>          - ЧИСЛО ТЕРМИНАЛОВ, ОБСЛУЖИВАЕМЫХ ТЕР-
*                    МИНАЛЬНОЙ СИСТЕМОЙ С КЛЮЧОМ <КЛЮЧ>.
*    <ОГЧЕЗКЗАДАВА>- ШИФР МНОГОТЕРМИНАЛЬНОЙ СИСТЕМЫ С КЛЮ-
*                    ЧОМ <КЛЮЧ>.
*  ЕСЛИ ПАРАМЕТР <П> ИМЕЕТ ВИД :
*    З             - ВЫДАЮТСЯ ВСЕ ПАСПОРТА С ИМЕНЕМ <NК>,
*    ЗС / С        - ВЫДАЮТСЯ ВСЕ ПАСПОРТА С ИМЕНЕМ С<L>,
*    З<N> / <N>    - ВЫДАЮТСЯ ПАСПОРТА <N>0 . . <N>9 ,
*    <ИМЯ>         - ВЫДАЕТСЯ ПАСПОРТ <ИМЯ>.
*  ПОСЛЕ ВЫДАЧИ СВЕДЕНИЙ О ПАСПОРТАХ ВЫДАЕТСЯ СТРОКА ВИДА
*    ’СВОБ. <LLLL>В’,
* ГДЕ <LLLL> - ВОСЬМЕРИЧНАЯ ДЛИНА СВОБОДНОГО МЕСТА НА ВТОРОМ
* УРОВНЕ В МАШИННЫХ СЛОВАХ.
*  ПОСЛЕ ВЫПОЛНЕНИЯ ДИРЕКТИВЫ СОДЕРЖИМОЕ ТРЕТЬЕГО УРОВНЯ НЕ
* ОПРЕДЕЛЕНО.
*  ВОЗМОЖНЫЕ ДИАГНОСТИКИ:
*   ’НЕВВЕ’             - ПАСПОРТА С ТАКИМ ИМЕНЕМ НЕТ НА
*                         ВТОРОМ УРОВНЕ.                                                              4
*
*
*       3.3.1.2. ДИРЕКТИВА = Н [ О В ] <ИМЯ> =.
*
*  НА ВТОРОМ УРОВНЕ ЗАВОДИТСЯ ПУСТОЙ ПАСПОРТ С ИМЕНЕМ <ИМЯ>.
*    ВОЗМОЖНЫЕ ДИАГНОСТИКИ:
*     ’ДЛИНА > СВОБ.’  - НА ВТОРОМ УРОВНЕ НЕТ МЕСТА ДЛЯ
*                        НОВОГО ПАСПОРТА.
*
*
*       3.3.1.3. ДИРЕКТИВА  У [ Б Р ] <ИМЯ>
*
*  ПАСПОРТ С ИМЕНЕМ <ИМЯ> УБИРАЕТСЯ СО ВТОРОГО УРОВНЯ.
*  ВОЗМОЖНЫЕ ДИАГНОСТИКИ:
* ’НЕВВЕ’ - СМЫСЛ ОЧЕВИДЕН.
*
*      3.3.1.4.  ДИРЕКТИВА  В С Е.
*
*  НА ЭКРАН ВЫДАЮТСЯ В НЕРАЗОБРАННОМ ВИДЕ ВСЕ ПАСПОРТА ВТОРОГО
* УРОВНЯ. ПОСЛЕ ВЫПОЛНЕНИЯ ТРЕТИЙ УРОВЕНЬ НЕ ОПРЕДЕЛЕН.
*
*
*         3.3.2. РАБОТА С ТРЕТЬИМ УРОВНЕМ.
*         --------------------------------
*
*
*    3.3.2.1. ДИРЕКТИВА  В [ Ы Д ] [<N1><Р>[<N2>]]
*
*  ГДЕ <Р> - ГРУППА СИМВОЛОВ УПП,НИ ОДИН ИЗ КОТОРЫХ НЕ
*            ЯВЛЯЕТСЯ ЦИФРОЙ,
*  0 <= <N1> <= <N2> <= 999999.
*  ВЫДАЧА ПРЕДЛОЖЕНИЙ ПАСПОРТА С НОМЕРАМИ ОТ <N1> ДО <N2>.
* ЕСЛИ ПАРАМЕТР <N2> ОТСУТСТВУЕТ,ТО ВЫДАЧА ПРОИЗВОДИТСЯ ДО
* КОНЦА ПАСПОРТА,А ПРИ ОТСУТСТВИИ ОБОИХ ПАРАМЕТРОВ,ВЫДАЕТСЯ
* ВЕСЬ ПАСПОРТ.ЕСЛИ <N1> БОЛЬШЕ ЧИСЛА ПРЕДЛОЖЕНИЙ,ТО ВЫДА-
* ЕТСЯ ПОСЛЕДНЕЕ ПРЕДЛОЖЕНИЕ.
*  НУЛЕВОЕ ПРЕДЛОЖЕНИЕ ПАСПОРТА ИМЕЕТ ВИД:
* <ИМЯ> <ДЛИНА>.
*
*
*      3.3.2.2. ДИРЕКТИВА О [ Т М ] <N1>[<Р><N2>]
*
*  ИСКЛЮЧАЕТ ПРЕДЛОЖЕНИЯ С НОМЕРАМИ ОТ <N1> ДО <N2>.ЕСЛИ
* ПАРАМЕТР <N2> ОТСУТСТВУЕТ,ТО ОН ПОЛАГАЕТСЯ РАВНЫМ <N1>.
* НУЛЕВОЕ ПРЕДЛОЖЕНИЕ ОТМЕНЯТЬ НЕЛЬЗЯ.
*
*
*        3.3.2.3. ДИРЕКТИВА  В С [ Т ] <N1>.
*
*  ПОСЛЕ ВЫПОЛНЕНИЯ ДИРЕКТИВЫ ВЫДАЕТСЯ ПРИГЛАШЕНИЕ ’:’ И
* ПРОИЗВОДИТСЯ ПЕРЕХОД В РЕЖИМ ПРИЕМА ТЕКСТА.ВЫХОД ИЗ РЕ-
* ЖИМА ПРОИСХОДИТ ПО ПУСТОЙ ПОСЫЛКЕ.ПРИНЯТЫЙ ТЕКСТ ВСТАВ-
* ЛЯЕТСЯ ПЕРЕД ПРЕДЛОЖЕНИЕМ <N1>.
*  ВОЗМОЖЕН ВВОД КОДА СИМВОЛА В УПП В ВИДЕ <ЕSСАРЕ><КОД>,
* ГДЕ <КОД> - ТРИ ВОСЬМЕРИЧНЫЕ ЦИФРЫ, А <ЕSСАРЕ> -   КОД
* ’174’ (КЛАВИША <RЕТURN> VТ-340) ЛИБО КОД ’175’(КЛАВИША
* "БЭКСЛЭШ"(ОБРАТНЫЙ СЛЭШ)). ДЛЯ ВВОДА КОДА ’175’
* БЭКСЛЭШ НАДО НАЖАТЬ ДВАЖДЫ.
*  КОНСТРУКЦИЯ ВИДА <ЕSСАРЕ>К И <ЕSСАРЕ>Д ВОСПРИНИМАЮТСЯ
* КАК КОД ’341’ (КОНЕЦ КАРТЫ ПО А3,А5) И ДИСПЕТЧЕРСКИЙ
* КОНЕЦ СООТВЕТСВЕННО.
*  3.3.2.4  ДИРЕКТИВА  З А М  <N1>[<Р><N2>].
*
* ЭКВИВАЛЕНТНА КОНКАТЕНАЦИИ ДИРЕКТИВ  О Т М  <N1>[<Р><N2>]
* И   В С Т  <N1>: ЗАМЕНЯЕТ НА ТРЕТЬЕМ УРОВНЕ ПРЕДЛОЖЕНИЯ
* С <N1> ПО <N2> НА ВВОДИМЫЙ ТЕКСТ.
*
*  3.3.2.5.  ДИРЕКТИВА  Р [Е Д].
*
*   ВЫДАЕТСЯ ПРИГЛАШЕНИЕ ":" И ПРОИСХОДИТ ПЕРЕХОД В РЕЖИМ
* ПРИЕМА ТЕКСТА, КОТОРЫЙ ДОЛЖЕН ИМЕТЬ ФОРМАТ, АНАЛОГИЧНЫЙ
* ФОРМАТУ ТЕКСТА, ВЫДАВАЕМОГО ПО ДИРЕКТИВАМ  В Ы Д (3.3.2.1)
* И  Н А Й (3.3.2.6). УДОБНО ВЫПОЛНИТЬ ОДНУ ИЗ ЭТИХ ДИРЕКТИВ,
* ПЕРЕЙДЯ В РЕЖИМ <ОFF LINЕ> ПРОИЗВЕСТИ НЕОБХОДИМОЕ РЕДАКТИ-
* РОВАНИЕ, НЕ ЗАБЫВ В ПОСЛЕДНЕЙ РЕДАКТИРУЕМОЙ СТРОКЕ ЗАМЕНИТЬ
* СИМВОЛ <LINЕ FЕЕD> НА <ЕТХ>, И ПОДВЕДЯ МАРКЕР К ПЕРВОЙ РЕДАК-
* ТИРУЕМОЙ СТРОКЕ, ИНИЦИИРОВАТЬ ПЕРЕДАЧУ: <SЕND> У VТ, <ПД> У
* РИН-609. НА ТРЕТЬЕМ УРОВНЕ БУДУТ ОТДУБЛИРОВАНЫ СДЕЛАННЫЕ НА
* ЭКРАНЕ ИСПРАВЛЕНИЯ.
*  ВОЗМОЖНЫЕ ДИАГНОСТИКИ:
* ’ОШИБКА В КОДЕ’ - ЗА <RЕТURN> СЛЕДУЕТ НЕ К,НЕ Д И НЕ
*                   ТРИ ВОСЬМЕРИЧНЫЕ ЦИФРЫ,
* ’НУЖНА <ДАЙ>’   - ТРЕТИЙ УРОВЕНЬ НЕ ОПРЕДЕЛЕН.
*
*   3.3.2.6.  ДИРЕКТИВА  Н [ А Й ] <КОНТЕКСТ>
*
* <КОНТЕКСТ> НЕ БОЛЕЕ 6 СИМВОЛОВ, В КОНТЕКСТЕ НЕ ДОЛЖНО БЫТЬ
* ПРОБЕЛОВ.
* НА ТРЕТЬЕМ УРОВНЕ ОСУЩЕСТВЛЯЕТСЯ ПОИСК ЗАДАННОГО КОНТЕКСТА
* И НА ЭКРАН ВЫДАЮТСЯ ВСЕ ПРЕДЛОЖЕНИЯ, В КОТОРЫХ ОН ОБНАРУЖЕН.
*
*      3.4. СЕРВИСНЫЕ ДИРЕКТИВЫ.
*
*  3.4.1. ДИРЕКТИВА  = Ф[О Р][ <ИМЯ>] =
*  ------------------------------------
*  ФОРМИРОВАНИЕ ЗАДАЧИ. ПРИ ОТСУТСТВИИ ПАРАМЕТРА ДИРЕКТИВЫ
* ТЕКСТ ФОРМИРУЕМОЙ ЗАДАЧИ БЕРЕТСЯ С ТРЕТЬЕГО УРОВНЯ, В
* ПРОТИВНОМ СЛУЧАЕ НЕЯВНО ВЫПОЛНЯЕТСЯ ДИРЕКТИВА "ДАЙ" С
* ПАРАМЕТРОМ <ИМЯ>, ДАЛЕЕ ДИРЕКТИВА РАБОТАЕТ КАК ПРИ
* ОТСУТСТВИИ ПАРАМЕТРА, ЗАТЕМ ВЫПОЛНЯЕТСЯ КОПИРОВАНИЕ
* УРОВНЕЙ 1 -> 2.
*
*   3.4.2. ДИРЕКТИВА  = Б[О Б] <NБОБ>[ <ЗОНА>] =
*  ----------------------------------------------
*  ПЕРЕНОС ПЕРВОГО УРОВНЯ НА БОБИНУ <NБОБ> В ЗОНЫ
* <ЗОНА> И <ЗОНА>+1.  ПОСЛЕ ВЫПОЛНЕНИЯ ЭТОЙ ДИРЕКТИВЫ
* СВЕДЕНИЯ О КЛЮЧАХ ДИАЛОГОВЫХ СИСТЕМ ПО ДИРЕКТИВЕ
* "ОГЛ" НЕ ВЫДАЮТСЯ.
*
*
*      3.5. ПРИМЕР СЕАНСА РАБОТЫ С РАЗДЕЛОМ.
* -----------------------------------------
* ЧТО- ПАСП=
* ПАРОЛЬ- 02611=      ПАРОЛЬ НА ВХОД В БЛОК
* ПАРОЛЬ ЧТ- 1717=    --//-- НА СИСТЕМНЫЙ МД
* ПАСП- ОГЛ ЗСА=
* НЕВВЕ               ТАКОГО ПАСПОРТА НЕ БЫЛО
* ПАСП- НОВ СА=      ЗАВЕЛИ НА ВТОРОМ УРОВНЕ
* ЕСТЬ.              ПУСТОЙ ПАСПОРТ ’СА’
* ПАСП- ДАЙ СА=      ПЕРЕНОС НА ТРЕТИЙ УРОВЕНЬ
* ЕСТЬ.
* ПАСП- ВЫД=         ВЫДАТЬ ПАСПОРТ
*  0000 СА 002
*  0001              ПАСПОРТ ПУСТ
* ПАСП- ВС 1         ВСТАВИТЬ ПЕРЕД ПЕРВОЙ СТРОКОЙ
* : ОЗУ 17 =
* : ВХОД 1 =         ВВОД ТЕКСТА
* : ВРЕ 100
* : ЕВ1К000740000=
* : ЕЕКОНЕЦ=
* : =
* ПАСП- ЗАП=
* ЕСТЬ.              ЗАВЕЛИ НОВЫЙ ПАСПОРТ ’СА’
* ПАСП- =
* ЧТО-
*
*
*
*
*           4.  РАЗДЕЛ " К Л Ю Ч "
*           **********************
*
* РАЗДЕЛ ПРЕДНАЗНАЧЕН ДЛЯ РАБОТЫ С СИСТЕМНЫМ АРХИВОМ КЛЮЧЕЙ
* ДИАЛОГОВЫХ СИСТЕМ ОС ДИСПАК
*
*
*
*       4.1.  ОБЩИЕ ПРИНЦИПЫ РАБОТЫ.
*       ----------------------------
*
*
*  В РАЗДЕЛЕ РАЗЛИЧАЮТСЯ ДВА УРОВНЯ ХРАНЕНИЯ ИНФОРМАЦИИ :
*     ПЕРВЫЙ УРОВЕНЬ   - СИСТЕМНЫЙ АРХИВ КЛЮЧЕЙ
*     ВТОРОЙ УРОВЕНЬ   - РАБОЧАЯ КОПИЯ АРХИВА В МОЗУ
*  ДИРЕКТИВЫ РАЗДЕЛА ДЕЛЯТСЯ НА ДВЕ ГРУППЫ:
*     ПЕРВАЯ ГРУППА    - КОПИРОВАНИЕ УРОВНЕЙ
*     ВТОРАЯ ГРУППА    - РАБОТА СО ВТОРЫМ УРОВНЕМ
*
*
*      4.2.  ДИРЕКТИВЫ ПЕРВОЙ ГРУППЫ.
*      ------------------------------
*
*
*
*      4.2.1.  ДИРЕКТИВА = Ч И Т = .
*
* КОПИРОВАНИЕ УРОВНЕЙ 1 =-> 2 .
* ДИРЕКТИВА ВЫПОЛНЯЕТСЯ АВТОМАТИЧЕСКИ ПРИ ВХОДЕ В РАЗДЕЛ.
*
*
*      4.2.2.  ДИРЕКТИВА = З А П = .
*
*  КОПИРОВАНИЕ УРОВНЕЙ 2 =-> 1 .
*
*
*
*      4.3.  ДИРЕКТИВЫ ВТОРОЙ ГРУППЫ.
*      ------------------------------
*  ЭТИ ДИРЕКТИВЫ ИМЕЮТ ОБЩИЙ ВИД:
*   ’<ДИР> [<ИМЯ>]’ , ГДЕ
*    <ДИР>      - МНЕМОНИКА ДИРЕКТИВЫ
*    <ИМЯ>      - ИМЯ КЛЮЧА С КОТОРЫМ ВЕДЕТСЯ РАБОТА.
* ЕСЛИ <ИМЯ> НЕ ЗАДАНО, ТО ОНО ДОЗАПРАШИВАЕТСЯ СПЕЦИАЛЬНО.
*  ИСКЛЮЧЕНИЕ СОСТАВЛЯЕТ ДИРЕКТИВА = О Г Л =, НЕ ИМЕЮЩАЯ
* ПАРАМЕТРОВ.
*  ИСПОЛЬЗУЕМОЕ ДАЛЕЕ ПОНЯТИЕ СТРОКА(<ИМЯ>) ОБОЗНАЧАЕТ
* СЛЕДУЮЩУЮ КОНСТРУКЦИЮ:
*    ’<ИМЯ> ТЕРМ <NN>  ПАСП <СТП>[ ШИФР <ОГЧЕЗКЗАДАВА>]’
* ГДЕ <NN>           - ЧИСЛО ТЕРМИНАЛОВ,ОБСЛУЖИВАЕМЫХ ДИАЛОГО-
*                      ВОЙ СИСТЕМОЙ С КЛЮЧОМ <ИМЯ>
*     <СТП>          - СТАНДАРТНЫЙ ПАСПОРТ ЭТОЙ СИСТЕМЫ
*                      ( СМ. ГЛАВУ 3.)
*     <ОГЧЕЗКЗАДАВА> - ШИФР ДИАЛОГОВОЙ СИСТЕМЫ, ЕСЛИ ОНА
*                      МНОГОТЕРМИНАЛЬНАЯ.
* ИЛИ ’НЕВВЕ’ , ЕСЛИ КЛЮЧА С ИМЕНЕМ ИМЯ НА ВТОРОМ УРОВНЕ НЕТ.
*
*
*      4.3.1.  ДИРЕКТИВА = О Г Л = .
*
*  ВЫДАЕТСЯ СТРОКА(<ИМЯ>) ДЛЯ КАЖДОГО СУЩЕСТВУЮЩЕГО НА
* ВТОРОМ УРОВНЕ КЛЮЧА.
*
*
*      4.3.2.  ДИРЕКТИВА = П О К = .
*
* ВЫДАЕТСЯ СТРОКА(<ИМЯ>).
*
*
*      4.3.3.  ДИРЕКТИВА = У Б Р = .
*
*  ВЫДАЕТСЯ СТРОКА(<ИМЯ>) И КЛЮЧ <ИМЯ> УБИРАЕТСЯ СО ВТОРОГО
* УРОВНЯ.
*
*
*      4.3.4.  ДИРЕКТИВА = Н О В = .
*
*  ВЫДАЕТСЯ СТРОКА(<ИМЯ>) И НА ВТОРОМ УРОВНЕ ЗАВОДИТСЯ ПУСТОЙ
* КЛЮЧ. ДАЛЕЕ ЗАПРАШИВАЮТСЯ СВЕДЕНИЯ О ВВОДИМОМ КЛЮЧЕ:
*
* ПРИГЛАШЕНИЕ     НАДО СООБЩИТЬ
* ’ТЕРМ-’         ЧИСЛО ТЕРМИНАЛОВ, ОБСЛУЖИВАЕМЫХ ЗАДАЧЕЙ
*                 С КЛЮЧОМ <ИМЯ>
* ’ПАСП-’         ИМЯ СТАНДАРТНОГО ПАСПОРТА, ВЫЗЫВАЮЩЕГО ЭТУ
*                 ЗАДАЧУ
* ’ШИФР-’         ШИФР ЭТОЙ ЗАДАЧИ, ЕСЛИ ОНА МНОГОТЕРМИНАЛЬНАЯ
*                 ( 12 ДЕСЯТИЧНЫХ ЦИФР)
* ’ПАРОЛЬ-’       ПАРОЛЬ НА ЭТОТ ШИФР В СМЫСЛЕ ОС ДИСПАК
*                 ( 6  ДЕСЯТИЧНЫХ ЦИФР)
* ВВОДИТСЯ КЛЮЧ С УКАЗАННЫМИ ПАРАМЕТРАМИ И ВЫДАЕТСЯ СТРОКА(<ИМЯ
*
*
*
*
*       В А Ж Н О Е   З А М Е Ч А Н И Е ! ! !
*       -------------------------------------
*  ЗАПРЕЩАЕТСЯ ПОЛЬЗОВАТЬСЯ СТАРОЙ ПРОГРАММОЙ "ЗАП" ДЛЯ
*  ЗАВЕДЕНИЯ ТЕРМИНАЛЬНЫХ КЛЮЧЕЙ !
*    ЗА КОНСУЛЬТАЦИЯМИИ И С ПРЕДЛОЖЕНИЯМИ ПО РАЗДЕЛАМ
*    ’ПАСП’ И ’КЛЮЧ’ ОБРАЩАТЬСЯ К
*      ЯРОСЛАВЦЕВУ МИХАИЛУ  (137-4205)
*      АКИМОВУ     ИГОРЮ    (278-9686)
*
*
*      5 .  Д И Р Е К Т И В Ы   Д Л Я   Р А Б О Т Ы
*          С   О П Е Р А Т И В Н О Й    П А М Я Т Ь Ю
*
*      5.1. "РАОП".
*      ПО ДИРЕКТИВЕ "РАОП" ФОРМИРУЕТСЯ ЗАДАЧА РАСПЕЧАТКИ
* ОБЛАСТЕЙ ОПЕРАТИВНОЙ ПАМЯТИ.
*
*      5.2. "АДР".
*      ДИРЕКТИВА "АДР" ПРЕДНАЗНАЧЕНА ДЛЯ ПРОСМОТРА
* СОДЕРЖИМОГО ОПЕРАТИВНОЙ ПАМЯТИ НА ТЕРМИНАЛЕ. ФОРМАТ:
*           АДР <НАЧ.АДРЕС> [- <КОН.АДРЕС>]
*
*          6.  Д И Р Е К Т И В А  " Т Е Р М ".
*
* ПОЗВОЛЯЕТ ЗАКРЕПИТЬ ТИПЫ ТЕРМИНАЛОВ ЗА ФИЗИЧЕСКИМИ
* КАНАЛАМИ.
*                 СТРУКТУРА ДИАЛОГА.
*                -------------------
*   ЧТО-      ТЕРМ
*   ПАРОЛЬ-  ......
*
*
*      7 .  В С П О М О Г А Т Е Л Ь Н Ы Е   Д И Р Е К Т И В Ы
*
*      7.1. "ШИФР"
*      ДИРЕКТИВА "ШИФР <6 ИЛИ 12 ЦИФР>" ЗАДАЕТ ШИФР, С КОТОРЫМ
* В ДАЛЬНЕЙШЕМ БУДУТ ФОРМИРОВАТЬСЯ ЗАДАЧИ. ПРИ ОТСУТСТВИИ
* ПАРАМЕТРА ВЫДАЕТСЯ ТЕКУЩИЙ ШИФР.
* ШИФР ДОЛЖЕН ПО ПЕРВЫМ 4 ЦИФРАМ СОВПАДАТЬ С ШИФРОМ, ПОД
* КОТОРЫМ ВЫЗВАН СЕРП.
*
*      7.2. "ВЫД" - ПРОМЕЖУТОЧНАЯ ("НУЛЕВАЯ") ВЫДАЧА НА АЦПУ.
*
*      7.3. "ВЕРСИЯ" - ВЫДАЧА НОМЕРА ВЕРСИИ ОС И СЕРП’А.
*
*      7.4.  "ПК" - ВЫЗОВ ПРОГРАММЫ "ПК".
*
*      7.5. "СБРОС" - ПРОПУСК ВЫДАЧИ НА АЦПУ
*
*      7.6. "ФОРМ"
* С ПОМОЩЬЮ ДАННОЙ ДИРЕКТИВЫ ЗАДАЕТСЯ ПАРОЛЬ НА ШИФР,
* ДОБАВЛЯЕМЫЙ В ДАЛЬНЕЙШЕМ В ТЕКСТЫ ФОРМИРУЕМЫХ ЗАДАЧ.
*    ЧТО- ФОРМ
*    ПАРОЛЬ- 123456
* ДЛЯ ОТМЕНЫ ДОПОЛНЕНИЯ ПАРОЛЕМ ПРИ ФОРМИРОВАНИИ СЛЕДУЕТ
* ЗАДАТЬ ПАРОЛЬ ИЗ ШЕСТИ НУЛЕЙ.
*
*      7.7. "ШАГ NN" - ЗАДАНИЕ ШАГА ВЫДАЧИ.
*
*
*      7.8.     Д И Р Е К Т И В А   " С Е Р П "
*
*      ДИРЕКТИВА "СЕРП" ПОЗВОЛЯЕТ ЗАМЕНЯТЬ ПАРОЛИ ЗАКРЫТЫХ
* БЛОКОВ СЕРП’А И УСТАНАВЛИВАТЬ ЗНАЧЕНИЯ РЯДА ПАРАМЕТРОВ.
* ДИРЕКТИВА РАБОТАЕТ ТОЛЬКО ДЛЯ ЗАДАЧИ СО СПЕЦИАЛЬНЫМ ШИФРОМ
* И ЗАЩИЩЕНА ПАРОЛЕМ (ПЕРВОНАЧАЛЬНО УСТАНОВЛЕН ШИФР
* 419988776655 И ПАРОЛЬ 02610).   П Р И М Е Р :
* ЧТО- СЕРП≡
* ПАРОЛЬ- 02610≡
* ПАРОЛЬ ФИО- АБВГД      - ЗДЕСЬ И ДАЛЕЕ ЗАДАЮТСЯ НОВЫЕ
* ПАРОЛЬ ПАСП- ≡    ПАРОЛИ ЗАКРЫТЫХ БЛОКОВ СИСТЕМЫ "СЕРП";
* ПАРОЛЬ ПЛАНА- =   ПУСТАЯ ПОСЫЛКА СОХРАНЯЕТ СТАРЫЙ ПАРОЛЬ;
* ПАРОЛЬ ГЕНСА- =   ПАРОЛИ ДОЛЖНЫ СОДЕРЖАТЬ РОВНО 5 СИМВОЛОВ.
* ПАРОЛЬ ВЫВ- =
* ПАРОЛЬ ПРИО- =
* ПАРОЛЬ МД- =    - ДОПОЛНИТЕЛЬНЫЙ ПАРОЛЬ ДЛЯ ВСЕХ РАБОТ С
*                   СИСТЕМНЫМ ДИСКОМ (КРОМЕ ФИО); ЕСЛИ ЗАДАН
*                   НУЛЕВОЙ ПАРОЛЬ ("00000="), ТО ОН НЕ ЗА-
*                   ПРАШИВАЕТСЯ (РАБОТА С СИСТ.ДИСКОМ ИДЕТ
*                   ПО-СТАРОМУ).
* ПАРОЛЬ ГЕН- ГЕНЕР=      - НОВЫЙ ПАРОЛЬ ДИРЕКТИВЫ "СЕРП"
* ПАРОЛЬ КЛЮЧА- =
* ШИФР- 419912345678=     - ШИФР, ДЛЯ КОТОРОГО РАЗРЕШЕНА
*                   ДИРЕКТИВА "СЕРП": 12-ЗНАЧНЫЙ, НАЧИНАЮЩИЙСЯ
*                   С "4199"
* ПК- 2048 0=     - БОБИНА И ЗОНА С ПРОГРАММОЙ "ПК"
*                   (СТАНДАРТНО - 2048 1)
* ШАГ- [ЧИСЛО]  - ЗАДАНИЕ ЧИСЛА СТРОК,ВЫДАВАЕМЫХ
*                 НА ЭКРАН ЗА ОДНУ ПОРЦИЮ.
* ЗАП- ≡          -ПУСТАЯ ПОСЫЛКА РАЗРЕШАЕТ ЗАПИСЬ НА МД
*  ЕСТЬ             СГЕНЕРИРОВАННОГО ВАРИАНТА СИСТЕМЫ
* ЧТО- КНЦ≡
*  КОНЕЦ СЕАНСА
*
*
*     8.    Д И Р Е К Т И В А   " З А Г Р "
*      ДИРЕКТИВА ФОРМИРУЕТ ЗАДАЧУ ЗАГРУЗКИ МОДУЛЕЙ ОС.
* ДИРЕКТИВА РАБОТАЕТ ТОЛЬКО ПРИ УСТАНОВЛЕННОМ ШИФРЕ ФОР-
* МИРОВАНИЯ ЗАДАЧ 419921 (Т.Е. НЕОБХОДИМО ЛИБО ВЫЗВАТЬ
* С ЭТИМ ШИФРОМ СЕРП, ЛИБО ВЫДАТЬ ДИРЕКТИВУ ШИФ 419921).
*      ДИРЕКТИВА ИМЕЕТ ВИД: ЗАГР [МД МОДУЛЕЙ],
* [НОМЕР НАЧ. ЗОНЫ МОДУЛЕЙ (СДВИГ) ],[МД ЗАГРУЗКИ];
* ЕСЛИ ПАРАМЕТРЫ НЕ ЗАДАНЫ,ТО БЕРУТСЯ СТАНДАРТ-
*НЫЕ ЗНАЧЕНИЯ(ЗАГРУЗКА ПРОИСХОДИТ НА ДИСК,СОВПА-
* ДАЮЩИЙ ПО НОМЕРУ С СИСТЕМНЫМ); ЕСЛИ ЗАДАН 1
* ПАР-Р, ТО ОН ВОСПРИНИМАЕТСЯ, КАК МД МОДУЛЕЙ;
* ЕСЛИ 2, ТО- МД МОДУЛЕЙ И СДВИГ; ПРИ ОПРОСЕ
* ПАРОЛЕЙ ВНАЧАЛЕ ОПРАШИВАЕТСЯ ПАРОЛЬ ЧТЕНИЯ БОБИНЫ С МО-
* ДУЛЯМИ, А ЗАТЕМ - ПАРОЛИ ЗАПИСИ И ЧТЕНИЯ ДИСКА ЗАГРУЗКИ.
*
*
*
*       9.  Д И Р Е К Т И В А   " П Л А Н "
*
*   ДИРЕКТИВА "ПЛАН" ПОЗВОЛЯЕТ ПЕРЕРАСПРЕДЕЛЯТЬ КАНАЛЫ КЛАССАМ
* КЛАССЫ: 0 - ЗАДАЧИ С Т > 10.55
*         1 -          5.27 < Т <10.55
*         2 -          2.43 < Т < 5.27
*         3 -          1.21 < Т < 2.43
*         4 -          Т < 1.21
*         5 - ЗАДАЧИ С РАЗДЕЛОМ "ТЕЛЕ"
*         6 - ЗАДАЧИ ИЗ СПЕЦ.КАТАЛОГА (СМ.ДИРЕКТ."ПРИО")
*         7 - СЛУЖЕБНЫЕ ЗАДАЧИ (СФОРМИРОВАННЫЕ ОТ ОС)
* ЧТО- ПЛАН
* ПАРОЛЬ- ......
* ИМЯ-                  СМ. РАЗДЕЛ "АРХИВ РЕЖИМОВ ОС"
* ЭВМ-
* КЛАСС- 5
* ПОР- 4              - ПОРЯДОК ПРОСМОТРА КЛАССА ПЛАНИРОВЩИКОМ
*                       (ЧЕМ МЕНЬШЕ, ТЕМ "ХУЖЕ"); ОТВЕТ ’ЕТХ’
*                       СОХРАНИТ СТАРОЕ ЗНАЧЕНИЕ
* КАНАЛЫ- 57,55,56,43 - КАНАЛЫ КЛАССУ; ПУСТАЯ ПОСЫЛКА - СОХР.
*                       СТАРОГО ЗНАЧЕНИЯ;
*                       "Н" - НЕ ОТВОДИТЬ КАНАЛОВ.
* КЛАСС-              - МОЖНО ПОВТОРИТЬ ПРОЦЕДУРУ ДЛЯ ДРУГОГО
*                       КЛАССА; КРОМЕ ТОГО, НА ПРИГЛАШЕНИЕ
*                       "КЛАСС" ВОЗМОЖНЫ ОТВЕТЫ: "ВЫД"- ВЫДАЧА
*                       УСТАНОВЛЕННОГО РАСПРЕДЕЛЕНИЯ; "СТ" -
*                       ВОССТАНОВЛЕНИЕ СТАНД.РАСПРЕДЕЛЕНИЯ ДЛЯ
*                       ВСЕХ КЛАССОВ;"ЗАП"- ПРИ ЭТОМ
*                       "СЕРП" СПРАШИВАЕТ:
* ИМЯ-                  ВОЗМОЖНЫЕ ОТВЕТЫ:
*                         РАБ - ВАРИАНТ ЗАПИШЕТСЯ В
*                       РАБОТУ,
*                         ГОТ - ВАРИАНТ БУДЕТ ПОДГО-
*                       ТОВЛЕН ДЛЯ ПЕРЕВЫЗОВА ОС,
*                         "ИМЯ"- ВАРИАНТ ПОД ДАННЫМ
*                       ИМЕНЕМ ЗАПИШЕТСЯ В АРХИВ РЕ-
*                       ЖИМОВ ОС. ПРИ "ГОТ" И "ИМЯ"
*                       БУДЕТ ЗАДАН ВОПРОС:
* ЭВМ-                  ОТВЕТ - НОМ. ЭВМ, ДЛЯ КОТОРОЙ
*                       БЫЛ ПОДГОТОВЛЕН ВАРИАНТ.
*                       СЕРП ОТВЕЧАЕТ "ЕСТЬ", И МОЖНО
*                       ПРОДОЛЖАТЬ РАБОТУ.
*                       "РЕЗ NNN" - ЧИСЛО НОМЕРОВ В КАТА-
*                       ЛОГЕ ВВОДА, РЕЗЕРВИРУЕМЫХ ДЛЯ ЗА-
*                       ДАЧ 5-ГО, 6-ГО, 7-ГО КЛАССОВ
*                       (СТАНДАРТНО ПАКЕТНЫЕ ЗАДАЧИ ИМЕЮТ
*                       НОМЕРА В КАТАЛОГЕ ВВОДА > 75).
*
*     10.     Д И Р Е К Т И В А   " Г Е Н С "
*
*      ДАННАЯ ДИРЕКТИВА ОБЕСПЕЧИВАЕТ ЗАНЕСЕНИЕ НА СИСТЕМНЫЙ
* ДИСК И ИЗМЕНЕНИЕ ПАРАМЕТРОВ (ТЕКСТОВОЙ ИНФОРМАЦИИ) ДЛЯ
* ВЫДИНСА, А ТАКЖЕ НАБОРОВ ГОТОВЫХ ПАРАМЕТРОВ ДЛЯ ПРОГРАММЫ
* "ГЕНС". КАЖДОМУ ВАРИАНТУ ТЕКСТОВОЙ ИНФОРМАЦИИ ДЛЯ ВЫДИНСА
* ПРИСВАИВАЕТСЯ ИМЯ (ДО 5 СИМВОЛОВ), ВЫБИРАЕМОЕ ПОЛЬЗОВАТЕЛЕМ
* ПРОИЗВОЛЬНО. КАЖДЫЙ НАБОР ПАРАМЕТРОВ ДЛЯ ГЕНСА ИМЕЕТ ПОРЯД-
* КОВЫЙ НОМЕР (ВОСЬМ. ЧИСЛО ОТ 1 ДО 20); НУМЕРАЦИЯ РАЗДЕЛЬНАЯ
* ПО КАЖДОЙ ЭВМ КОМПЛЕКСА; ОБЩЕЕ КОЛИЧЕСТВО ВАРИАНТОВ ДОЛЖНО
* БЫТЬ МЕНЬШЕ 17. ДЛЯ ПОДГОТОВКИ ПРЕДНАЗНАЧЕННОЙ ДЛЯ ВАРИАНТОВ
* ЗОНЫ ДИСКА К ИСПОЛЬЗОВАНИЮ НА ВОПРОС "ИМЯ-"(СМ.НИЖЕ) СЛЕДУЕТ
* ДАТЬ ОТВЕТ "НОВ".
* ОТВЕТ  " О Г Л "  НА ВОПРОС "ИМЯ-" ПОЗВОЛЯЕТ ПОЛУЧИТЬ
* СПИСОК ТЕКСТОВЫХ ВАРИАНТОВ.
*
* ЧТО- ГЕНС
* ПАРОЛЬ- .....
* ИМЯ- Б1В2        - СЛЕДУЕТ УКАЗАТЬ ИМЯ ТЕКСТОВОГО ВАРИАНТА;
*              ЕСЛИ ВАРИАНТА С ТАКИМ НОМЕРОМ НА МД НЕТ, ТО
*              ВЫДАЕТСЯ ПРЕДУПРЕДИТЕЛЬНАЯ ДИАГНОСТИКА "НЕВВЕ".
* РАЗДЕЛ- ВЫД      - ПО ДИРЕКТИВЕ  "В Ы Д"  НА ПРИГЛАШЕНИЕ
*              "РАЗДЕЛ-" ВЫДАЕТСЯ ТЕКСТ ВСЕГО ВАРИАНТА.
* РАЗДЕЛ- БЮДЖЕ    - ЗАДАЕМ ИМЯ РАЗДЕЛА ВЫДИНСА (ДО 5 СИМВОЛОВ)
* ИНФ- ДА          - ЗАДАЕМ ИНФОРМАЦИЮ К РАЗДЕЛУ; ПУСТАЯ ПОСЫЛ-
*              КА СОХРАНИТ РАЗДЕЛ НЕИЗМЕННЫМ.
* РАЗДЕЛ- МЛЗАГ
* ИНФ- ВЫД         - ПО ДИРЕКТИВЕ  "В Ы Д" НА ПРИГЛАШЕНИЕ "ИНФ-
*              ВЫДАЕТСЯ ТЕКСТ УКАЗАННОГО РАЗДЕЛА.
* РАЗДЕЛ- ЕСМЛ
* ИНФ- УБР         - ПО ДИРЕКТИВЕ  "У Б Р"  НА ПРИГЛАШЕНИЕ "ИНФ
*              УКАЗАННЫЙ РАЗДЕЛ УБИРАЕТСЯ ИЗ ТЕКСТА.
* РАЗДЕЛ- ЗАП      - ПО ДИРЕКТИВЕ  "З А П"  (И ТОЛЬКО ПО НЕЙ)
*              ИСПРАВЛЕННЫЙ ТЕКСТ ЗАПИСЫВАЕТСЯ НА МД; В ПРОТИВ-
*              НОМ СЛУЧАЕ ИЗМЕНЕНИЯ ПРОИЗВОДЯТСЯ ТОЛЬКО В ОЗУ.
* ИМЯ-     Б2В4    - ВАРИАНТ ЗАПИШЕТСЯ ПОД УКАЗАННЫМ ИМЕНЕМ.
*                    ПУСТАЯ ПОСЫЛКА ВЫЗОВЕТ ЗАПИСЬ ПОД ТЕКУЩИММ
* РАЗДЕЛ- УБР      - ПО ДИРЕКТИВЕ  "У Б Р"  НА ПРИГЛАШЕНИЕ
*              "РАЗДЕЛ-" ТЕКСТ ВАРИАНТА "ОБНУЛЯЕТСЯ";ЕСЛИ ПОСЛЕ
*              ЭТОГО СДЕЛАТЬ "ЗАП",ТО ВАРИАНТ БУДЕТ УБРАН С МД.
* РАЗДЕЛ- НОВ      - ПО ДИРЕКТИВЕ  "Н О В"  ТЕКСТ ВАРИАНТА "ОБ-
*              НУЛЯЕТСЯ" И НАЧИНАЕТСЯ РАБОТА "С ПОДСКАЗКАМИ":
*              В КАЧЕСТВЕ ПРИГЛАШЕНИЙ ВЫДАЮТСЯ НАЗВАНИЯ ОСНОВ-
*              НЫХ РАЗДЕЛОВ.
* МЛЗАГ- 2053-560
* МЛСТА- 2053
*   . . . . .
* ЕСМЛ-            - ПУСТАЯ ПОСЫЛКА ПРИВЕДЕТ К ТОМУ, ЧТО РАЗДЕЛ
*              НЕ БУДЕТ ВКЛЮЧЕН В ТЕКСТ
* РАЗДЕЛ- СЛОЙК    - МОЖНО ДОПОЛНИТЬ И(ИЛИ) ПРОВЕРИТЬ СОЗДАННЫЙ
*              "ПО ПОДСКАЗКАМ" ВАРИАНТ
* ИНФ- НЕТ
* РАЗДЕЛ-          - ПУСТАЯ ПОСЫЛКА ВЫЗОВЕТ ПЕРЕХОД К ТРАНСЛЯ-
*              ЦИИ НАХОДЯЩЕЙСЯ В ОЗУ ИНФОРМАЦИИ ДЛЯ ВЫДИНСА.
* НОМЕР- 2         - УКАЗЫВАЕТСЯ НОМЕР ВАРИАНТА ПАРАМЕТРОВ ДЛЯ
*              ГЕНСА; НУЛЕВОЙ ВАРИАНТ - ВЫДАЧА НА ПК
*              (БЕЗ ЗАПИСИ НА ДИСК).
*  003: ПРОГР ГЕНС - ФОРМИРУЕМАЯ ПРОГРАММА ЗАПИШЕТ ОТТРАНСЛИРО-
*              ВАННЫЙ ВАРИАНТ ВМЕСТО СТАРОГО ВАРИАНТА С ТЕМ ЖЕ
*              НОМЕРОМ; ЕСЛИ ЕГО НЕТ,ТО НАБОР ПАРАМЕТРОВ ПОЛУЧИ
*              МИНИМАЛЬНЫЙ "СВОБОДНЫЙ" НОМЕР.
*      В Н И М А Н И Е !   ЕСЛИ РАЗДЕЛ ДОЛЖЕН СОДЕРЖАТЬСЯ
* В ИНФОРМАЦИИ ДЛЯ ВЫДИНСА БОЛЕЕ ОДНОГО РАЗА (РАЗДЕЛЫ
* Т Е Р М, З А К С Е   И Т.Д.), ТО НЕОБХОДИМО  В С Ю
* ИНФОРМАЦИЮ УКАЗАТЬ ВМЕСТЕ ЧЕРЕЗ ТОЧКУ С ЗАПЯТОЙ,
* НАПРИМЕР:  "ИНФ-" : "ТТ:1-7;СОNS:31;АС,VТ:40-53"
*
*
*      ПРИ НЕОБХОДИМОСТИ УБРАТЬ НАБОР ГОТОВЫХ ПАРАМЕТРОВ С МД
* СЛЕДУЕТ ВЫПОЛНИТЬ СЛЕДУЮЩИЕ ДЕЙСТВИЯ (ПРИМЕР: УБИРАЕМ 2-Й
* ВАРИАНТ ПАРАМЕТРОВ ГЕНСА ДЛЯ ЭВМ-3)
* ЧТО- ГЕНС
* ПАРОЛЬ- ......
* ИМЯ-             - (ПУСТАЯ ПОСЫЛКА)
* ЭВМ- 3
* НОМЕР- 2
*  УБРАН           - ИЛИ  "Н Е В В Е", ЕСЛИ ВАРИАНТ С ТАКИМ
*              НОМЕРОМ ОТСУТСТВУЕТ.
*
*      В Н И М А Н И Е ! ВСЕ ВАРИАНТЫ ПАРАМЕТРОВ К ГЕНСУ ДЛЯ
* ДАННОЙ ЭВМ, ИМЕЮЩИЕ НОМЕР БОЛЬШИЙ, ЧЕМ ВЫБРАСЫВАЕМЫЙ, УМЕНЬША
* СВОЙ НОМЕР НА ЕДИНИЦУ.
*
*
*       11. Д И Р Е К Т И В А  "В Ы В О Д".
*  ПРЕДНАЗНАЧЕНА ДЛЯ УПРАВЛЕНИЯ РАБОТОЙ ВНЕШНИХ
* ВЫВОДНЫХ УСТРОЙСТВ (АЦПУ,ПИ,ПЛ,КЛК,ГП).
*    СТРУКТУРА ДИАЛОГА:
*    ЧТО- ВЫВОД
*    ПАРОЛЬ- .....
*    ШИФР- ВЫД
* ВЫДАЮТСЯ ШИФРЫ ЗАДАЧ, ЗАКРЕПЛ. ЗА ОПРЕД.УСТРОЙСТВАМИ
*    ШИФР- УБР 4155.....
* УДАЛЕНИЕ ШИФРА ИЗ ТАБЛИЦЫ
*    ЕСТЬ
*    ШИФР-  4155..... ( 9 ЦИФР )
* ЗАНЕСЕНИЕ НОВОГО ШИФРА
*    КЛАСС- 6
* КЛАСС В СМЫСЛЕ ОС ДИСПАК (ОПРЕД.ПРИОРИТЕТНОСТЬ ВЫДАЧИ)
*    УСТР- 2А0
* ВЫДАЧИ ОТ ЗАДАЧ С УКАЗАННЫМ ШИФРОМ НА ЭВМ 2 ПОЙДУТ
* ТОЛЬКО НА А0
*    ШИФР- ’ЕТХ’
*    МАСКА.УСТР- 2А0 3КЛК
* ДАННЫЕ УСТРОЙСТВА ЗАКРЕПЛЯЮТСЯ ТОЛЬКО ЗА ЗАДАЧАМИ
* С ШИФРАМИ ИЗ ТАБЛИЦЫ (2 И 3 - НОМЕРА ЭВМ).
*     ЕСТЬ
*    МАСКА.УСТР- ВЫД
* ВЫДАЕТСЯ ТАБЛИЦА ЗАКРЕПЛЕННЫХ УСТРОЙСТВ
*    МАСКА.УСТР- УБР
* ОСВОБОЖДЕНИЕ УСТРОЙСТВ
*    ЕСТЬ
*   МАСКА.УСТР- ’ЕТХ’
*   ШИФР-
*
*  ДИРЕКТИВА ВЫПОЛНЯЕТСЯ ТОЛЬКО С ОПЕРАТОРСКОГО ТЕРМИНАЛА !
*
*
*    12.   Д И Р Е К Т И В А   " П Р И О "
*
*      ДИРЕКТИВА ’ПРИО’ ПОЗВОЛЯЕТ ПРОСМАТРИВАТЬ И ИЗМЕНЯТЬ
* КАТАЛОГ ЗАДАЧ, Т.Е. ЯВЛЯЕТСЯ АНАЛОГОМ ДИРЕКТИВ ОПЕРАТОРА
* ’ВКП’, ’ОКП’, ’ПКП’.
*   ДИРЕКТИВА РАБОТАЕТ С АРХИВОМ РЕЖИМОВ ОС
*   П Р И М Е Р:
* ЧТО- ПРИО
* ПАРОЛЬ- ......
* ИМЯ-  ВОЗМОЖНЫЕ ОТВЕТЫ: РАБ - РАБОТАЮЩИЙ ВАРИАНТ КАТАЛОГА
*            ПРИОР. ШИФРОВ,
*                         ГОТ - ВАРИАНТ ДЛ ПЕРЕВЫЗОВА ОС,
*                         "ИМЯ"- АРХИВНЫЙ ВАРИАНТ ПОД
*            ДАННЫМ ИМЕНЕМ
* ШИФР- 4199........   - ЛЮБЫЕ ЦИФРЫ ШИФРА МОГУТ БЫТЬ ЗАМЕНЕНЫ
*                  ТОЧКАМИ.
* КЛАСС- 1             - КЛАСС ЗАДАЧИ В РЕШЕНИИ; 3-Й КЛАСС -
*                  ФОНОВЫЕ ЗАДАЧИ; 8-Й КЛАСС - ЗАДАЧИ Р.В.
*                  (ПРИ НАЛИЧИИ В РЕШЕНИИ ХОТЯ БЫ ОДНОЙ ЗАДАЧИ
*                  РЕАЛЬНОГО ВРЕМЕНИ - ЗАДАЧИ ДРУГИХ КЛАССОВ
*                  НЕ РЕШАЮТСЯ).
* КВАНТ- 177            - КВАНТ, ПОЛУЧАЕМЫЙ ЗАДАЧЕЙ.
* ПРИЗНАКИ- 3           -
* ШИФР- ПКП             - ВЫДАЧА КАТАЛОГА
* ШИФР- ОКП 419989      - ВЫБРОС ШИФРА ИЗ КАТАЛОГА
* ШИФР- ЗАП   ПЕРЕХОД В РЕЖИМ ЗАПИСИ.
* ИМЯ-  ВОЗМОЖНЫЕ ОТВЕТЫ:
*          РАБ- ЗАПИСЬ В РАБОТАЮИЙ КАТАЛОГ ПРИОРИТЕТОВ
*          ГОТ- ЗАПИСЬ В КАТАЛОГ, ПОДГОТОВЛЕННЫЙ ДЛЯ ПЕРЕ-
*                ВЫЗОВА ОС,
*          "ИМЯ"- ЗАПИСЬ В АРХИВ РЕЖИМОВ ПОД ДАННЫМ ИМЕНЕМ.
*               ЗАПИСЬ ПРОИЗОШЛА . ПРОДОЛЖЕНИЕ РАБОТЫ С ДИРЕК-
*               ТИВОЙ "ПРИО".
*
*    13.   Д И Р Е К Т И В А   ’ О П Т ’
*
*   ДИРЕКТИВА ’ОПТ’ ПОЗВОЛЯЕТ ПРОСМАТРИВАТЬ СООБЩЕНИЯ
* ВЫДАВАЕМЫЕ ОС ДИСПАК НА ОПЕРАТОРСКИЕ ТЕРМИНАЛЫ,
* СООБЩЕНИЯ ДОЛЖНЫ БЫТЬ ПРЕДВАРИТЕЛЬНО СБУФЕРИЗОВАНЫ.
*  НА ПРИГЛАШЕНИЕ ’=’ МОЖНО ЗАДАВАТЬ СЛЕДУЮЩИЕ
* ПРИКАЗЫ:
*
*             У С Т А Н О В О Ч Н Ы Е
*
*  Э В М  N - ЗАДАНИЕ НОМЕРОВ ЭВМ;
*  Д А Т  ДД.ММ - УСТАНОВКА ДАТЫ; Д А Т БЕЗ ПАРАМЕТРА - ВЫДАЧА
*                 УСТАНОВКИ ПО ДАТЕ;
*  В Р Е  ЧЧ.ММ-ЧЧ.ММ - УСТАНОВКА ВРЕМЕНИ; В Р Е БЕЗ ПАРАМЕТРА0
*                       ВЫДАЧА УСТАНОВКИ ПО ВРЕМЕНИ;
*  С Н Я    -   СНЯТИЕ ВСЕХ УСТАНОВОК ( ПО ДАТЕ И ВРЕМЕНИ )
*
*             И С П О Л Н Т Е Л Ь Н Ы Е
*
*  В Ы Д - ВЫДАЮТСЯ ВСЕ СООБЩЕНИЯ;
*  Н А Й - ПРОИЗВОДИТСЯ ПОИСК СООБЩЕНИЙ ПО
*          ЗАДАННОМУ КОНТЕКСТУ.
*       ИСПОЛНИТЕЛЬНЫЕ ПРИКАЗЫ ДЕЙСТВУЮТ ВНУТРИ УСТАНОВОК.
* П Р И М Е Р :
*  =ВЫД  -  ВЫДАЮТСЯ 12 СТРОК СООБЩЕНИЙ И ЗАТЕМ ВОПРОС
*           ИДТИ. ПРИ ПОЛОЖИТЕЛЬНОМ ОТВЕТЕ (ЕТХ) ПРОИС-
*           ХОДИТ ВЫДАЧА СЛЕДУЮЩИХ 12 СТРОК,ПРИ ОТРИЦА-
*           ТЕЛЬНОМ ВЫДАЕТСЯ ПРИГЛАШЕНИЕ =.
*  =ЭВМ 1    -  УСТАНАВЛИВАЕТСЯ РЕЖИМ ВЫДАЧИ ТОЛЬКО ДЛЯ
*               МАШИНЫ 1.
*  =НАЙ КЗ     -  ПРИЗВОДИТСЯ ВЫВОД СООБЩЕНИЙ, СОДЕРЖАЩИХ
*                 В СЕБЕ КОНТЕКСТ  ’КЗ’.
*   ДЛИНА КОНТЕКСТА НЕ БОЛЕЕ 6 СИМВОЛОВ.
*   ПРИ ПЕРВОМ ВХОДЕ ПО ДИРЕКТИВЕ ’ОПТ’ В ПРОСМОТР СООБЩЕ-
*   НИЙ СЧИТАЮТСЯ ЗАДАННЫМИ N ВСЕХ ЭВМ  (N ОТ 1 ДО 7),
*   УСТАНОВЛЕН РЕЖИМ ВЫДАЧИ НА ЭКРАН И НЕТ РЕЖИМА
*   ВЫДАЧИ НА ПЕЧАТЬ. ДАННЫЕ РЕЖИМЫ МЕНЯЮТСЯ ДИРЕКТИ-
*   ВАМИ  V. И А.
*
*
*            14. ДИРЕКТИВА  С В Я З Ь.
*
*      ПРЕДНАЗНАЧЕНА ДЛЯ ФОРМИРОВАНИЯ ЗАКАЗОВ НА ПЕРЕДАЧУ
*    ИНФОРМАЦИИ МЕЖДУ ЭВМ (БЭСМ-6, СВС) ЧЕРЕЗ ТРАНСПОРТНУЮ
*    СТАНЦИЮ ( ТС НЕОБХОДИМО ВЫЗВАТЬ НА 2-Х ЭВМ ПО КЛЮЧУ
*    "КАИН"). СТРУКТУРА ДИАЛОГА:
*        ЧТО- СВЯЗЬ
*        РЕЖИМ- ЗАК   -   РЕЖИМ ОТЛОЖЕННЫХ ЗАКАЗОВ ДЛЯ ТС
*        РАБОТА - ВЫД N   ПРОСМОТР ЗАКАЗОВ (N-НОМЕР ЗАКАЗА)
*        РАБОТА - УБР N   ВЫБРАСЫВАНИЕ ЗАКАЗА ИЗ СПИСКА
*    ( ПРСМАТРИВАТЬ И УБИРАТЬ МОЖНО ТОЛЬКО "СВОИ" ЗАКАЗЫ;
*      ЗАКАЗЫ ИДЕНТИФИЦИРУЮТСЯ ШИФРОМ "ЗАКАЗЧИКА").
*        РАБОТА - НОВ     ПОСТАНОВКА ЗАКАЗА В ОЧЕРЕДЬ.
*    ДАЛЕЕ БУДУТ ЗАПРОШЕНЫ ПАРАМЕТРЫ ЗАКАЗА. ПРИЗНАКОМ ТОГО,
*    ЧТО ЗАКАЗАННЫЙ ТОМ ПРИНАДЛЕЖИТ ДРУГОЙ ЭВМ, ЯВЛЯЕТСЯ
*    СИМВОЛ "+" ПОСЛЕ ИДЕНТИФИКАТОРА ТОМА. НАПРИМЕР, 2048+.
*    ЗАКАЗ БУДЕТ ПРИНЯТ, ЕСЛИ ЕСТЬ МЕСТО В БУФЕРЕ ЗАКАЗОВ.
*        РАБОТА-  ’ЕТХ’
*        РЕЖИМ - ПРД      РЕЖИМ НЕПОСРЕДСТВЕННОЙ ПЕРЕДАЧИ
*                         ИНФОРМАЦИИ ВО ВРЕМЯ СЕАНСА.
*    ДАЛЕЕ СНОВА ЗАПРОС ПАРАМЕТРОВ ЗАКАЗА.
*    ИНФОРМАЦИЯ ЛИБО БУДЕТ ПЕРЕДАНА, ЛИБО БУДЕТ ВЫДАНА
*    ПРИЧИНА ОТКАЗА. НАПРИМЕР:
*                             " НЕТ ТС В РЕШЕНИИ",
*                             " ОБРЫВ СВЯЗИ",
*                             " НЕВЕРНЫЙ ПАРОЛЬ" И ДР.
*          *   *   *   *   *   *   *   *   *   *
*
*        А Р Х И В   Р Е Ж И М О В   Р А Б О Т Ы   О С
*
*      ДЛЯ ДИРЕКТИВ СЕРП’А - ПРИО, ПЛАН
* ВВЕДЕНА ВОЗМОЖНОСТЬ ХРАНИТЬ НЕСКОЛЬКО ВАРИАНТОВ ИНФОРМАЦИИ
*      ВАРИАНТЫ ХРАНЯТСЯ В СПЕЦИАЛЬНО ВЫДЕЛЕННОЙ ДЛЯ ЭТОГО
* ЗОНЕ СИСТЕМНОГО ДИСКА (751) ПОД ИМЕНАМИ, СОСТОЯЩИМИ НЕ
* БОЛЕЕ ЧЕМ ИЗ 6 СИМВОЛОВ. ДВА ИМЕНИ РЕЗЕРВИРУЮТСЯ:
*     "РАБ" - ВАРИАНТ, РАБОТАЮЩИЙ В ДАННЫЙ МОМЕНТ;
*     "ГОТ" - ВАРИАНТ, ВЫЗЫВАЕМЫЙ В РАБОТУ ПОСЛЕ ПЕРЕВЫЗОВА
*
*      ВСЕ ДИРЕКТИВЫ СЕРПА, ИСПОЛЬЗУЮЩИЕ АРХИВ, РАБОТАЮТ
* ПО СЛЕДУЮЩЕЙ СХЕМЕ: ВЫБОР РЕДАКТИРУЕМОГО ВАРИАНТА;
* РЕДАКТИРОВАНИЕ; ЗАПИСЬ (ВОЗМОЖНО, ПОД ДРУГИМ ИМЕНЕМ);
* РЕДАКТИРОВАНИЕ; И Т.Д.
*     В ЗАВИСИМОСТИ ОТ ДИРЕКТИВЫ ВАРИАНТ ЯВЛЯЕТСЯ ОБЩИМ
* ДЛЯ ВСЕХ ЭВМ ("ПРИО") ИЛИ СОДЕРЖИТ ПОДВАРИАНТ ДЛЯ
* КАЖДОЙ ЭВМ КОМПЛЕКСА ("ПЛАН"). В ПОСЛЕДНЕМ СЛУЧАЕ
* ПРИ ВЫБОРКЕ В РАБОЧЕЕ ПОЛЕ И ЗАПИСИ ВАРИАНТА ДОПОЛ-
* НИТЕЛЬНО ЗАПРАШИВАЕТСЯ НОМЕР ЭВМ (КРОМЕ ВАРИАНТА"РАБ").
*     ДЛЯ ЛИКВИДАЦИИ ВАРИАНТА НЕОБХОДИМО НА ЗАПРОС
* ИМЕНИ ПРИ ВЫБОРЕ ВАРИАНТА ДАТЬ ОТВЕТ "УБР"; НА ЗАПРОС
* "УБР- "  ЗАДАТЬ ИМЯ УБИРАЕМОГО ВАРИАНТА.
*
* ЗАПИСЬ ВАРИАНТА В "РАБ" РАЗРЕШЕНА ТОЛЬКО С ОПЕРАТОРСКОГО
*  ТЕРМИНАЛА. ЗАПИСЬ ВАРИАНТА В "ГОТ" ВЫЗЫВАЕТ ЗАПИСЬ
*  И В ВАРИАНТ "РАБ".
*
*
*       15.   Д И Р Е К Т И В А  "Р И Т М"
*
*    ВЫЗОВ РЕДАКТОРА "БЕМШ" ИЗ СИСТЕМЫ "СЕРП".
*
*       16.   Д И Р Е К Т И В А   "Б А Ц".
*
*   ПРЕДНАЗНАЧЕНА ДЛЯ ПРОСМОТРА ВЫДАЧ, ЗАПИСАННЫХ В АРХИВНУЮ
*  ОБЛАСТЬ С ПОМОЩЬЮ РАЗДЕЛА "БАЦ" В ПАСПОРТЕ.
*  СТРУКТУРА ДИАЛОГА:
*           ЧТО- БАЦ
*           ТОМ- ИМЯ ОБЛАСТИ
*  ДАЛЕЕ СЛЕДУЕТ ПРИГЛАШЕНИЕ, В ОТВЕТ НА КОТОРОЕ МОЖНО
*  НАБРАТЬ ОДНУ ИЗ СЛЕДУЮЩИХ ДИРЕКТИВ:
*           В  [N]  -  ПРОСМОТР ТЕКСТА, ВОЗМОЖНО С N-ОЙ
*                      СТРОКИ.
*          ДЛ[И]    -  ДЛИНА БУФЕРА.
*           П[ОЗ]  N1 N2  -  ПОСЛЕ ВЫПОЛНЕНИЯ ЭТОЙ ДИР-ВЫ
*                            НА ЭКРАН БУДУТ ВЫДАВАТЬСЯ
*                            ТОЛЬКО ПОЗИЦИИ СТРОКИ С N1 ПО
*                            N2.
*          НАЙ КОНТЕКСТ   -  КОНТЕКСТНЫЙ ПОИСК.
*          А[ЦП] - ПЕЧАТЬ ЛИСТИНГА.
*
*
*             17. ДИРЕКТИВА  С Б П.
*
*   ДИРЕКТИВА ПРЕДНАЗНАЧЕНА ДЛЯ ВЫДАЧИ ИНФОРМАЦИ О СБОЯХ ПВВ.
*   СТРУКТУРА ДИАЛОГА:
*             ЧТО -  СБП
*             РАБОТА- ВЫД
*       ВЫДАЧА НА ЭКРАН КРАТКОЙ ИНФОРМАЦИИ О СБОЙНЫХ КАРТАХ
*       РАБОТ ПВВ.
*             РАБОТА- ПЕЧ <ДИАПАЗОН КАРТ>
*       ФОРМИРОВАНИЕ ЗАДАЧИ ПЕЧАТИ ПОЛНОЙ ИНФОРМАЦИИ О
*       СБОЯХ. ХРАНИТСЯ ИНФОРМАЦИЯ О 8-И СБОЙНЫХ КАРТАХ.
*       (<ДИАПАЗОН КАРТ>:=1-8 => ПЕЧАТЬ ВСЕЙ НАКОПЛЕННОЙ
*        ИНФОРМАЦИИ)
*
*  З А П У С К   С Е Р П   В   П А К Е Т Н О М   Р Е Ж И М Е
*
*      ДЛЯ ЗАПУСКА СЕРП С ПЕРФОКАРТ НЕОБХОДИМО СФОРМИРОВАТЬ
* СЛЕДУЮЩУЮ КОЛОДУ:
* ШИФР ОГЧЕЗКЗАДАВА’ ОЗУ 20’ ВРЕ 220’ ВХО 70000’
* Е В 70000 К 00 110 0011 00 050 0131
* К 00 26 70002 00 074 0000 К 00 110 0011 15 24 40000
* К 00 050 0121 К 00 170 0012 К 00 170 0013 К 00 170 0014
* К 00 170 0015 К 00 30 00001 С 55 77 0000 00 22 0123
* С 00 10 0000 00 55 0731 С 00 10 0100 00 55 0732
* С 00 10 0200 00 55 0733 С 00 10 0300 00 55 0734
* С 00 00 0000 00 00 0012 (7-1 РР. - КОД КОНЦА ДИРЕКТИВЫ,ЗДЕСЬ)
* В 64000 А1
*   НАБОР ДИРЕКТИВ СЕРП’А В СООТВЕТСТВИИ С ЗАПРОСАМИ,
*   КОТОРЫЕ ЗАДАВАЛИСЬ БЫ В ДИАЛОГОВОМ РЕЖИМЕ. КОД
*   КОНЦА ДИРЕКТИВЫ ОПРЕДЕЛЯЕТСЯ ПОЛЬЗОВАТЕЛЕМ ПРОИЗВОЛЬНО.
*   ЗАПРЕЩАЕТСЯ ИСПОЛЬЗОВАНИЕ ДИРЕКТИВ "А.", "НАЧ" И Т.Д.
* КНЦ+ - ДИРЕКТИВА СЕРПА ЗАКАНЧИВАЕТСЯ УКАЗАННЫМ ВЫШЕ ПРИЗНАКОМ
*        КОНЦА ДИРЕКТИВЫ.
* _ ◇ ЕКОНЕЦ
*
*
****************************************************
*
*     И Н С Т Р У К Ц И Я   П О   Р А Б О Т Е      *
*       С   Р Е Д А К Т О Р О М  " Б Е М Ш "       *
*                                                  *
****************************************************
*
*    РЕДАКТОР  "Б Е М Ш"  ПРЕДНАЗНАЧЕН ДЛЯ РЕДАКТИРОВАНИЯ
*  ТЕКСТОВ,  ХРАНЯЩИХСЯ  В  АРХИВЕ  А Р А П.
*  СТРУКТУРА  ДИАЛОГА  С РЕДАКТОРОМ  ТАКОВА:
*   БОБ-  NБОБ/ИМЯОБЛ  [СДВИГ]
*  ( ЕСЛИ ПОСЛЕ NБОБ НАБРАТЬ СИМВОЛ ".", ТО СИСТЕМА
*    НАСТРОИТСЯ НА РАБОТУ С ЗАКРЫТОЙ ЧАСТЬЮ АРХИВА. )
*   РАБОТА-
*   ПРЕДУСМАТРИВАЕТСЯ  6  РАБОТ:
*     РАА - РЕДАКТИРОВАНИЕ  ТЕКСТА,
*     ОГЛ - ВЫДАЧА  ОГЛАВЛЕНИЯ,
*     НОВ - ЗАВЕДЕНИЕ  НОВОЙ  АП.
*     ЛИСТ - ТРАНСЛЯЦИЯ ТЕКСТА ИЗ АРХИВА "АРАП".
*       НЕРЕАЛИЗОВАННЫЕ  РАБОТЫ:
*     УПЛ - УПЛОТНЕНИЕ  АРХИВА,
*     УНЧ - УНИЧТОЖЕНИЕ  АП.
*  РАССМОТРИМ  РАБОТУ  РАА.
*    ИМЯ-  ИМЯ АП
*  ДАЛЕЕ  СЛЕДУЕТ  УНИВЕРСАЛЬНОЕ  ПРИГЛАШЕНИЕ  "-"  И
*  МОЖНО  ВВОДИТЬ  ДИРЕКТИВЫ  РЕДАКТИРОВАНИЯ.
*   ИМЕЮТСЯ  СЛЕДУЮЩИЕ  ДИРЕКТИВЫ:
*    В[ЫД]  NСТР/МЕТКА  -  ВЫДАЧА  ТЕКСТА,
*    ВС[Т]  NСТР  -  ВСТАВИТЬ  ПЕРЕД  ДАННОЙ  СТРОКОЙ
*      НИЖЕСЛЕДУЮЩИЙ  ТЕКСТ,
*   О[ТМ]  NСТР1 [- NСТР2]  -  ОТМЕНИТЬ  ДИАПАЗОН  СТРОК,
*   ЗАМ    NСТР1 [-NСТР1]  -  ЗАМЕНИТЬ  ДИАПАЗОН  СТРОК,
*   ( ДЛЯ ВВОДА ИСПРАВЛЕНИЙ ВЫДАЕТСЯ ПРИГЛАШЕНИЕ "+")
*   Д[ОБ]  -  ДОБАВИТЬ В КОНЕЦ ТЕКСТА,
*   Р[ЕД]  -  ПОЛУЭКР.  РЕДАКТИРОВАНИЕ( КАК В "КРАБЕ"),
*   З[АП]  -  ЗАПИСЬ  АП  В  АРХИВ
*   Ф[ОР]  NСТР/МЕТКА  -  ФОРМИРОВАНИЕ  ЗАДАЧИ
*   ДЛ[И]  -  ВЫДАЧА ТЕКУЩЕЙ ДЛИНЫ АП,
*   НАЙ   КОНТЕКСТ  -  КОНТЕКСТНЫЙ ПОИСК.
*  ДИРЕКТИВУ Ф[ОР] СЛЕДУЕТ РАССМОТРЕТЬ ПОДРОБНЕЕ.
*  ФОРМИРУЕМЫЙ ТЕКСТ БЕРЕТСЯ, НАЧИНАЯ СО СТРОКИ,
*  ИДУЩЕЙ ПОСЛЕ МЕТКИ, УКАЗАННОЙ В ПАРАМЕТРЕ, ИЛИ
*  СО СТРОКИ, НОМЕР КОТОРОЙ УКАЗАН В ПАРАМЕТРЕ.
*  ФОРМИРУЕМЫЙ ТЕКСТ ДОЛЖЕН БЫТЬ ОФОРМЛЕН СПЕЦИАЛЬ-
*  НЫМ ОБРАЗОМ. ДЛЯ ЭТОГО СУЩЕСТВУЕТ НАБОР СПЕЦ.
*  СИМВОЛОВ ВИДА /’СИМВОЛ’, УПРАВЛЯЮЩИХ ПРОЦЕССОМ
*  ФОРМИРОВАНИЯ.
*              1. СПЕЦИАЛЬНЫЕ СИМВОЛЫ ОБЩЕГО
*                 НАЗНАЧЕНИЯ.
*
*     /Ф - ПРИЗНАК НАЧАЛА ПАКЕТА. ВМЕСТО /Ф
*          ПОДСТАВЛЯЕТСЯ ШИФР.
*     /Б - ПОДСТАВЛЯЕТСЯ НОМЕР ТОМА, С КОТОРЫМ
*          ВЕДЕТСЯ РАБОТА.
*     /СNNN - К КАЖДОЙ СЛЕДУЮЩЕЙ СТРОКЕ В КОНЦЕ
*               ДОБАВЛЯЕТСЯ СИМВОЛ NNN(8).
*             ( ДЛЯ МС "ДУБНА" НЕОБХОДИМО СТАВИТЬ
*               /С341 ПЕРЕД СТРОКОЙ ЕЕВ1АЗ)
*      /Т - ПОСЛЕДУЮЩИЙ ТЕКСТ (ДО 6 СИМВОЛОВ)
*           ДО "/" ВЫДАЕТСЯ НА ТЕРМИНАЛ В
*           КАЧЕСТВЕ ВОПРОСА. ОТВЕТНЫЙ ТЕКСТ
*           ВСТАВЛЯЕТСЯ В ФОРМ. ЗАДАЧУ ВМЕСТО
*           КОНСТРУКЦИИ /Т.
*      /П - АНАЛОГИЧНО, ТОЛЬКО ЗАПРАШИВАЕТСЯ
*           ПРОИЗВОЛЬНЫЙ ПАРОЛЬ.
*      /Ю - ДИСПЕТЧЕРСКИЙ КОНЕЦ.
*      /Е - КОНЕЦ ПАКЕТА
*      /. - НАДЧЕРКИВАНИЕ
*      /- - ПЕРЕХОД НА СЛЕД. СТРОКУ БЕЗ НАДЧ.
*
*                2. СПЕЦ. СИМВОЛЫ ДЛЯ БЕСКАРТОЧНОГО
*                   РЕДАКТИРОВАНИЯ.
*
*      /ВNNN - ВСТАВИТЬ ПОСЛЕДУЮЩИЙ ТЕКСТ ПЕРЕД
*              СТРОКОЙ NNN.
*      /ДNNN-МММ - ОТМЕНИТЬ ДИАПАЗОН СТРОК NNN-МММ
*                  И ВСТАВИТЬ НА ИХ МЕСТО ПОСЛЕДУЮЩИЙ
*                  ТЕКСТ, ЕСЛИ ОН ЕСТЬ.
*      /Р - КОНЕЦ ПАКЕТА ИСПРАВЛЕНИЯ "АРАП".
*      /К - КОНЕЦ ПАКЕТА "АРАП".
*   ВСЕ ЭТИ СИМВОЛЫ ПРЕДНАЗНАЧЕНЫ ДЛЯ РАБОТЫ С СИСТЕМОЙ
*   "АРАП".
*    ДИРЕКТИВА Ф[ОР] МОЖЕТ ИМЕТЬ 2-Й ПАРАМЕТР - СПИСОК
*   ТИПОВ ЗАМЕНЫ (0<= ТИП ЗАМЕНЫ <=47). ЕСЛИ ЭТОТ ПАРАМЕТР
*   УКАЗАН, ТО В ФОРМИРУЕМЫЙ ПАКЕТ ВКЛЮЧАЮТСЯ ТОЛЬКО
*   ЗАМЕНЫ ЭТИХ ТИПОВ И ЗАМЕНЫ БЕЗ УКАЗАНИЯ ТИПА. ПОД
*   ЗАМЕНОЙ ПОДРАЗУМЕВАЮТСЯ СТРОКИ, НАЧИНАЮЩИЕСЯ
*   СО /Д ИЛИ /В. ТИП ЗАМЕНЫ УКАЗЫВАЕТСЯ ЧЕРЕЗ ПРОБЕЛ
*   В КОНЦЕ СТРОКИ.
*              РАССМОТРИМ РАБОТУ "ЛИСТ".
*   СТРУКТУРА ДИАЛОГА:
*         РАБОТА- ЛИСТ
*         РЕС- НУЖНО УКАЗАТЬ ДОП. РАЗДЕЛЫ ПАСПОРТА
*              ЗАДАЧИ ТРАНСЛЯЦИИ, НУЖНЫЕ ПОЛЬЗОВАТЕЛЮ.
*              ПРИ "ЕТХ" ФОРМИРУЕТСЯ ПАСПОРТ:
*                        ШИФ  ХХХХХХЗС1
*                        ЛЕН 42(/Б)
*                        Е
*              РАЗДЕЛЫ НУЖНО УКАЗЫВАТЬ ЧЕРЕЗ НАДЧЕРК В
*              СТРОКУ.
*         ИМЯ- ИМЯ АВТОКОД-ПРОГРАММЫ.
*         РЕЖТРН- УКАЗАНИЕ РЕЖИМОВ ТРАНСЛЯЦИИ В СТРОКУ
*                 ЧЕРЕЗ НАДЧЕРК.
*                 ПРИ "ЕТХ" ФОРМИРУЕТСЯ СЛЕД. ПАКЕТ:
*                    ТРН◇◇◇
*                    0-0
*    ТРН◇◇◇ ПОДСТАВЛЯЕТСЯ ВСЕГДА. ЕСЛИ НЕОБХОДИМО ЗАКАЗАТЬ
*    ТОМ НА ЗП. (НАПРИМЕР РЕЖИМ "ЗОНМОД"), НАДО НАБИРАТЬ
*    НЕ "ЛИСТ", А "ЛИСТЗ". В РЕЗУЛЬТАТЕ ЭТОГО ДИАЛОГА
*    БУДЕТ СФОРМИРОВАНА ЗАДАЧА ТРАНСЛЯЦИИ.
*         СТАНДАРТНЫЙ   ПАСПОРТ
*            ОЗУ 9
*            РОС 0
*            ВРЕ 220
*            ВХО 70000
*            АЦП 2
*            ТЕЛ
*            ИНК
*            Е
*            В 70000
*            К 00 110 0010 00 050 0131
*            К 00 26 70002 00 074 0000
*            К 00 110 0010 15 24 40000
*            К 00 050 0121
*            К 00 170 0011
*            К 00 170 0012
*            К 00 22 55777 00 062 0000
*            К 00 30 00001
*            С 5577 0000 0022 0123
*            С 0010 0000 0055 0516
*            С 0010 0100 0055 0517
*            Е
*КОНЕЦ ЧАСТИ
